[
  {
    "headline": "Prime Minister’s Address to the Knesset ",
    "summaryText": "<p>His Excellency, Prime Minister Benjamin Netanyahu,</p><p>His Excellency, Mr. Amir Ohana, Speaker of the Knesset,</p><p>His Excellency, Mr. Yair Lapid, Leader of the Opposition,</p><p>Hon’ble Members of the Knesset,</p><p>My dear sisters and brothers,</p><p>Shalom!</p><p>Namaste!</p><p>Hon’ble Members,</p><p>It is a privilege and an honour for me to stand before this distinguished House. I do so as the Prime Minister of India, and also as a representative of one ancient civilisation addressing another. I bring with me the greetings of 1.4 billion Indians, and a message of friendship, respect, and partnership.</p><p>I thank you, Mr. Speaker, for your kind invitation. And for your wonderful gesture of lighting up the Knesset in Indian colours. Your visit to India three years ago was the first by a Speaker of the Knesset. And thanks to you, I am the first Prime Minister of India to address this august gathering.</p><p>Nine years ago, I had the good fortune to be the first Prime Minister of India to visit Israel. And I am very happy to be here again, returning to a land to which I have always felt drawn. Afterall, I was born on the same day that India formally recognized Israel – September 17, 1950!</p><p>Hon’ble Members,</p><p>I also carry with me the deepest condolences of the people of India for every life lost and for every family whose world was shattered in the barbaric terrorist attack by Hamas on \"October 7”. We feel your pain. We share your grief. India stands with Israel, firmly, with full conviction, in this moment, and beyond.</p><p>No cause can justify the murder of civilians. Nothing can justify terrorism.</p><p>India has also endured the pain of terrorism for a long time. We remember the 26/11 Mumbai attacks and the innocent lives lost, including Israeli citizens. Like you, we have a consistent and uncompromising policy of zero tolerance for terrorism, with no double standards.</p><p>Terrorism aims to destabilise societies, to block development, and to erode trust. Countering terrorism requires sustained and coordinated global action, because terror anywhere threatens peace everywhere. That is why, India supports all efforts that contribute to durable peace and regional stability.</p><p>Some years ago, when you concluded the Abraham Accords, we applauded your courage and vision. It was a moment of new hope for a long-troubled region. Since then, the situation has changed significantly. The path is even more challenging. Yet it is important to sustain that hope.</p><p>The Gaza Peace Initiative that was endorsed by the UN Security Council offers a pathway. India has expressed its firm support for the initiative. We believe that it holds the promise of a just and durable peace for all the people of the region, including by addressing the Palestine Issue.</p><p>Let all our efforts be guided by wisdom, courage, and humanity. The road to peace is not always easy. But India joins you and the world for dialogue, peace and stability in this region.</p><p>Hon’ble Members,</p><p>In India, there is great admiration for Israel’s resolve, courage, and achievements. Long before we related to each other as modern States, we were linked by ties that go back more than two thousand years. The Book of Esther refers to India as Hodu. The Talmud records trade with India in ancient times.</p><p>Jewish merchants travelled across sea routes that connected the Mediterranean with the Indian Ocean. They came seeking opportunity and dignity. And, in India, they became one of us.</p><p>Jewish communities have lived in India without fear of persecution or discrimination. They have preserved their faith and participated fully in society. That record is a source of pride for us.</p><p>Hon’ble Members,</p><p>The Bene Israel of Maharashtra, the Cochini Jews of Keralam, the Baghdadi Jews of Kolkata and Mumbai, and the Bnei Menashe of the North East have enriched India. In my home state Gujarat, there is a school set-up by a Bene Israeli family - Mister and Missus Best. It is an excellent school, and of course, it is called the Best School!</p><p>Edwyn Myers gave shape to the Films Division of India and was a towering figure in the history of Indian cinema. Doctor Reuben David was the founder of the Kankaria Zoo in Ahmedabad. The actor David Abraham Cheulkar, or Uncle David, became a household name across the country. Walter Kaufmann composed the signature tune for All India Radio. David Sassoon built many institutions that still serve Indian society.</p><p>And, of course, the heroic contribution of Lt. General J.F.R. Jacob during the 1971 war with Pakistan is widely known. I had the honour of working closely with him after his retirement. We discussed India-Israel relations, among many other things, over many cups of tea. There have been countless others whose contributions are woven into India’s rich fabric of life.</p><p>Hon’ble Members,</p><p>There was movement from India to Israel too, when many Indian Jews migrated to Israel in the mid twentieth century. Today, a vibrant Indian-origin Jewish community lives here. They have contributed to the building of modern Israel, in laboratories and hospitals, in classrooms, and also on the battlefield. They hold firmly that Israel is their fatherland and India their motherland. We are proud of them.</p><p>Hon’ble Members,</p><p>India’s connection to this land is also written in blood and sacrifice. During the First World War, more than four thousand Indian soldiers laid down their lives in this region. The cavalry charge at Haifa in September 1918 remains a significant chapter in military history.</p><p>Major Thakur Dalpat Singh, remembered as the Hero of Haifa, symbolises this shared history. During my last visit, I was deeply moved to pay my respects at the Haifa memorial for Indian soldiers.</p><p>Hon’ble Members,</p><p>Last month, the world marked the International Holocaust Remembrance Day. The Holocaust stands as one of humanity’s darkest chapters. Yet, even in those turbulent years, some acts of humanity stood out. The Maharaja of Nawanagar in Gujarat, also known as the Jam Saheb, offered refuge to Polish children, including Jewish children, who had nowhere else to turn. I am told that a statue of Jam Saheb was unveiled in Moshav Nevatim recently.</p><p>Thank you. Thank you, for this honour and remembrance.</p><p>Hon’ble Members,</p><p>After India’s independence, many Indian leaders felt a kinship with the people of Israel. India’s parliamentary debates of the 1950s are witness to their admiration for Israel’s efforts to develop agriculture in the desert. The Kibbutz movement of Israel inspired our leaders like Acharya Vinoba Bhave and Loknayak Jayaprakash Narayan. First in my home state Gujarat, and now across India, I have seen the approach of \"Per Drop, More Crop” work wonders in agriculture.</p><p>My own first visit to Israel was in 2006, as the Chief Minister of Gujarat. Later, in 2017, during my visit to Israel as Prime Minister, our two countries elevated their relationship to a Strategic Partnership. Since then, our engagement has expanded in scale and scope. And we are committed to further consolidate this relationship across many sectors.</p><p>Hon’ble Members,</p><p>For the last few years, India has been the fastest-growing major economy in the world. Soon, we will be among the top three economies globally. At the same time, Israel is a powerhouse of innovation and technological leadership. This creates a natural foundation for a forward-looking partnership.</p><p>We are committed to expanding trade, strengthening investment flows, and promoting joint infrastructure development. The Bilateral Investment Treaty signed last year will provide confidence and predictability to our businesses.</p><p>In the last few years, India has concluded a number of important trade agreements with other nations. To your West, the European Union, and the UK. To your East, the UAE and Oman.</p><p>Our bilateral goods trade has grown manifold in recent years. But, it does not reflect the full scope of opportunity. That is why our teams are working hard to negotiate an ambitious Free Trade Agreement. It will unlock the vast untapped potential in our trade relationship.</p><p>We will also work closely in different formats such as the India–Middle East–Europe Economic Corridor and the I2U2 framework between India, Israel, UAE and the US. Defence and Security is another important pillar of our partnership. In November last year, we signed an MOU on Defence Cooperation. In today’s uncertain world, a strong defence partnership between trusted partners like India and Israel is of vital importance.</p><p>Hon’ble Members,</p><p>Israel is often called the \"start-up nation”. In recent years, we have also been working to unlock the innovation and creativity of our youth. I recall that in 2018, Prime Minister Netanyahu and I inaugurated the iCreate Technology Business Incubator in India. Since then, it has supported nearly 900 such start-ups.</p><p>Last week, we hosted the world’s largest and most democratised AI Impact Summit, with representatives from over 100 countries. Our aspirational spirit aligns naturally with Israel’s innovation ecosystem. I see a lot of synergies in areas such as quantum technologies, semiconductors, and artificial intelligence. We are also working with Israel on creating cross-border financial linkages using our Digital Public Infrastructure.</p><p>Hon’ble Members,</p><p>I mentioned how inspiring we found Israel’s agricultural miracle in the desert. Israeli expertise in precision irrigation and water management has already transformed agricultural practices in India.</p><p>Together, we have established 43 Centres of Excellence across India that have provided training to more than half a million farmers. We should now set an ambitious goal of expanding to 100 Centres to benefit millions of farmers and fishermen.</p><p>Hon’ble Members,</p><p>At the heart of the India-Israel partnership are the ties between our peoples. When I first visited Israel in 2006, there were a handful of Yoga centres in Israel. Today, Yoga seems to be practiced in almost every neighbourhood!</p><p>I am told that interest in Ayurveda is also growing in Israel. I invite more and more young Israelis to travel to India. They will witness the dynamism of our society, and experience what holistic wellness can do for the body and the mind.</p><p>I am happy to inform this august house that the Indian Parliament has set-up a Parliamentary Friendship Group for Israel. I invite you all to visit India and look forward to having more exchanges between our Members of Parliament.</p><p>I am aware that Indian caregivers and skilled workers in Israel contribute immensely to families and communities. They have displayed remarkable courage and dedication in times of crisis, including on October 7. We are proud of them.</p><p>As the Jewish teaching reminds us, \"Whoever saves one life, saves the entire world.” Their service reflects the strength of the human bonds behind our cooperation. We will continue to facilitate the movement of workers and professionals across sectors that benefit both of our nations.</p><p>Hon’ble Members,</p><p>We are both ancient civilizations. And it is perhaps no surprise that our civilisational traditions also reveal philosophical parallels. In Israel, the principle of Tikkun Olam speaks of healing the world. In India, Vasudhaiva Kutumbakam affirms that the world is one family. Both ideas extend responsibility beyond immediate boundaries. They ask societies to act with compassion and moral courage.</p><p>Judaism emphasises Halakha, guiding everyday conduct through law and practice. Hindu philosophy speaks of Dharma, the moral order that shapes duty and right action. In both traditions, ethical life is lived through action, and faith is expressed through conduct.</p><p>There is an endearing similarity in our festivals as well. You celebrate Hanukkah with the warm glow of candles. Around the same time, we celebrate Diwali, the festival of lights, with the gentle radiance of lamps. Soon, India will celebrate the festival of Holi, filled with happiness and colour. And around the same time, Israel will also celebrate Purim with enthusiasm and joy.</p><p>Hon’ble Members,</p><p>Our shared ideals are the deep foundations that give strength to our modern partnership. We are democracies shaped by history and focused on the future. Our partnership is grounded in shared experience and shared aspirations. Our strong partnership not only serves national interests but also contributes to global stability and prosperity.</p><p>Let us ensure that the friendship between India and Israel remains a source of strength in an uncertain world.</p><p>Am Yisrael Chai.</p><p>Jai Hind.</p><p>Thank you.</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232908&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister addresses the Israeli Parliament - Knesset",
    "summaryText": "<p>Prime Minister Shri Narendra Modi addressed today a Special Plenary of the Knesset in Jerusalem. He is the first Indian Prime Minister to address the Israeli parliament.</p><p>Upon his arrival at the Knesset, Prime Minister was received by the Speaker of the Knesset, H.E. Amir Ohana and accorded a ceremonial welcome. The Prime Minister of Israel, H.E. Mr. Benjamin Netanyahu; Leader of Opposition, H.E. Mr Yair Lapid; and Speaker Ohana spoke in the Plenary ahead of Prime Minister’s address, expressing strong bipartisan support for India-Israel ties.</p><p>Prime Minister began his address by thanking the Speaker for the special honour. He expressed gratitude for being bestowed with the \"Speaker of The Knesset” medal, which he dedicated to the enduring friendship and shared democratic traditions of the two countries. Highlighting the strong bonds of friendship between India and Israel, Prime Minister noted that the two peoples share both ancient civilizational ties and a robust contemporary partnership based on technology, innovation, defence, security and strategic convergences. He stated that the vibrant people-to-people ties based on cooperation in agriculture, rural development, water management, sustainability and enterprise have imparted a dynamic outlook to the relationship. Underlining the historical connections and two-way movement of people between the two countries, Prime Minister stated that the Indian community in Israel and the Jewish diaspora in India have made significant contribution to progress in both countries.</p><p>Recalling the uncompromising policy of zero tolerance for terrorism of the two countries, Prime Minister offered condolences for the October 7 terror attack and noted that there can be no justification for such brutality. He offered India’s support to all efforts that contribute to durable peace and stability in the region. In this context, he highlighted India’s firm support for the Gaza Peace Initiative endorsed by the UN Security Council. Noting the ongoing collaboration between India and Israel in the plurilateral arena, he called for deeper interaction between the two countries in the India-Middle East-Europe Economic Corridor [IMEC] and the I2U2 frameworks.</p><p>Prime Minister highlighted India’s growth story and sought greater bilateral collaboration in the fields of trade, investment, infrastructure development, green growth, start-ups, digital solutions and emerging technologies, unlocking the innovation and creativity of the youth. Expressing satisfaction at the conclusion of the Bilateral Investment Treaty, he called for early finalisation of an ambitious Free Trade Agreement to realise the untapped trade potential.</p><p>Prime Minister called for greater parliamentary interaction between the two vibrant democracies taking advantage of the recently formed Parliamentary Friendship Group for Israel in India. Drawing parallels between the ethos of the two civilizations, Prime Minister noted that India’s philosophy of Vasudhaiva Kutumbakam [the world is one family] and the Israeli principle of Tikkum Olam [healing the world] speak of shared approaches towards a harmonious society. Prime Minister thanked the members of the Knesset for their contribution to India-Israel ties and conveyed good wishes for the upcoming festival of Purim. The full address of Prime Minister may be seen here [link]</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232916&reg=3&lang=1"
  },
  {
    "headline": "“TDB supports Ayukriyam Innovations Pvt. Ltd. for Development of ‘Autoscope’ – An AI-Driven Whole Slide Imaging Diagnostic System”",
    "summaryText": "<p>In furtherance of the Government of India’s vision to promote deep-tech innovation and technological self-reliance in healthcare, the Technology Development Board (TDB), Department of Science & Technology (DST), has entered into an agreement with M/s Ayukriyam Innovations Pvt. Ltd. for the project titled “Autoscope: A Fully Automated Whole Slide Imaging and AI-Driven Diagnostic System.”</p><p>Ayukriyam Innovations Pvt. Ltd. is a deep-tech spin-off from the Molecular Imaging & Diagnostics Lab in the Department of Biochemical Engineering and Biotechnology at Indian Institute of Technology Delhi. The company is focused on advancing healthcare diagnostics through cutting-edge microscopy systems integrated with artificial intelligence to enable rapid, accurate, and deployable diagnosis of infectious diseases, particularly in resource-constrained settings.</p><p>The Autoscope platform is being developed as a fully automated whole slide imaging system combined with AI-driven diagnostic capabilities. The system aims to address critical gaps in pathology infrastructure by offering high-throughput, standardized, and scalable diagnostic workflows. By leveraging indigenous R&D and AI-enabled image analytics, the technology seeks to enhance diagnostic accuracy while reducing dependence on imported high-end imaging systems.</p><p>The sanctioned assistance from TDB will support the establishment of a dedicated manufacturing facility, production of multiple product batches, and comprehensive field performance evaluations. The project is expected to facilitate commercialization of an indigenously developed deep-tech platform, strengthen India’s diagnostic ecosystem, and contribute to affordable and accessible healthcare solutions.</p><p>Speaking on the occasion, Shri Rajesh Kumar Pathak, Secretary, TDB, stated, “Indigenous development of advanced diagnostic platforms integrating imaging and artificial intelligence is vital for strengthening India’s healthcare infrastructure. Through this support, TDB aims to accelerate the translation of laboratory innovation into market-ready solutions, reduce import dependence, and promote Aatmanirbhar Bharat in the medical technology sector.”</p><p>Promoters of Ayukriyam Innovations Pvt. Ltd. expressed gratitude to TDB for the support and noted that the assistance would significantly accelerate manufacturing readiness and field deployment of the Autoscope platform, enabling wider access to reliable and technology-driven diagnostics across the country.</p><p>The project reinforces TDB’s mandate to provide financial assistance for commercialization of indigenous technologies developed through in-house R&D and institutional linkages, and underscores the Government of India’s continued commitment to fostering innovation-led growth in critical sectors such as healthcare and medical devices.</p>",
    "category": "Health",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0015GAU.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232968&reg=3&lang=1"
  },
  {
    "headline": "“TDB-DST supports Indigenous CAR-NK Cell Therapy Platform for Oncology and Leishmaniasis”",
    "summaryText": "<p>The Technology Development Board (TDB), Department of Science & Technology, Government of India, has extended financial assistance to M/s East Ocyon Bio Private Limited, Gurgaon for its project titled “CAR-NK based Cell Therapy Development and Clinical Trials for Difficult-to-treat Tumors and Leishmaniasis.” The project seeks to establish a first-in-India, platform-based ecosystem for off-the-shelf CAR-NK cell therapies targeting resistant solid tumors and neglected infectious diseases, thereby strengthening India’s capabilities in advanced immunotherapy and biotherapeutics manufacturing.</p><p>CAR-NK (Chimeric Antigen Receptor–Natural Killer) cell therapies are emerging as a scalable and potentially safer alternative to conventional autologous CAR-T therapies. These platforms utilize healthy donor to isolate and expand NK cells which are then engineered to express CAR constructs against disease-specific targets. Unlike patient-specific CAR-T therapies, CAR-NK therapies offer immediate availability, simplified manufacturing logistics, lower risk of graft-versus-host disease (GvHD), and a favourable safety profile with reduced incidence of cytokine release syndrome (CRS) and neurotoxicity. NK cells also possess intrinsic anti-tumor and immunomodulatory properties, including the ability to target MHC-I deficient tumors.</p><p>Under the project, the company proposes to develop and commercialize:</p><p>The technology platform, developed entirely in-house, focused on allogeneic, off-the-shelf CAR-NK and CAR-γδ T cell therapies derived from healthy donors, engineered in bulk, cryopreserved under GMP-adaptable systems, and administered without patient matching—enabling scalability, cost-effectiveness, and rapid deployment. The lead innovation integrates a PD-L1-targeting CAR construct into NK cells using the gamma-retroviral platform, ensuring high expression efficiency and sustained functional persistence.</p><p>Speaking on the occasion, Sh. Rajesh Kumar Pathak, Secretary, TDB, stated that the Board’s support reflects its commitment to nurturing high-impact, frontier technologies that address unmet medical needs while building indigenous manufacturing capabilities. He emphasized that enabling advanced cell therapy platforms within the country will significantly reduce reliance on imported therapies and position India as a competitive player in next-generation immunotherapies.</p><p>Dr. Renu & Dr. Dinesh Kundu, Co-founders of East Ocyon Bio Private Limited expressed that the support from TDB will accelerate clinical translation of the company’s CAR-NK platform and help bridge the gap between laboratory innovation and patient access. They noted that the development of an indigenous, scalable, and affordable cell therapy platform has the potential to transform treatment paradigms for both oncology and infectious diseases in India and beyond.</p><p>The project is expected to contribute to strengthening India’s bio-innovation ecosystem, enhancing technology self-reliance, and advancing affordable access to cutting-edge therapies in alignment with the vision of Aatmanirbhar Bharat.</p>",
    "category": "Health",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001T12W.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232967&reg=3&lang=1"
  },
  {
    "headline": "“TDB-DST supports Carbon Craft Design Pvt. Ltd. for Commercialization of Eco-Friendly Ultra-Low Carbon Wall Claddings”",
    "summaryText": "<p>In line with the Government of India’s commitment to promoting sustainable industrial growth and circular economy practices, the Technology Development Board (TDB), Department of Science & Technology, has signed an agreement with Carbon Craft Design Pvt. Ltd. for financial assistance to support the commercialization of eco-friendly, ultra-low carbon footprint wall claddings.</p><p>The project, titled “Commercialization of the Eco-friendly Ultra Low Carbon Footprint Wall Claddings”, entails the establishment of a state-of-the-art manufacturing facility for geopolymer-based tiles developed using indigenous technology.</p><p>CarbonCraft is a design and material innovation startup focused on developing ultra-low carbon, circular economy-based building materials utilizing construction and demolition waste. The company’s proprietary technology enables the permanent sequestration of industrial byproducts into value-added products such as tiles, aggregates, and bricks. The proposed geopolymer wall claddings are sustainable, high-performance tiles manufactured using recycled quartz waste and multi-grade quartz sand through specialized processing and blending techniques, eliminating the need for energy-intensive kiln firing.</p><p>Speaking on the occasion, Shri Rajesh Kumar Pathak, Secretary, TDB, stated, “The transition to sustainable construction materials is critical for achieving India’s climate goals and net-zero ambitions. By supporting innovative startups like Carbon Craft, TDB is enabling the commercialization of indigenous technologies that reduce carbon footprint, promote waste valorisation, and strengthen India’s green manufacturing ecosystem.”</p><p>Founders of Carbon Craft Design Pvt. Ltd. expressed gratitude for TDB’s support and noted that the assistance would accelerate the scale-up of manufacturing capabilities and expand market access for sustainable building materials. The company reaffirmed its commitment to advancing low-carbon construction solutions aligned with the principles of circular economy and Aatmanirbhar Bharat.</p><p>The project is expected to contribute to import substitution in specialized architectural cladding materials, reduce industrial waste, and promote environmentally responsible construction practices across the country, reinforcing India’s vision of sustainable and self-reliant growth.</p>",
    "category": "Environment",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001QOV7.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232966&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister Pays Tribute to  Veer Savarkar Ji on his Punya Tithi",
    "summaryText": "<p>Prime Minister Narendra Modi today paid humble tributes to the great revolutionary Veer Savarkar Ji on his Punya tithi.</p><p>In a message honoring the freedom fighter, the Prime Minister stated that he dedicated his life to free the country from the chains of slavery. He further remarked that Veer Savarkar Ji’s personality and work will continue to inspire every generation for national service.</p><p>महान क्रांतिकारी वीर सावरकर जी को उनकी पुण्यतिथि पर सादर नमन। देश को गुलामी की जंजीरों से मुक्त कराने के लिए उन्होंने अपना जीवन समर्पित कर दिया। उनका व्यक्तित्व और कृतित्व हर पीढ़ी को राष्ट्रसेवा के लिए प्रेरित करता रहेगा।</p><p>महान क्रांतिकारी वीर सावरकर जी को उनकी पुण्यतिथि पर सादर नमन। देश को गुलामी की जंजीरों से मुक्त कराने के लिए उन्होंने अपना जीवन समर्पित कर दिया। उनका व्यक्तित्व और कृतित्व हर पीढ़ी को राष्ट्रसेवा के लिए प्रेरित करता रहेगा।</p>",
    "category": "General",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232960&reg=3&lang=1"
  },
  {
    "headline": "NMDC R&D Centre, IIT Hyderabad Sign MoU to Strengthen Academic and Research Collaboration",
    "summaryText": "<p>The R&D Centre of NMDC, Responsible Miner has signed a Memorandum of Understanding (MoU) with Indian Institute of Technology Hyderabad (IITH), a significant step towards shaping the future of India’s mineral and metals sector. The MoU was signed by Shri Sanjeev Sahi, ED (R&D), NMDC, and the Dean (Sponsored Research & Consultancy), IIT Hyderabad, in the presence of Prof. B. S. Murty, Director, IIT Hyderabad, aimed at advancing indigenous technology in mineral processing and allied areas.</p><p>This partnership represents a strong collaboration between field expertise and academic excellence. Together, NMDC and IIT Hyderabad will drive research in iron ore beneficiation and agglomeration, green steelmaking technologies, alternate ironmaking using indigenous raw materials, and advanced modeling and simulation of mining and metallurgical processes. The collaboration will also chart new pathways in the extraction of critical and rare earth minerals from primary and secondary sources, strengthening India’s mineral security and resource resilience.</p><p>Aligned with the rapid digital transformation of the mining sector, the MoU will drive research and pilot initiatives in autonomous vehicle movement, Artificial Intelligence, Internet of Things (IoT), Mining 4.0 frameworks, and drone-enabled surveying and monitoring. By integrating operational strength with research-driven innovation, the collaboration aims to deliver sustainable, technology-led solutions that enhance efficiency, productivity, and environmental stewardship across India’s evolving mineral landscape.</p><p>On the occasion of the MoU signing, Shri Amitava Mukherjee, Chairman-cum-Managing Director, NMDC, said, “The MoU with IIT Hyderabad strengthens NMDC’s commitment to innovation through industry–academia collaboration. By leveraging IIT Hyderabad’s research excellence and NMDC’s domain expertise, this partnership will advance indigenous technologies in mining, mineral processing, and emerging areas, contributing to sustainable development and the vision of Atmanirbhar Bharat.”</p><p>This partnership underscores NMDC’s commitment to innovation-driven growth and IIT Hyderabad’s role in translating research into impactful industrial applications. Together, the institutions will contribute to the national vision of Atmanirbhar Bharat. Significantly, this collaboration comes at a landmark moment as NMDC’s R&D Centre celebrates 50 years of dedicated contribution to India’s mineral growth story, reinforcing its legacy of research excellence and its enduring pursuit of technological advancement.</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001BBQM.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232945&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister Shares Sanskrit Subhshitam Highlighting the lessons from the life of Veer Savarakar ji",
    "summaryText": "<p>Prime Minister Narendra Modi, shared a Sanskirt Subhshitam highlighting the lessons from the life of Veer Savarkar ji.</p><p>The Prime Minister stated that from the life of Veer Savarkar Ji, a hardworking and dedicated son of  Maa Bharati , we learn the lesson of remaining firm in our resolve even in adverse circumstances. He noted that his courage, restraint, and sense of dedication toward the motherland will always continue to guide the path of the countrymen.</p><p>मां भारती के कर्मठ सपूत वीर सावरकर जी के जीवन से हमें विपरीत परिस्थितियों में भी अपने संकल्प पर अडिग रहने की सीख मिलती है। उनका साहस, संयम और मातृभूमि के प्रति समर्पण का भाव सदैव देशवासियों का पथ प्रदर्शित करता रहेगा।</p><p>धीराः शोकं तरिष्यन्ति लभन्ते सिद्धिमुत्तमाम्।</p><p>धीरैः सम्प्राप्यते लक्ष्मीर्धैर्यं सर्वत्र साधनम्॥</p><p>\"Brave and resolute persons are capable of overcoming grief and achieving success in their lives. Such persons become wealthy and prosperous. Therefore, patience and courage are always the best means of achieving success in one's life.\"</p><p>मां भारती के कर्मठ सपूत वीर सावरकर जी के जीवन से हमें विपरीत परिस्थितियों में भी अपने संकल्प पर अडिग रहने की सीख मिलती है। उनका साहस, संयम और मातृभूमि के प्रति समर्पण का भाव सदैव देशवासियों का पथ प्रदर्शित करता रहेगा। धीराः शोकं तरिष्यन्ति लभन्ते सिद्धिमुत्तमाम्।धीरैः… pic.twitter.com/zqe30DVSiR</p>",
    "category": "General",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232946&reg=3&lang=1"
  },
  {
    "headline": "Visit of the Prime Minister of Canada to India ",
    "summaryText": "<p>At the invitation of Prime Minister Shri Narendra Modi, the Prime Minister of Canada, The Right Honourable Mark Carney, will pay an official visit to India from 27 February to 2 March 2026. This will be Prime Minister Carney’s first official visit to India.</p><p>On 27 February, Prime Minister Carney will arrive in Mumbai. Over the next two days, he will participate in separate business engagements, interact with Indian and Canadian CEOs, industry and financial experts, innovators, educators as well as Canadian Pension Funds based in India.</p><p>Prime Minister Carney will arrive in New Delhi on 1st March. On 2nd March, the two Prime Ministers will hold delegation-level talks at Hyderabad House. Both leaders will review the progress achieved till date across diverse areas of the India – Canada Strategic Partnership, building on their earlier meetings in Kananaskis (June 2025) and Johannesburg (November 2025). They will also take stock of ongoing cooperation in key pillars including trade and investment; energy; critical minerals; agriculture; education, research, and innovation; and people-to-people ties. The two leaders will also exchange views on regional and global developments.</p><p>Prime Minister Modi and Prime Minister Carney will also attend the India–Canada CEOs Forum scheduled later in the day.</p><p>The visit comes at an important juncture in normalization of India-Canada bilateral relations. The two Prime Ministers have earlier agreed to pursue a constructive and balanced partnership grounded in mutual respect for each other’s concerns and sensitivities, strong people-to-people ties, and growing economic complementarities. The forthcoming meeting between the leaders will provide an opportunity to reaffirm the positive momentum and shared vision of India and Canada in building a forward-looking partnership.</p>",
    "category": "Economy",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232941&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister visits Tech Exhibition in Jerusalem",
    "summaryText": "<p>Prime Minister Shri Narendra Modi, accompanied by the Prime Minister of Israel, H.E. Benjamin Netanyahu, visited an exhibition showcasing pioneering Israeli innovations across several sectors on February 25, 2026. The exhibition featured leading companies and research entities specializing in Agri-tech, Water-tech, Climate-tech, Health-biotech, Smart Mobility, AI, Cybersecurity, and Quantum technologies.</p><p>Innovation and Tech partnership is a key pillar of India-Israel bilateral ties. The two countries are working together to build solutions to address modern-day challenges through the \"India-Israel Innovation Bridge\" initiative. During the walk-through, Prime Minister interacted with scientists, tech-entrepreneurs and CEOs of the following companies/entities:</p><p>* Quantum & Deep Tech: Prime Minister was briefed by Quantum Machines on the Israeli Quantum Computing Centre (IQCC) and by Classiq, which is simplifying quantum software development.</p><p>* Health-Tech & AI: AISAP, a start-up, demonstrated its AI-powered point-of-care ultrasound, which provides real-time diagnostic guidance. The Horizon Scanning Division of the Israeli Ministry of Science and Technology presented \"Tech Scout,\" an AI-driven tool for strategic risk detection and trend analysis.</p><p>* Smart Mobility: Mobileye, a tech-enterprise, showcased its sensor and chip technology aimed at reducing road accidents.</p><p>* Cybersecurity: Check Point Software Technologies highlighted its advanced threat prevention solutions and its collaborations in India.</p><p>* Water & Agriculture: The solutions displayed focussed on innovations in sustainability. WaterGen demonstrated its technology to produce drinking water from air, while N-Drip showcased gravity-powered micro-irrigation systems. Natural Offset Farming (NOF) presented in-field post-harvest solutions to reduce food loss without electricity.</p><p>* Climate & Bio-Tech: Remilk showcased precision fermentation for lab-produced milk proteins, and BarAlgae presented machine-learning-integrated microalgae cultivation. Mynora Bio displayed plastic waste management using specialized bio-conversion additives.</p><p>* Energy & Natural Resources: The Geophysical Institute (GII) demonstrated high-resolution modelling for quantifying mineral resources.</p><p>* Space: Israel Aerospace Industries presented its miniaturised communications satellites and integrated Synthetic Aperture Radar [SAR]</p><p>During his interaction with the innovators, Prime Minister noted that the cutting-edge technologies on display hold immense potential to scale up India-Israel innovation, start-ups and business partnerships, especially in areas such as agriculture, water management, healthcare and digital services. He invited the companies to explore opportunities in India to invest, manufacture and build technology partnerships.</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232940&reg=3&lang=1"
  },
  {
    "headline": "Union Minister of Commerce and Industry Piyush Goyal Highlights Youth Power, AI and Global Trade While Giving Away the EY Entrepreneur Of The Year Awards in Mumbai",
    "summaryText": "<p>Union Minister of Commerce and Industry Shri Piyush Goyal delivered the keynote address at the 27th edition of the EY Entrepreneur Of The Year Awards, in Mumbai today evening. The Union Minister gave away the awards in the program that brought together leading entrepreneurs, industry captains and startup founders from across the country.</p><p>Addressing the gathering, Shri Goyal underscored that India’s youth and human capital are at the heart of the nation’s growth story. Reflecting on interactions with founders and business leaders, the Union Commerce and Industry Minister said that passion, innovation and skilled manpower are India’s biggest competitive advantages. Referring to the recently concluded AI Summit in New Delhi, the Union Minister stated,  the global response demonstrated the depth and maturity of India’s innovation ecosystem and technological capabilities.</p><p>On concerns around Artificial Intelligence and employment, Shri Goyal said, AI would transform jobs rather than eliminate them. He noted that India produces around 2.3 million STEM graduates every year and possesses an unmatched pool of young, adaptable and ambitious talent. Drawing parallels with the Y2K era, he described AI as the next inflection point that will create better opportunities, higher-value work, stronger exports and deeper global integration for Indian businesses, while also increasing demand for skilled professionals in areas such as cybersecurity, data protection and system governance.</p><p>The Union Commerce and Industry Minister also highlighted India’s expanding global trade footprint, stating that the country has concluded nine Free Trade Agreements covering 38 nations, giving Indian businesses preferential access to nearly two-thirds of global trade. These agreements, will help Indian goods, services, agricultural and fisheries products, and labour-intensive sectors reach new markets, integrate into global value chains and enhance talent mobility, he further stated.</p><p>Emphasising that self-reliance does not mean isolation, Shri Goyal said, Aatmanirbhar Bharat is about building resilient, trusted and diversified supply chains through global engagement. Calling upon entrepreneurs and industry leaders to take global opportunities to MSMEs, farmers, exporters and fishermen across the country, Union Minister Shri Goyal expressed confidence that young India will lead the nation through Amrit Kaal towards becoming a developed economy by 2047.</p><p>Congratulating the award winners, Shri Goyal said India’s growth journey will continue relentlessly, powered by its entrepreneurs and youth, and urged all stakeholders to work collectively to realise the vision of Viksit Bharat.</p><p>PIB Mumbai | Sriyanka Chatterjee/Darshana Rane</p><p>Follow us on social media:@PIBMumbai    /PIBMumbai    /pibmumbai  pibmumbai[at]gmail[dot]com  /PIBMumbai    /pibmumbai</p>",
    "category": "Economy",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/WhatsAppImage2026-02-25at10.31.48PM1KLH.jpeg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/WhatsAppImage2026-02-25at10.29.58PMI7P2.jpeg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/WhatsAppImage2026-02-25at10.29.17PM80KC.jpeg",
      "http://static.pib.gov.in/WriteReadData/userfiles/image/Twitter-iconI0HR.jpg",
      "http://static.pib.gov.in/WriteReadData/userfiles/image/fbO3SQ.jpg",
      "http://static.pib.gov.in/WriteReadData/userfiles/image/Instagram-IconX9CA.png",
      "http://static.pib.gov.in/WriteReadData/userfiles/image/emailXG3L.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/ytYKP4.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/sharechatHL5W.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232915&reg=3&lang=1"
  }
]