[
  {
    "headline": "CSIR-National Physical Laboratory Celebrates National Science Day",
    "summaryText": "<p>Ministry of Science & Technology</p><p>CSIR-National Physical Laboratory Celebrates National Science Day</p><p>To commemorate the historic announcement of the discovery of the Raman Effect by C. V. Raman on 28 February 1928, CSIR–National Physical Laboratory (CSIR-NPL) celebrated National Science Day (NSD-2026) on 28 February 2026. “National Science Conclave” in the morning, while the “National Science Day Lecture” in the afternoon were celebrated as part of NSD 2026.</p><p>The programme commenced with the National Science Conclave, providing a vibrant platform to research scholars, students, and young scientists below 40 years of age to showcase their research through poster presentations under three broad thematic domains: Materials Science and Technology (MST), Physics, Engineering and Metrology (PEM), and Environment, Health and Chemistry (EHC). The best selected posters were awarded certificates of merit. This session aimed to nurture young scientific talent and promote interdisciplinary research.</p><p>The “National Science Day Lecture” began with opening remarks from Prof Venu Gopal Achanta, Director, CSIR-NPL, and a warm welcome to the distinguished dignitaries. Prof Achanta eloquently highlighted the historic association between CSIR-NPL and the Raman Effect through K. S. Krishnan, who found conclusive evidence for the Raman Effect. He is also the Founding Director of CSIR-NPL. Prof. Achanta stressed on the need to find local solutions to local as well as global problems. He also emphasized the importance of embracing emerging challenges in quantum metrology and advancing metrological interventions in frontier areas of science and technology for societal applications.</p><p>National Science Day Lecture was delivered by the Chief Guest Prof. Bhim Singh, Vigyan Shri, ANRF National Science Chair Professor and Emeritus/Honorary Professor, IIT Delhi, who spoke on the theme “Electric Vehicle- a sustainable Energy Revolution”. Prof Singh emphasised the evolution, technologies, charging systems, and mission-driven roadmap of Electric Vehicles as a sustainable energy revolution. The Guest of Honor lecture was delivered by Prof. Prateek Sharma, Vice Chancellor, Delhi Technological University, who shared his perspectives on creating a repository of societal problems and on finding solutions to them in collaboration with academia and research labs, inspiring the audience with his vision for academia–research synergy and innovation-driven growth.</p><p>The programme concluded with a formal vote of thanks by Dr. Govind Gupta, Convener, NSD-2026. He highlighted the activities carried out by CSIR-NPL, including the organization of the First National Science Conclave, as well as the role of women in Science at Catalysis Viksit Bharat CSIR-NPL.</p>",
    "category": "Health",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002Z8Q6.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003IUC2.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004NALQ.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005ZAGF.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234120&reg=3&lang=1"
  },
  {
    "headline": "Strengthening Allied Sector and Market Access",
    "summaryText": "<p>Strengthening Allied Sector and Market Access Transforming India’s Livestock and Fisheries Sector</p><p>India’s agricultural progress is increasingly supported by the expansion of allied sectors such as livestock, dairy, poultry, and fisheries. These sectors have become major contributors to agricultural Gross Value Added (GVA) and rural employment. Over the last decade, agriculture and allied sectors have witnessed a steady 3-5% CAGR, fuelled by extensive government efforts, private innovations, and sizeable domestic demand. It is estimated that by 2047, the sector could potentially triple in size, powering India’s growth.</p><p>Although rural livelihoods remain largely agriculture-based, changes in land use, climate variability, and income uncertainty have encouraged households to adopt additional income sources. For small and marginal farmers, diversification has become an important way to manage seasonal income fluctuations and ensure more stable earnings.</p><p>Diversification includes income from farm, allied, and non-farm activities to reduce risk and smooth household consumption. Rather than moving away from agriculture, it reflects a more integrated and resilient rural economy where farming remains central but is supported by multiple livelihood options. Stronger institutions such as cooperatives, Farmer Producer Organisations (FPOs), and Self-Help Groups (SHGs) have improved access to credit, technology, and organised markets, helping small producers connect better with value chains.</p><p>Livestock and Fisheries: Drivers of Rural Income Diversification and Growth</p><p>Within allied agricultural activities, livestock and fisheries have demonstrated relatively stable growth rates of approximately 5-6 percent, underscoring their strategic importance in generating rural incomes. Their economic significance lies in generating regular and comparatively predictable cash flows. Dairy production facilitates frequent income realisation through routine milk sales, while fisheries enable multiple production cycles, thereby providing sustained employment opportunities. Furthermore, dairy-based rural households commonly integrate crop cultivation for food and fodder with livestock rearing, enabling circular resource use and reducing dependence on external inputs. Such diversification reduces reliance on a single income source and enhances resilience to seasonal and market shocks.</p><p>Between FY15 and FY24, the sector’s Gross Value Added (GVA) increased by nearly 195 percent, reflecting a compound annual growth rate (CAGR) of 12.77 percent at current prices. In the Union Budget 2026–27, ₹6,153.46 crore has been allocated to the Department of Animal Husbandry & Dairying, reflecting a 16 percent increase from ₹5,302.83 crore in FY 2025–26. This expansion underscores the sector’s role in income diversification and livelihood resilience, supported by investments in breed improvement, veterinary infrastructure, and disease control.</p><p>India as a Global Leader in Livestock and Fisheries</p><p>India holds the leading global position in milk production, accounting for nearly 25 percent of global output. Over the decade, the sector has recorded a compound annual growth rate of 5.41 percent, with production increasing from 146.31 million tonnes in 2014–15 to 247.87 million tonnes in 2024–25, representing a growth of over 69.4 percent. This sustained expansion has contributed to improved nutritional access, reflected in per capita milk availability of 485 grams per day in 2024–25, significantly exceeding the global average of 328 grams.</p><p>India ranks second globally in egg production. National output has increased from 78.48 billion eggs in 2014–15 to an estimated 149.11 billion eggs in 2024–25, reflecting a compound annual growth rate (CAGR) of 6.63 percent more than a decade. This sustained expansion has translated into improved access to nutrition, with per capita egg availability rising from 62 eggs per annum in 2014–15 to 106 eggs per annum in 2024–25.</p><p>India is the world’s second-largest fish producer. Output has increased to 19.77 million tonnes in FY 2024-25 from 9.58 million tonnes in FY 2013-14. It contributes nearly 8 percent of global output and supports over 30 million livelihoods, thereby constituting a central pillar of the blue economy. Coastal States and Union Territories, comprising approximately 4,434 fishing villages, account for 72 percent of production and 76 percent of seafood exports. The sector contributes 7.43 percent to agricultural GVA, with policy measures such as reducing GST on key fish products and enhancing domestic demand and export competitiveness.</p><p>India ranks fourth globally in meat production. Output has increased from 6.69 million tonnes in 2014–15 to 10.50 million tonnes in 2024–25, reflecting a compound annual growth rate (CAGR) of 4.61 percent. Taken together, these indicators affirm India’s prominent position as a major contributor within the domestic and global agri-food economy.</p><p>Policy-led Intervention for Livestock Productivity</p><p>The expansion of India’s livestock sector has been driven by focused government interventions through initiatives such as the National Livestock Mission (NLM), the Rashtriya Gokul Mission (RGM), and the National Animal Disease Control Programme (NADCP), which emphasise productivity improvement, animal health, breed development, and livestock-based entrepreneurships. Together, these initiatives have strengthened livestock systems, reduced production risks, and reinforced livestock as a resilient and diversified source of income for rural households.</p><p>The National Livestock Mission promotes livestock-based entrepreneurship, improves breed productivity, and boosts production of meat, eggs, milk, and fodder.</p><p>The Rashtriya Gokul Mission focuses on conserving indigenous bovine breeds, enhancing milk productivity, and making dairying more remunerative for rural farmers.</p><p>The National Animal Disease Control Programme (NADCP) focuses on controlling Foot and Mouth Disease (FMD) and Brucellosis through 100% vaccination of cattle, buffalo, sheep, goats, and pigs against FMD, and vaccination of all female bovine calves (4–8 months) against Brucellosis.</p><p>Genetic Improvement through Artificial Insemination with Last Mile Service Delivery</p><p>Genetic improvement interventions under the RGM have reinforced productivity-led growth within the livestock sector mentioned as follows:</p><p>A total of 14.56 crore artificial inseminations have been conducted, covering 9.36 crore animals and benefiting 5.62 crore farmers.</p><p>The training of nearly 39,810 MAITRI artificial insemination technicians has strengthened last-mile service delivery.</p><p>These measures have accelerated genetic gains, improved milk yields, and strengthened the income potential of dairy-based livelihoods.</p><p>Strengthening Animal Health and Risk Mitigation</p><p>Livestock productivity and income stability are closely linked to disease control. Under the NADCP, large-scale vaccination and surveillance efforts have significantly reduced disease incidence. Over 125.75 crore Foot and Mouth Disease (FMD) vaccinations were administered, and approximately 26.27 crore farmers benefited. Vaccination coverage expanded in 2025 to include pastoral sheep and goats.</p><p>FMD outbreaks reduced sharply from 132 cases in 2019 to 6 cases in 2025</p><p>Brucellosis outbreaks have been reduced to zero</p><p>The decline in disease outbreaks has mitigated productivity losses.</p><p>Livestock Productivity Enhancement Supporting Livelihood Diversification</p><p>The combined impact of genetic and health interventions is reflected in sustained improvements in bovine productivity. India is home to the world's largest bovine population and has witnessed significant growth in meat and poultry production.</p><p>Indigenous (local) and non-descript (mix-breed) cattle productivity increased from 927 kg per animal per year (2014–15) to 1,292 kg (2023–24), a rise of 39.37 percent.</p><p>Buffalo productivity increased from 1,880 kg to 2,161 kg, registering 14.94 percent growth during the same period.</p><p>Average bovine productivity improved from 1,648.17 kg (2013–14) to 2,079 kg (2024–25), reflecting a 27 percent rise.</p><p>These productivity gains represent one of the highest recorded improvements globally and directly enhance income realisation from dairy-based livelihoods.</p><p>Scaling Milk Procurement and Processing Capacity</p><p>The expansion of dairy cooperatives has played a pivotal role in strengthening market integration by incorporating smallholders into organised procurement and processing systems.</p><p>The dairy network encompasses:</p><p>22 milk federations, 241 district unions, 28 marketing dairies,</p><p>25 Milk Producer Organisations (MPOs), covering approximately 2.35 lakh villages and 1.72 crore farmer-members.</p><p>31,908 dairy cooperative societies have been organised, integrating 17.63 lakh producers into formal value chains and increasing daily milk procurement by 120.68 lakh kilograms.</p><p>India is strengthening value addition through the planned expansion of milk processing capacity to 100 million litres per day by 2028–29, from the current 660 lakh litres per day, strengthening the sector’s contribution to food security and farm incomes.</p><p>Institutional Credit Support for Livestock</p><p>Access to affordable institutional credit has been instrumental in enabling livelihood diversification within the livestock and fisheries sectors, facilitating producers’ transition from subsistence-based operations to formal market integration. Under the Kisan Credit Card (KCC) scheme, substantial credit support has been extended to allied activities to meet working capital requirements, promote asset formation, and reduce reliance on informal lending channels. The facts and figures indicate a strong institutional response to credit demand in allied agricultural activities.</p><p>In animal husbandry, the exceptionally high acceptance rate, 55.08 lakh out of 55.9 lakh applications, reflects effective screening mechanisms and sustained policy support. The sanctioning of 39.22 lakh applications further suggests substantial credit flow, translating into actual financial support.</p><p>Policy-led Intervention for India’s Fisheries Sector</p><p>Over the decade, India’s fisheries sector has recorded a sustained average annual growth rate of 8.74 percent, with total fish production increasing from 95.79 lakh tonnes in 2013–14 to 197.75 lakh tonnes in 2024–25. Inland fisheries and aquaculture have been the primary drivers of this expansion, registering a 147 percent increase from 61.36 lakh tonnes to 151.60 lakh tonnes during the same period.</p><p>The Union Budget 2026-27 allocated a record ₹2,761.80 crore (approximately USD 332.75 million) to fisheries, reinforcing sustained investment initiated under the Blue Revolution and consolidating India’s leadership in aquaculture and seafood exports. This trajectory underscores fisheries as a key growth engine within non-farm livelihood diversification, particularly in rural and coastal regions.</p><p>Deep-sea and offshore fisheries further integrate India into global seafood value chains, strengthening the sector’s economic and food security importance. This integration has been reinforced through focused interventions under the Pradhan Mantri Matsya Sampada Yojana (PMMSY) and Pradhan Mantri Matsya Kisan Samridhi Sah-Yojana (PM-MKSSY), under which seafood exports have more than doubled from ₹30,213 crore in 2013–14 to ₹62,408 crore in 2024–25, reaching over 130 countries.</p><p>Pradhan Mantri Matsya Sampada Yojana (PMMSY) promotes fisheries development through infrastructure, modernization, and value chain strengthening to boost production, exports, jobs, and fishers’ incomes.</p><p>Pradhan Mantri Matsya Kisan Samridhi Sah-Yojana (PM-MKSSY), a sub-scheme of PMMSY, supports sector formalisation through insurance, credit, performance incentives, and traceability to improve income security and sustainability for fish farmers.</p><p>Strengthening Fisheries Infrastructure and Market Access</p><p>Under PMSSY, Productivity gains have been accompanied by large-scale infrastructure development to reduce post-harvest losses and improve market access.</p><p>27,189 fish transportation and handling units established</p><p>6,733 fish retail markets and kiosks sanctioned</p><p>128 value-added enterprise units supported</p><p>To bridge infrastructure gaps, the Fisheries and Aquaculture Infrastructure Development Fund (FIDF), launched in 2018–19 with a corpus of ₹7,522.48 crore, supports fishing harbours, landing centres, aquaculture units, and cold-chain logistics.</p><p>Institutional Credit Support for fisheries</p><p>In fisheries, 6.83 lakh applications were received under the Kisan Credit Card (KCC), of which 6.77 lakh were accepted. Of which, 4.82 lakh applications were sanctioned, indicating a meaningful conversion of demand into credit access. Financial inclusion and welfare programmes have extended KCC benefits to 4.39 lakh fishers, providing insurance coverage to 3.3 million beneficiaries, and delivering livelihood assistance to an average of 7.44 lakh fisher families during lean periods. These measures underscore the role of formal credit in enhancing resilience, stabilising incomes, and deepening integration with organised markets.</p><p>Sustainable Governance of Marine Fisheries and EEZ Resources</p><p>India’s extensive coastline of over 11,099 km and an Exclusive Economic Zone (EEZ) of approximately 24 lakh square kilometres sustain the livelihoods of more than 50 lakh members of the fishing community across 13 maritime States and Union Territories. Marine fisheries constitute a strategic component of the blue economy, contributing to export earnings and national nutritional security.</p><p>To ensure responsible harnessing of aquatic resources, the Government has notified the Rules and Guidelines for Sustainable Harnessing of Fisheries in the EEZ and High Seas (2025), establishing a forward-looking regulatory framework aligned with sustainability and international compliance standards. Policy measures granting duty-free status to catch landed abroad and treated as exports aim to enhance price realisation and global competitiveness, while traceability, sustainability, and compliance safeguards mitigate misuse. The Marine Products Export Development Authority (MPEDA) further anchors sustainable export growth through quality assurance, market facilitation, capacity building, and ecological stewardship, reinforcing long-term resource security and livelihood resilience.</p><p>Mission-Driven Reservoir Development and Fisheries Value Chain Expansion</p><p>India possesses one of the world’s largest inland reservoir networks, spanning approximately 31.5 lakh hectares, which presents significant potential for expanding inland fisheries. Under Mission Amrit Sarovar, the Government of India has facilitated the development of 68,827 Amrit Sarovars, including 1,222 water bodies integrated with fisheries activities, thereby promoting fish culture, livelihood diversification, and the enhancement of aquatic ecosystems. The targeted interventions are proposed to integrate the development of 500 reservoirs and Amrit Sarovars to further consolidate the fisheries value chain, particularly across coastal and inland regions. These measures seek to strengthen market linkages and value addition by involving startups, women-led collectives, and Fish Farmer Producer Organizations (FFPOs), fostering inclusive growth, entrepreneurship, and sustainable fisheries-based livelihoods.</p><p>Data-driven Institutional Reform in Livestock and Fisheries Sectors</p><p>Digitalisation has become a critical instrument for enhancing efficiency, transparency, and producer welfare in the dairy sector. The introduction of the 12-digit unique livestock identification system, Pashu Aadhaar, has established a foundational digital architecture for recording animal health, breeding, and service delivery transactions, thereby enabling data-driven planning and real-time access for farmers and veterinarians.</p><p>By January 2026, more than 36.45 crore livestock had been registered on the Bharat Pashudhan Portal. Complementing this, the Automatic Milk Collection System (AMCS) has improved transparency in procurement through automated quality testing and pricing, ensuring timely payments.</p><p>The Internet-based Dairy Information System (i-DIS) further integrates data across unions and federations, enabling performance monitoring.</p><p>Operational in 12 States and Union Territories,</p><p>AMCS covers over 26,000 cooperative societies and benefits 17.3 lakh producers.</p><p>Parallel digital reforms in fisheries include the National Fisheries Digital Platform (NFDP), launched in 2024, under the Pradhan Mantri Matsya Kisan Samridhi Sah-Yojana. NFDP creates digital identities and a unified national database for fishers and enterprises, facilitating access to credit, insurance, traceability, and performance incentives. With over 28 lakh stakeholders registered, integration of 12 banks on a common digital platform, and 217 loans disbursed, the platform advances formalisation, financial inclusion, and transparency in the fisheries value chain. Together, these digital platforms are reinforcing market integration, reducing transaction costs, and improving income certainty.</p><p>Sustainable Marine and Dairy Economies: Advancing Inclusive Growth and the SDGs</p><p>India’s marine and dairy economies constitute foundational pillars of sustainable livelihoods, nutritional security, and inclusive growth aligned with the Sustainable Development Goals (SDGs). Sustainable management of marine resources, aligned with SDG 14, is particularly critical given India’s EEZ exceeding 2 million square kilometres, necessitating effective governance of deep-sea and offshore fisheries to prevent overexploitation, conserve biodiversity, and safeguard food and livelihood security.</p><p>Complementing this, the dairy sector advances multiple social SDGs by sustaining the livelihoods of nearly 150 million farmers, particularly smallholders, thereby contributing to poverty reduction (SDG 1), productive employment (SDG 8), and reduced inequalities (SDG 10). Collectively, sustainable fisheries and inclusive dairy development reinforce integrated and equitable progress across key Sustainable Development Goals.</p><p>India’s strategic focus on livelihood diversification through the dairy and fisheries sectors has successfully transitioned rural households from subsistence-oriented production to market-integrated, commercially viable models. Beyond enhancing farm incomes, diversification contributes to employment generation, risk mitigation, and the strengthening of food system resilience. India has emerged as the world leader in milk production and ranks second in fish and egg production, achieving significant productivity gains without necessarily increasing herd sizes. The expansion of cooperatives, Farmer-Producer Organizations (FPOs), and Self-Help Groups (SHGs) has deepened market integration, providing small producers with better bargaining power and structured value chains.</p><p>The deployment of digital public infrastructure, such as Pashu Aadhaar and the National Fisheries Digital Platform, alongside the expansion of Kisan Credit Cards (KCC), has enhanced transparency, reduced transaction costs, and provided essential liquidity to rural producers. These sectors are vital for the economic empowerment of women and smallholders, supporting livelihoods on a large scale, and aligning with global Sustainable Development Goals (SDGs) for poverty reduction and environmental stewardship. Together, the convergence of productivity-led growth, institutional support, and technological innovation has created a resilient rural economy capable of withstanding seasonal and market shocks while ensuring national nutritional security.</p><p>Ministry of Fisheries, Animal Husbandry & Dairying</p><p>https://nlm.udyamimitra.in/</p><p>https://dahd.gov.in/schemes/programmes/rashtriya_gokul_mission</p><p>https://bharatpashudhan.ndlm.co.in/</p><p>https://www.pmmsy.dof.gov.in/</p><p>https://pmmkssy.dof.gov.in/pmmkssy/#/</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2221582&reg=3&lang=1</p><p>https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2213532&reg=3&lang=1</p><p>https://www.pib.gov.in/PressReleseDetailm.aspx?PRID=2212290&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2101856&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2184705&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2205031&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleseDetailm.aspx?PRID=2225246&reg=3&lang=2</p><p>https://mofpi.gov.in/sites/default/files/KnowledgeCentre/Sector%20Profile/Sector_Profile_Fisheries.pdf</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2221788&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2225763&reg=3&lang=1</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2225760&reg=3&lang=1</p><p>https://www.pib.gov.in/PressNoteDetails.aspx?NoteId=156127&ModuleId=3&reg=3&lang=1</p><p>https://www.indiabudget.gov.in/doc/budget_speech.pdf</p><p>https://www.indiabudget.gov.in/economicsurvey/doc/echapter.pdf</p><p>Ministry of Rural Development</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2122478&reg=3&lang=2</p><p>Ministry of Food Processing Industries (MoFPI)</p><p>https://mofpi.gov.in/sites/default/files/KnowledgeCentre/Sector%20Profile/Sector_profile_Meat_Poultry_(1)22.pdf</p><p>Lok Sabha and Rajya Sabha Questions</p><p>https://sansad.in/getFile/loksabhaquestions/annex/185/AU4180_nfJzOf.pdf?source=pqals</p><p>https://sansad.in/getFile/loksabhaquestions/annex/185/AU2500_MY7k37.pdf?source=pqals</p><p>https://sansad.in/getFile/loksabhaquestions/annex/184/AU4923_3Zmrxj.pdf?source=pqals</p><p>https://sansad.in/getFile/annex/268/AU384_3ncA5j.pdf?source=pqars https://sansad.in/getFile/loksabhaquestions/annex/185/AS371_0BKEvo.pdf?source=pqals</p><p>https://sansad.in/getFile/loksabhaquestions/annex/186/AU2737_Zmswwv.pdf?source=pqals</p><p>https://sansad.in/getFile/annex/268/AU1181_cZK9ZJ.pdf?source=pqars</p><p>https://sansad.in/getFile/loksabhaquestions/annex/185/AU3729_txHX3D.pdf?source=pqals</p><p>Food and Agriculture Organisation (FAO)</p><p>https://openknowledge.fao.org/server/api/core/bitstreams/beee9189-d92d-4a0d-86af-a1e3328c33d1/content</p><p>https://www.fao.org/newsroom/detail/meat-eggs-and-milk-essential-source-of-nutrients-new-fao-report-says-250423/en</p><p>https://www.fao.org/fsnforum/consultation/eggs-nutrition?page=1</p><p>https://niti.gov.in/sites/default/files/2025-10/Indias-Blue-Economy-Strategy-For-Harnessing-Deep-Sea-And-Offshore-Fisheries.pdf</p><p>https://niti.gov.in/sites/default/files/2025-10/Reimagining_Agriculture_Roadmap_for_Frontier_Technology_Led_Transformation.pdf</p><p>https://www.pib.gov.in/PressNoteDetails.aspx?NoteId=156873&ModuleId=3&reg=3&lang=1</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2194086&reg=3&lang=2</p><p>https://www.pib.gov.in/PressNoteDetails.aspx?NoteId=155298&ModuleId=3&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2192114&reg=3&lang=2</p>",
    "category": "Agriculture",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Screenshot2026-03-011038463PP3.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003YRK1.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004SPSF.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005G16N.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image006M2UP.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0071LQA.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image008DK2X.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image009QVQ0.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234117&reg=3&lang=1"
  },
  {
    "headline": "Central Board of Indirect Taxes and Customs (CBIC) introduces deferred Customs Duty payment facility for Eligible Manufacturer Importers as announced in Union Budget 2026-27",
    "summaryText": "<p>Central Board of Indirect Taxes and Customs (CBIC) introduces deferred Customs Duty payment facility for Eligible Manufacturer Importers as announced in Union Budget 2026-27 CBIC also notifies eligibility and guidelines for Eligible Manufacturer Importer SchemeEMI Scheme is a Trust-Based Customs Facilitation Scheme to improve cash flow, promote compliance and boost domestic manufacturing, and facilitate Ease of Doing BusinessEMI facility will be available from 1st April, 2026 and will remain in force till 31st March, 2028Applications under the EMI scheme can be submitted online from 1st March, 2026 on the AEO portal at www.aeoindia.gov.in under the tab “Eligible Manufacturer Importer”</p><p>In pursuance of the Union Budget 2026–27 announcement by the Union Minister for Finance and Corporate Affairs, the Central Board of Indirect Taxes and Customs (CBIC) has introduced a new facilitation measure for trusted manufacturers by enabling the facility of deferred payment of Customs duty to a new category of importers called Eligible Manufacturer Importers (EMIs). CBIC has issued detailed eligibility conditions, application process and operational guidelines through Circular No. 08/2026-Customs dated 28th February, 2026, in this regard.</p><p>Under this initiative, Eligible Manufacturer Importers (EMI) will be able to clear imported goods without paying Customs duty at the time of clearance. Instead, the applicable duty can be paid on a monthly basis as prescribed under the Deferred Payment of Import Duty Rules, 2016, helping manufacturers better manage cash flows and working capital.</p><p>The facility will be available from 1st April, 2026 and will remain in force till 31st March, 2028. The deferred payment facility shall be available to EMI meeting prescribed criteria related to Customs and GST compliance, turnover, financial standing and past track record. Existing AEO-T1 entities, including MSMEs, that fulfil the eligibility conditions are also eligible to participate.</p><p>The EMI scheme is designed as a trust-based facilitation measure, encouraging compliant manufacturers to benefit from simplified procedures while nudging them towards higher levels of compliance. During the validity period of the scheme, approved Eligible Manufacturer Importers are expected to progressively obtain AEO-T2 or AEO-T3 status, enabling access to enhanced facilitation, faster clearances and priority treatment under the AEO Programme.</p><p>Applications under the EMI scheme can be submitted online from 1st March, 2026 on the AEO portal at www.aeoindia.gov.in under the tab “Eligible Manufacturer Importer”.</p><p>This reform is expected to significantly improve ease of doing business, strengthen the compliance culture, promote wider participation in the AEO programme and provide a boost to domestic manufacturing. It reflects CBIC’s continued commitment to creating a predictable, efficient and facilitative Customs environment to support India’s manufacturing-led and export-oriented growth.</p><p>CLICK HERE TO ACCESS CIRCULAR NO. 08/2026-CUSTOMS</p>",
    "category": "Economy",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234116&reg=3&lang=1"
  },
  {
    "headline": "INS TARANGINI ARRIVES AT TRINCOMALEE, SRI LANKA",
    "summaryText": "<p>INS TARANGINI ARRIVES AT TRINCOMALEE, SRI LANKA</p><p>Indian Navy’s Sail Training Ship INS Tarangini arrived at Trincomalee Harbour, Sri Lanka on a training visit on 27 Feb 2026. The ship was accorded a warm welcome by representatives of the Eastern Naval Area of the Sri Lanka Navy. The visit follows the ship’s recent participation in the International Fleet Review 2026 conducted at Visakhapatnam.</p><p>During the port call, Commanding Officer of Tarangini called on Cmde Haritha Jayadewathe, Deputy Commander of the Eastern Naval Area and held discussions on avenues of cooperation in sail training. The ship hosted Sri Lankan defence personnel, families, and trainee officers for a familiarisation tour onboard. Community engagement activities and training exchanges are planned during the ship's port call.</p><p>Selected trainee officers from the Sri Lankan Naval and Maritime Academy will embark on Tarangini for a passage to Colombo. During the passage, the trainees will be exposed to various facets of sail training.</p><p>The visit of INS Tarangini underscores longstanding maritime ties and growing cooperation between the Indian Navy and the Sri Lanka Navy.</p><p>_____________________________________________________________</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Pic(2)(2)79N9.jpeg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Pic(3)(4)FND5.jpeg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Pic(4)(1)LS7E.jpeg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234119&reg=3&lang=1"
  },
  {
    "headline": "National Arogya Fair 2026 concludes in Shegaon, reinforcing Ayush as pillar of holistic healthcare and rural empowerment",
    "summaryText": "<p>National Arogya Fair 2026 concludes in Shegaon, reinforcing Ayush as pillar of holistic healthcare and rural empowerment Four-Day National Arogya Fair sees massive public participation, boosts preventive healthcare and medicinal farming in VidarbhaThe Fair integrates healthcare, research and rural prosperityUnion Minister Shri Prataprao Jadhav leads outreach as National Arogya Fair 2026 draws strong responseFree OPDs, yoga competitions and farmer workshops mark successful conclusion</p><p>The four-day National Arogya Fair 2026, organised by the Ministry of Ayush in collaboration with the All India Ayurvedic Congress at Shegaon, Buldhana district of Maharashtra from 25–28 February 2026, concluded successfully yesterday, reaffirming India’s commitment to holistic healthcare and rural empowerment through its traditional systems of medicine.</p><p>The Fair, inaugurated by the President of India, Smt. Droupadi Murmu, at the sacred Visava Maidan of Sant Gajanan Maharaj Sansthan, emerged as a vibrant confluence of healthcare outreach, scientific dialogue, farmer engagement and public participation. Over four days, the event witnessed enthusiastic participation from citizens, practitioners, researchers, industry representatives, students and thousands of farmers from Buldhana and the wider Vidarbha region.</p><p>In her inaugural address, the President described health as the highest form of happiness and underlined that Ayush systems offer a comprehensive lifestyle framework rooted in harmony between body and mind. She emphasised that preventive and holistic healthcare is central to reducing disease burden and strengthening the nation. On the occasion, she conferred the Lifetime Ayurvedic Gaurav Samman upon eminent practitioners for their outstanding contribution to Ayurveda, honouring their decades of service in advancing traditional medicine and public health.</p><p>The Governor of Maharashtra, Shri Acharya Devvrat, described Ayurveda as a timeless scientific tradition rooted in India’s ancient knowledge systems and stressed the importance of authenticity and quality in practice and medicines.</p><p>Union Minister of State (Independent Charge) for Ayush, Shri Prataprao Jadhav, who personally visited the Fair on almost all four days, described the National Arogya Fair as a “Mahakumbh of Indian traditional medicine systems.” Interacting extensively with practitioners, farmers, entrepreneurs and members of the public, he reiterated that Ayush is not merely a system of treatment but a nationwide movement for preventive healthcare, rural prosperity and global wellness leadership.</p><p>Shri Jadhav highlighted that under the leadership of the Prime Minister, the Ministry is strengthening evidence-based research, quality assurance and global outreach in Ayush systems. He underscored the immense potential of Ayush tourism and stated that India can emerge as the “crown of the world” in holistic wellness through Ayurveda, Yoga and natural therapies, generating employment and boosting rural economies.</p><p>A major highlight of the Fair was the extensive healthcare outreach provided free of cost to the public. Dedicated OPD counters across Ayurveda, Yoga & Naturopathy, Unani, Siddha, Sowa-Rigpa and Homoeopathy systems witnessed a substantial footfall throughout the four days. Thousands of beneficiaries availed free medical consultations, health check-ups and authentic Ayush medicines. Visitors appreciated the opportunity to receive expert advice on lifestyle disorders, chronic conditions and preventive care under one roof.</p><p>Live Yoga demonstrations and Yoga therapy sessions drew enthusiastic participation from all age groups. A Yoga competition organised during the Fair saw spirited involvement of youth and students, reflecting growing awareness and acceptance of Yoga as a preventive and promotive healthcare tool. The Ayush Aahar segment promoting region-specific, balanced dietary practices based on Ayush principles also received positive response from visitors.</p><p>The Ministry’s pavilion showcased the work of its Research Councils, National Institutes and the National Medicinal Plants Board (NMPB), presenting scientific research outcomes, public health initiatives, academic programmes and digital outreach efforts. Interactive displays on medicinal plants, herbal products and simple home-based remedies attracted considerable interest, especially among rural visitors and self-help groups.</p><p>A distinctive feature of the National Arogya Fair 2026 was its focused engagement with farmers. Special sessions on “Ayurvedic Farming: Production, Value Addition and Marketing” provided technical guidance on medicinal plant cultivation, post-harvest management and assured market linkages. Approximately 2000 farmers participated in the dedicated workshop organised in coordination with agricultural institutions and experts. The signing of multiple Letters of Intent, including a significant buy-back arrangement for turmeric procurement, marked a concrete step towards strengthening supply chains and ensuring remunerative returns to cultivators.</p><p>Farmers and participants from the Vidarbha region expressed appreciation for the initiative, noting that diversification into medicinal plant cultivation offers a sustainable and profitable avenue alongside conventional agriculture. Many described the Fair as a timely intervention that connects healthcare advancement with income enhancement and environmental sustainability.</p><p>Throughout the four days, the Fair functioned as a dynamic platform for knowledge exchange, public awareness and direct service delivery. Expert lectures, therapy showcases, industry exhibitions and interactions between policymakers and grassroots stakeholders reinforced the integrated vision of health and livelihood.</p><p>The successful conclusion of the National Arogya Fair 2026 at Shegaon reflects the Ministry of Ayush’s continued commitment to bringing traditional systems of medicine closer to the people, while simultaneously strengthening research, quality standards and farmer participation in the Ayush value chain.</p><p>By combining free healthcare services, scientific engagement, youth participation through Yoga competitions and structured support for medicinal plant cultivation, the Fair has demonstrated how Ayush systems can contribute simultaneously to public health, rural development and India’s emergence as a global hub for holistic wellness.</p>",
    "category": "Agriculture",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0011DYM.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002AK9R.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003919G.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004ZVP7.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005X0WI.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image006EUYW.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0073IHY.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image008IX4Z.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234104&reg=3&lang=1"
  }
]