[
  {
    "headline": "BRICS India summit needs a green and resilient agenda",
    "summaryText": "<h2>BRICS India summit needs a green and resilient agenda</h2><h3>Why in News</h3><p>&lt;div&gt;&lt;p&gt;The next BRICS Summit will be held in India this year.</p><h3>Background</h3><p>Having hosted the G-20 (2023), infrastructure and organisational processes are in place, but India must quickly hone in on the Summit’s focus.</p><h3>Key Highlights</h3><ul><li>This should obviously resonate with India and BRICS, but critically be an issue that is of vital importance for the Global South.&lt;/p&gt;&lt;p&gt;Given its vastly increased vulnerabilities to climate change, resilience is a top priority for the South, and also underscores India’s and Prime Minister Narendra Modi’s global leadership on an inclusive green agenda.&lt;/p&gt;&lt;h4&gt;Need for a stabilising force&lt;/h4&gt;&lt;p&gt;In the Trump polar world, collaborative multilateralism is under immense stress, with climate change being particularly singled out by the United States and being called a hoax along with a visible push for more fossil fuel use.</li><li>The Donald Trump administration has said that it will withdraw the U.S.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>from 66 international organisations, which includes the India-helmed International Solar Alliance.</p><h3>Challenges</h3><p>stayed away from the COP30 in Belém, Brazil, in November 2025 — something that possibly ensured a continuation of the COP process.</p><h3>Way Forward</h3><p>With the Europeans, who for long positioned themselves as climate champions, facing domestic climate fatigue and external national security priorities, there is a certain space for a stabilising force for collaborative action on sustainability and resilience.</p><h3>Prelims Facts</h3><ul><li>after the Paris Agreement came into force.</li><li>action. A BRICS act would also be</li><li>trade policy</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-2"
  },
  {
    "headline": "Why the new Digital Personal Data Protection Act faces a constitutional challenge in the Supreme Court",
    "summaryText": "<h2>Why the new Digital Personal Data Protection Act faces a constitutional challenge in the Supreme Court</h2><h3>Why in News</h3><p>&lt;p&gt;&lt;span&gt;Three separate PIL petitions have been filed in the Supreme Court challenging the constitutionality of the &lt;strong&gt;Digital Personal Data Protection Act, 2023&lt;/strong&gt; (DPDP Act).</p><h3>Background</h3><p>While the statute was enacted to safeguard digital privacy of individuals, the petitioners argue that the Act — and the Rules notified under it — paradoxically undermines the fundamental Right to Information (RTI), handicaps investigative journalism, and expands state surveillance powers.&lt;/span&gt;&lt;/p&gt; &lt;p&gt;&lt;span&gt;The petitions have been filed by the National Campaign for Peoples’ Right to Information (NCPRI), a civil society network instrumental in the enactment of the RTI Act; Venkatesh Nayak, a transparency advocate; and The Reporters’ Collective Trust, a group of investigative journalists.&lt;/span&gt;&lt;/p&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;div&gt;&lt;img&gt; &lt;p&gt;&lt;span&gt;The Supreme Court on Monday admitted the pleas, issuing notice to the Centre and listed them for hearing by a Constitution Bench of five judges in March.</p><h3>Key Highlights</h3><ul><li>However, it declined to place an &lt;strong&gt;interim stay&lt;/strong&gt; on the Act.&lt;/span&gt;&lt;/p&gt; &lt;p&gt;&lt;span&gt;What are the objections to the statute listed in the petitions?</li><li>We explain.&lt;/span&gt;&lt;/p&gt;&lt;div&gt;&lt;/div&gt; &lt;h2&gt;&lt;b&gt;Privacy vs transparency&lt;/b&gt;&lt;/h2&gt; &lt;p&gt;&lt;span&gt;A central point made by all three petitioners concerns the amendment to the RTI Act, 2005.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>&lt;strong&gt;Section 44(3) of the DPDP Act&lt;/strong&gt; alters Section 8(1)(j) of the RTI Act, which governs the disclosure of personal information held by public authorities.&lt;/span&gt;&lt;/p&gt; &lt;p&gt;&lt;span&gt;Before this amendment, public officials could deny personal information requested under the Act only if it had no relationship to any public activity or interest, or if it caused an “unwarranted invasion of the privacy of the individual”.</p><h3>Challenges</h3><p>The unamended Section 8(1)(j) also contained a public interest exception, which allowed the public information officer (PIO) to disclose even personal information if they were satisfied that the “larger public interest justifies the disclosure”.&lt;/span&gt;&lt;/p&gt; &lt;p&gt;&lt;span&gt;The substituted Section 8(1)(j) now simply exempts “information which relates to personal information”.</p><h3>Way Forward</h3><p>The NCPRI petition states that this amendment “extinguishes” the statutory power of PIOs to weigh public interest against privacy.&lt;/span&gt;&lt;/p&gt;&lt;div&gt;&lt;div&gt;Story continues below this ad&lt;/div&gt;&lt;div&gt;&lt;/div&gt;&lt;/div&gt; &lt;div&gt;&lt;span&gt;Also read&lt;/span&gt; | &lt;span&gt;DPDP Rules 2025: Cyberlaw expert breaks down India’s new data privacy framework&lt;/span&gt;&lt;/div&gt; &lt;p&gt;&lt;span&gt;The Reporters’ Collective points out that investigations into corruption often rely on records like asset disclosures, tender documents and file notations, which inevitably contain personal data.</p><h3>Prelims Facts</h3><ul><li>in the Supreme Court challenging the constitutionality</li><li>Personal Data Protection Act, 2023&lt;/strong&gt; (DPDP Act).</li><li>Act, 2023&lt;/strong&gt; (DPDP Act). While the statute</li><li>argue that the Act — and the</li><li>of the RTI Act; Venkatesh Nayak, a</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-2"
  },
  {
    "headline": "Privacy and transparency: On the RTI Act amendment, petitions",
    "summaryText": "<h2>Privacy and transparency: On the RTI Act amendment, petitions</h2><h3>Why in News</h3><p>&lt;div&gt;&lt;p&gt;On Monday, the Supreme Court of India referred a series of petitions challenging the amendment to Section 8(1)(j) of the Right to Information (RTI) Act by Section 44(3) of the Digital Personal Data Protection (DPDP) Act, 2023, to a Constitution Bench, recognising its “constitutional sensitivity”.</p><h3>Background</h3><p>The Chief Justice of India even remarked that the Court might “have to lay down what is meant by ‘personal information’”.</p><h3>Key Highlights</h3><ul><li>The RTI Act, 2005 was enacted to create an informed citizenry and ensure state accountability, which is vital for a democracy.</li><li>Over two decades later, the DPDP Act has delivered a body blow by diluting one of its foundational sections.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>Section 8(1)(j) originally allowed the withholding of personal information only if it had no relationship to any public activity or interest, or if its disclosure resulted in an unwarranted invasion of privacy.</p><h3>Challenges</h3><p>Crucially, the section included a “public interest override” as an integral feature of the 2005 Act, permitting disclosure if a Public Information Officer was satisfied that the larger public interest justified it.</p><h3>Way Forward</h3><p>The DPDP amendment removes this override and prohibits the disclosure of “any information which relates to personal information”, amounting to a blanket ban.</p><h3>Prelims Facts</h3><ul><li>Monday, the Supreme Court of India referred</li><li>to Information (RTI) Act by Section 44(3)</li><li>Data Protection (DPDP) Act, 2023, to a</li><li>remarked that the Court might “have to</li><li>information’”. The RTI Act, 2005 was enacted</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-2"
  },
  {
    "headline": "The 27th amendment, Pakistan’s democratic dilemma",
    "summaryText": "<h2>The 27th amendment, Pakistan’s democratic dilemma</h2><h3>Why in News</h3><p>&lt;div&gt;&lt;p&gt;Last year, between November 12 and 13, Pakistan’s legislature passed the 27th Amendment, or PCA, which subsequently received presidential assent.</p><h3>Background</h3><p>Presented as a measure to reorganise aspects of the military command structure, the amendment has consequences that reach far deeper into the constitutional order.</p><h3>Key Highlights</h3><ul><li>The PCA significantly diminishes the central role of the Supreme Court in Pakistan’s constitutional order.</li><li>By transferring original jurisdiction over constitutional interpretation, fundamental rights and federal-provincial disputes to a newly created Federal Constitutional Court, or FCC, the amendment sidelines the Supreme Court from the most consequential questions of governance.&lt;/p&gt;&lt;p&gt;In recent years, it was precisely this jurisdiction that enabled the top court to adjudicate landmark political cases, including the Panama Papers case and the Memogate controversy.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>Stripping the top court of this authority not only fragments constitutional adjudication but also weakens its position as the final guardian of the Constitution, leaving it vulnerable to institutional marginalisation under executive influence.&lt;/p&gt;&lt;h4&gt;Strains in the region&lt;/h4&gt;&lt;p&gt;The passage of the PCA must be viewed against a broader regional backdrop.</p><h3>Challenges</h3><p>South Asia is navigating a period marked by political instability, security concerns and institutional strain.</p><h3>Way Forward</h3><p>These pressures are not confined to national borders.</p><h3>Prelims Facts</h3><ul><li>of the Supreme Court in Pakistan’s constitutional</li><li>created Federal Constitutional Court, or FCC, the</li><li>sidelines the Supreme Court from the most</li><li>enabled the top court to adjudicate landmark</li><li>Stripping the top court of this authority</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-2"
  },
  {
    "headline": "Eurasian diving duck in Kaziranga triggers climate change concern",
    "summaryText": "<h2>Eurasian diving duck in Kaziranga triggers climate change concern</h2><h3>Why in News</h3><p>&lt;div&gt;&lt;p&gt;The seventh waterbird count at the Kaziranga National Park and Tiger Reserve in Assam released on Wednesday (February 25, 2026) has spotlighted a new avian guest — a diving duck from the Eurasian taiga breeding grounds.&lt;/p&gt;&lt;p&gt;However, the cheer for ornithologists and wildlife officials has come with some concern related to climate change.&lt;/p&gt;&lt;div&gt;&lt;div&gt;&lt;div&gt; First scientific assessment establishes Kaziranga as a fishing cat stronghold&lt;/div&gt;&lt;div&gt;&lt;img&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;p&gt;“The smew (&lt;i&gt;Mergellus albellus&lt;/i&gt;) signals wetland health in India, but its vagrant status flags climate-driven range shifts and the need to protect refuelling stops amid hunting and oil pollution threats,” said ornithologist Nilutpal Mahanta, a part of the waterbird census held from January 4 to 11.&lt;/p&gt;&lt;p&gt;A striking diving duck, the smew is a rare visitor to India.</p><h3>Background</h3><p>Male smews have a black-masked white body, while females have a mottled brown body.</p><h3>Key Highlights</h3><ul><li>Sightings are sporadic and localised, mainly in northern or central Indian wetlands, including Haiderpur in Uttar Pradesh.&lt;/p&gt;&lt;p&gt;During the census, the smew was recorded at Rowmari-Donduwa beels in Laokhowa, part of the Kaziranga landscape covering 1,302 sq.</li><li>km., and in the core areas of the park that are better known for its one-horned rhinoceroses.&lt;/p&gt;&lt;div&gt;&lt;div&gt;&lt;div&gt; Fighting what climate change is doing to animals merits a change of India’s own&lt;/div&gt;&lt;div&gt;&lt;img&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;p&gt;The diving duck favours fish-rich, sheltered waters during winter, singly or in a small flock.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>Globally, there are an estimated 130,000 smews, but their number has been declining due to habitat loss and human activities.&lt;/p&gt;&lt;h4&gt;Fewer waterfowls&lt;/h4&gt;&lt;p&gt;The enumerators recorded 105,540 individual waterbirds belonging to 107 species.</p><h3>Challenges</h3><p>The number was 6,522 individuals and 17 species fewer than what the sixth waterbird count yielded in 2025.&lt;/p&gt;&lt;div&gt;&lt;div&gt;&lt;div&gt; Asian Waterbird Census records marginal increase in bird population but also habitat degradation&lt;/div&gt;&lt;div&gt;&lt;img&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt;&lt;p&gt;Officials downplayed the numerical dip.</p><h3>Way Forward</h3><p>They said the arrival of the smew “underscores floodplain resilience for flyway migrants, guiding anti-encroachment efforts in the two Important Bird Areas (IBAs) in the Kaziranga landscape — the Kaziranga National Park and two wildlife sanctuaries, Laokhowa and Burhachapori, together.&lt;/p&gt;&lt;h4&gt;‘Record-breaking census’&lt;/h4&gt;&lt;p&gt;“The first-ever sighting of the smew has stolen the spotlight in a record-breaking census of 105,540 birds.</p><h3>Prelims Facts</h3><ul></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-3"
  },
  {
    "headline": "India well placed amid global uncertainty, growth strong and inflation benign: RBI Governor",
    "summaryText": "<h2>India well placed amid global uncertainty, growth strong and inflation benign: RBI Governor</h2><h3>Why in News</h3><p>&lt;p&gt;Despite rising geopolitical tensions and increasing trade-related uncertainties across the world, the Indian economy remains on a strong footing with robust growth and subdued inflation, Reserve Bank of India Governor Sanjay Malhotra said on Friday.&lt;/p&gt; &lt;p&gt;Presenting the first monetary policy of calendar year 2026, Governor said India has weathered global headwinds better than many peer economies and continues to benefit from strong domestic demand, resilient services activity and improving manufacturing performance.</p><h3>Background</h3><p>“Amid heightened geopolitical tensions and elevated uncertainty, the Indian economy is in a good spot with strong growth and low inflation,” he said, adding that inflation remains below the tolerance band and its outlook continues to be benign.</p><h3>Key Highlights</h3><ul><li>The Monetary Policy Committee of the RBI on Friday kept the main policy rate – Repo rate – &lt;strong&gt;unchanged at 5.25 per cent and raised the GDP growth forecast&lt;/strong&gt; by 10 basis points to 7.4 per cent for FY2026.&lt;/p&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;div&gt;&lt;img&gt; &lt;h2&gt;Growth momentum&lt;/h2&gt; &lt;p&gt;The Governor noted that high-frequency indicators point to a continuation of strong growth momentum in the third quarter of 2025-26 and beyond.</li><li>Recent trade developments, including the signing of a landmark free trade agreement with the European Union and a trade deal with the US, are likely to sustain growth momentum over a longer period by supporting exports and investment.&lt;/p&gt; &lt;p&gt;He said recovery in urban consumption should further strengthen with continued support from GST rationalisation and monetary easing among others.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>High capacity utilisation, accelerating bank credit, conducive financial conditions and government’s continued emphasis on infrastructure should give an impetus to investment activity.&lt;/p&gt;&lt;div&gt;&lt;/div&gt; &lt;p&gt;Moreover, several &lt;strong&gt;measures announced in the Budget should be conducive&lt;/strong&gt; for growth, he said.&lt;/p&gt; &lt;p&gt;At the global level, the Governor observed that growth is expected to be marginally stronger in 2026 than earlier projected, aided by technology-led investments, accommodative financial conditions and large-scale fiscal stimulus.</p><h3>Challenges</h3><p>However, he cautioned that escalating geopolitical frictions and rising trade tensions are beginning to unravel the existing world economic order.</p><h3>Way Forward</h3><p>Inflation trends remain uneven across countries, staying above targets in most advanced economies, which has led to divergence in monetary policy actions as central banks approach the end of their easing cycles.&lt;/p&gt; &lt;h2&gt;External headwinds&lt;/h2&gt; &lt;p&gt;Turning to the domestic outlook, the Governor said real GDP growth is expected to remain resilient.</p><h3>Prelims Facts</h3><ul><li>the first monetary policy of calendar year</li><li>benign. The Monetary Policy Committee of the</li><li>kept the main policy rate – Repo</li><li>landmark free trade agreement with the European</li><li>divergence in monetary policy actions as central</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-3"
  },
  {
    "headline": "Congress slams Economic Survey’s RTI review call, but UPA ministers once raised similar concerns",
    "summaryText": "<h2>Congress slams Economic Survey’s RTI review call, but UPA ministers once raised similar concerns</h2><h3>Why in News</h3><p>&lt;p&gt;A day after the Economic Survey called for the Right to Information Act, 2005, to be re-examined, the Congress on Friday hit out at the government, alleging it was planning to “murder” the UPA-era law after having “systematically weakened” it since coming to power in 2014.&lt;/p&gt; &lt;p&gt;The Survey acknowledged the law as a powerful democratic reform and a tool for accountability and against corruption, but added it was never intended “as a tool for idle curiosity” and that it risks becoming an “end in itself”, where disclosures are celebrated regardless of contribution to better governance.&lt;/p&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;div&gt;&lt;div&gt;&lt;div&gt;Advertisement&lt;/div&gt;&lt;div&gt;&lt;/div&gt;&lt;/div&gt;&lt;img&gt; &lt;p&gt;While Congress president Mallikarjun Kharge targeted the government, some senior ministers in the UPA-2 government (2009-2014) had argued in public that the RTI Act was being “misused”, which affected institutional efficacy and efficiency.</p><h3>Background</h3><p>Several corruption scandals that buffeted the government, finally leading to it losing power, emerged through RTI disclosures.&lt;/p&gt; &lt;p&gt;In 2011, then Law Minister Salman Khurshid and Corporate Affairs Minister M Veerappa Moily flagged the issue in the wake of a controversy over a Finance Ministry note on Finance Minister P Chidambaram’s stance on the 2G spectrum allocation.</p><h3>Key Highlights</h3><ul><li>The note became public through RTI.&lt;/p&gt;&lt;div&gt;&lt;/div&gt; &lt;p&gt;Demanding a &lt;strong&gt;re-look at the RTI Act&lt;/strong&gt;, Khurshid said its misuse was affecting institutional efficacy and efficiency, with even the bureaucracy becoming reluctant to record its opinion.</li><li>He called for a balance to be maintained between transparency and accountability and institutional efficiency.&lt;/p&gt;&lt;div&gt;&lt;div&gt;&lt;div&gt;Advertisement&lt;/div&gt;&lt;div&gt;&lt;/div&gt;&lt;/div&gt;&lt;/div&gt; &lt;p&gt;“There is a confidential communication between a minister and the Prime Minister and then there are further consultations before we bring something to the cabinet; If everything that I as a minister write to the Prime Minister comes out, then what is the point of writing to the PM confidentially?</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>The same goes for the communication between the governor and chief minister.</p><h3>Challenges</h3><p>…These issues have to be dispassionately examined as to at what stage such papers can be given.</p><h3>Way Forward</h3><p>You cannot claim papers under the RTI which are part of internal communications ahead of a cabinet decision until such time that a decision is finally taken,” Khurshid told &lt;em&gt;The Indian Express&lt;/em&gt;.&lt;/p&gt; &lt;p&gt;“There is a bona fide question about institutional efficacy and efficiency.</p><h3>Prelims Facts</h3><ul><li>Right to Information Act, 2005, to be</li><li>that the RTI Act was being “misused”,</li><li>at the RTI Act&lt;/strong&gt;, Khurshid said its</li><li>of the RTI Act,” Khurshid said in</li><li>In fact, the Act itself needs to</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-2"
  },
  {
    "headline": "The Constitution enters the sanctum",
    "summaryText": "<h2>The Constitution enters the sanctum</h2><h3>Why in News</h3><p>&lt;div&gt;&lt;p&gt;&lt;span&gt;T&lt;/span&gt;wo recent judgments of the Madras High Court — one concerning the Thiruparankundram Deepathoon and the other relating to the rights of the Thenkalai sect to recite hymns at the Kanchipuram Varadaraja Perumal temple — have brought to the fore the role of the judiciary in adjudicating religious disputes.</p><h3>Background</h3><p>That these matters have reached the High Court is revealing on multiple levels.</p><h3>Key Highlights</h3><ul><li>First, it tells us that courts have a constitutional role in deciding religious disputes.</li><li>Second, it demolishes the argument that temples are private spaces where the court or the state cannot intervene.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>Given the growing number of such cases, the law around religion has taken centre stage like never before.&lt;/p&gt;&lt;h4&gt;Shift from civil rights disputes&lt;/h4&gt;&lt;p&gt;Over a hundred years ago, it was civil courts that dealt with temple disputes.</p><h3>Challenges</h3><p>In a case pertaining to entry into the Kamudhi temple in Ramanathapuram, pitched battles around civil rights to enter temple premises were fought all the way up to the Privy Council in London.</p><h3>Way Forward</h3><p>Raja Rajeswara Dorai and Ors &lt;/i&gt;(1908), the Privy Council was called upon to decide whether the Nadar community had a right to enter the Kamudhi temple.</p><h3>Prelims Facts</h3><ul><li>the Madras High Court — one concerning</li><li>reached the High Court is revealing on</li><li>spaces where the court or the state</li><li>Hindu Religious Endowments Act to govern temples</li><li>and Charitable Endowments Act for better temple</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-2"
  },
  {
    "headline": "Union Budget: Rs 10,000-crore SME Growth Fund, reform to boost liquidity for MSMEs",
    "summaryText": "<h2>Union Budget: Rs 10,000-crore SME Growth Fund, reform to boost liquidity for MSMEs</h2><h3>Why in News</h3><p>&lt;p&gt;Aiming to improve the liquidity for Small and MediumEnterprises (SME), Union Finance Minister Nirmala Sitharaman announced a Rs 10,000 crore SME Growth Fund to ensure timely payments to SMEs.&lt;/p&gt; &lt;p&gt;“I propose to introduce a dedicated Rs 10,000 crore SME Growth Fund, to create future Champions, incentivising enterprises based on select criteria.</p><h3>Background</h3><p>I also propose to top up the Self-Reliant India Fund set up in 2021, with Rs 2,000 crore to continue support to micro enterprises and maintain their access to risk capital,” Sitharaman said while &lt;strong&gt;presenting the Budget&lt;/strong&gt;.&lt;/p&gt;&lt;img&gt; &lt;p&gt;She also proposed four measures to maximise the potential of the Trade Receivables Discounting System (TReDS) platform — mandating it as the transaction settlement platform for all purchases that central power sector companies make from MSMEs, introducing a Credit Guarantee Support Mechanism (CGTMSE) through the credit guarantee fund trust for MSMEs for invoice discounting on the platform.&lt;/p&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;div&gt; &lt;p&gt;It thereby links the Government E-marketplace with the platform for information sharing with financiers about government purchases from MSMEs, in turn encouraging cheaper and quicker financing, and introducing TReDS receivables as tradeable asset-backed securities.&lt;/p&gt;&lt;div&gt;&lt;/div&gt; &lt;div&gt;&lt;span&gt;Read&lt;/span&gt; | &lt;span&gt;5 takeaways from the Union Budget 2026-27: Push on creating jobs, easing US tariffs distress, bolstering fund flows&lt;/span&gt;&lt;/div&gt; &lt;p&gt;“The enhancement of CGTMSE is directionally supportive, but its impact will ultimately depend on improved receivable flows — where TReDS becomes critical.</p><h3>Key Highlights</h3><ul><li>The mandatory onboarding of CPSEs and large buyers on TReDS under Budget 2026-27 should strengthen payment discipline and enhance the effectiveness of credit guarantees by reducing cash‑flow unpredictability,” said Neermoy Shah, Associate Director, India Ratings &amp;amp; Research.&lt;/p&gt; &lt;p&gt;The TReDS platform, introduced as a concept by the Reserve Bank of India (RBI) in 2014 and later becoming operational in 2018, is used by MSMEs to discount invoices and cash-in on trade receivables.&lt;/p&gt; &lt;p&gt;This helps the smaller companies with limited cash flows to improve liquidity and cope against issues such as delayed payments from buyers without the requirement of a collateral.&lt;/p&gt;&lt;div&gt;&lt;div&gt;Story continues below this ad&lt;/div&gt;&lt;div&gt;&lt;/div&gt;&lt;/div&gt; &lt;div&gt;&lt;span&gt;Read&lt;/span&gt; | &lt;span&gt;No big-ticket sops for poll-bound states in Budget 2026, unlike previous years&lt;/span&gt;&lt;/div&gt; &lt;p&gt;Sitharaman also said the government will make affordable professional help available for MSMEs so that these companies can comply with regulatory requirements at affordable costs.</li><li>This will be done by facilitating institutions such as Institute of Chartered Accountants of India, Institute of Company Secretaries of India, and Institute of Cost Accountants of India to design short-term modular courses and practical tools to develop ‘Corporate Mitras’, especially in Tier-II and Tier-III cities.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>“ These accredited para-professionals will help MSMEs meet compliance requirements at affordable costs,” she said.&lt;/p&gt; &lt;p&gt;MSMEs have long borne the brunt of excessive regulatory requirements, with Comptroller and Auditor General (CAG) K Sanjay Murthy on Thursday raising concern that this burden reduces the competitiveness of these smaller companies.</p><h3>Challenges</h3><p>“We need a 4-pronged strategy of Simplification, Digitalisation, Decriminalisation, and Elimination of redundant laws—all of which are highly relevant for MSMEs,” the CAG said in a press release.&lt;/p&gt; &lt;section&gt;&lt;div&gt;&lt;/div&gt;&lt;/section&gt;&lt;p&gt;&lt;/p&gt;&lt;/div&gt;</p><h3>Way Forward</h3><p>A coordinated and policy-driven approach is required.</p><h3>Prelims Facts</h3><ul></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-3"
  },
  {
    "headline": "Monetary Policy Meet: Repo rate steady at 5.25%; FY26 GDP, inflation projections raised",
    "summaryText": "<h2>Monetary Policy Meet: Repo rate steady at 5.25%; FY26 GDP, inflation projections raised</h2><h3>Why in News</h3><p>&lt;p&gt;In line with expectations, the Reserve Bank of India’s (RBI) Monetary Policy Committee (MPC) unanimously decided to &lt;strong&gt;hold the repo rate&lt;/strong&gt; — the key policy rate — unchanged at 5.25%.&lt;/p&gt; &lt;p&gt;The RBI lifted its FY26 gross domestic product (GDP) forecast to 7.4% from an earlier estimate of 7.3%.</p><h3>Background</h3><p>It also revised upwards the projection for consumer price index (CPI) inflation to 2.1% from 2%.&lt;/p&gt;&lt;img&gt; &lt;p&gt;“The Indian economy continues to register high growth despite a challenging external environment clouded by geo-political uncertainties.</p><h3>Key Highlights</h3><ul><li>Benign inflation provides the leeway to remain growth-supportive while preserving financial stability,” RBI Governor Sanjay Malhotra said while announcing the monetary policy.&lt;/p&gt; &lt;p&gt;“After a detailed assessment of the evolving macroeconomic and financial developments and the outlook, the MPC voted unanimously to keep the policy repo rate under the liquidity adjustment facility (LAF) unchanged at 5.25%,” he added.</li><li>The LAF is a monetary policy tool used by the RBI to manage daily liquidity in the country’s banking system.&lt;/p&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;div&gt;&lt;div&gt;&lt;/div&gt; &lt;div&gt;&lt;span&gt;Explained&lt;/span&gt; | &lt;span&gt;RBI holds interest rates steady: What drove the decision?&lt;/span&gt;&lt;/div&gt; &lt;p&gt;A status quo on the policy rate would mean that their EMIs on home, vehicle, personal corporate and small business loans are unlikely to change.&lt;/p&gt; &lt;p&gt;The MPC decision on Friday to keep the repo rate unchanged comes on the heels of a rate cut in December, when the six-member committee lowered the repo rate by 25 basis points (bps) to 5.25%.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>This brought the cumulative reduction in policy rates in 2025 to 125 bps, marking a period of sustained monetary easing.&lt;/p&gt; &lt;p&gt;The six-member rate-setting panel, by a 5:1 majority, voted to keep the policy stance as ‘neutral’, with one of the external members favouring a shift to an accommodative stance.&lt;/p&gt;&lt;div&gt;&lt;div&gt;Story continues below this ad&lt;/div&gt;&lt;div&gt;&lt;/div&gt;&lt;/div&gt; &lt;p&gt;When asked if 5.25% is the terminal repo rate, Malhotra said that given the state of the economy, he foresees the rate to remain at the current levels over the next 9-12 months, indicating a long pause.&lt;/p&gt; &lt;p&gt;He, however, stated that with inflation remaining benign, policy rates will continue to be at low levels for a long period of time.</p><h3>Challenges</h3><p>“Whether they will go down even further, I will leave it for the MPC to decide going forward,” he noted.&lt;/p&gt; &lt;p&gt;“After a long season of rate cuts, we believe the RBI has pivoted to steady policy rates for the foreseeable future,” HSBC economists Pranjul Bhandari and Aayushi Chaudhary said in a report.&lt;/p&gt; &lt;p&gt;&lt;strong&gt;Growth momentum&lt;/strong&gt;&lt;/p&gt; &lt;p&gt;Malhotra noted high frequency indicators suggest continuation of the strong growth momentum in the third quarter of FY26 and beyond.&lt;/p&gt;&lt;div&gt;&lt;div&gt;Story continues below this ad&lt;/div&gt;&lt;div&gt;&lt;/div&gt;&lt;/div&gt; &lt;p&gt;“With the signing of a landmark trade deal with the EU and the US trade agreement in sight, growth momentum is likely to be sustained for a longer period,” he said.&lt;/p&gt; &lt;p&gt;While rural demand remains steady, recovery in urban consumption is likely to strengthen further, supported by GST rationalisation and monetary easing.</p><h3>Way Forward</h3><p>Buoyed by positive growth prospects, the RBI upgraded its real GDP growth estimate for FY26 to 7.4%, and for Q1 and Q2 of FY27 to 6.9% (from 6.7%) and 7% (from 6.8%), respectively.</p><h3>Prelims Facts</h3><ul><li>India’s (RBI) Monetary Policy Committee (MPC) unanimously</li><li>— the key policy rate — unchanged</li><li>announcing the monetary policy.&lt;/p&gt;\n&lt;p&gt;“After a detailed assessment</li><li>to keep the policy repo rate under</li><li>is a monetary policy tool used by</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-3"
  },
  {
    "headline": "​Treatise for federalism: On Tamil Nadu and the Kurian Joseph report",
    "summaryText": "<h2>​Treatise for federalism: On Tamil Nadu and the Kurian Joseph report</h2><h3>Why in News</h3><p>&lt;div&gt;&lt;p&gt;A high-level committee on Union-State relations appointed by the Government of Tamil Nadu has mapped the pattern of centralisation of power and the weakening of federal democracy in India over the decades, and suggested comprehensive corrective measures.</p><h3>Background</h3><p>The three-member Committee, chaired by a former Supreme Court judge, Justice Kurian Joseph, has drawn on scholarship across various disciplines, Constituent Assembly debates, and the findings of three other committees on Centre-State relations, while also critiquing recent governance trends that weaken the authority of States.</p><h3>Key Highlights</h3><ul><li>It concludes that centralisation is increasing — which it notes is not healthy — and calls for urgent remedial measures.</li><li>The report is an expansive critique of the dilapidation of federalism, threatening India’s progress, and calls for changes to reverse the dangerous course, stating that “Indian federalism now requires a structural reset comparable in ambition to the economic reforms of 1991”.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>India’s constitutional framework took shape against the backdrop of Partition, and the consolidation of princely States.</p><h3>Challenges</h3><p>The context encouraged the founders to tilt towards a centralising constitutional scheme; legislative, administrative, and judicial measures in the ensuing decades further reinforced this line of thinking.</p><h3>Way Forward</h3><p>The report convincingly takes down the arguments for centralisation, and argues that federalised governance is essential for a country of India’s size and diversity, and that it would in fact be dangerous to overlook this imperative.&lt;/p&gt;&lt;p&gt;The Kurian Joseph Committee report comes amid repeated and deliberate moves by the Union to centralise power.</p><h3>Prelims Facts</h3><ul><li>a former Supreme Court judge, Justice Kurian</li><li>a centralising constitutional scheme; legislative, administrative, and</li><li>Supreme Court</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-2"
  },
  {
    "headline": "What the new fiscal rule means for growth and spending",
    "summaryText": "<h2>What the new fiscal rule means for growth and spending</h2><h3>Why in News</h3><p>&lt;div&gt;&lt;p&gt;&lt;span&gt;T&lt;/span&gt;he direction of fiscal policy is influenced by the nature of fiscal policy rules.</p><h3>Background</h3><p>The present fiscal policy rule of the Union government is informed by what can be termed as sound finance rules, where the government typically aims to meet a given borrowing target.</p><h3>Key Highlights</h3><ul><li>While India has been largely following sound finance rules since the implementation of the Fiscal Responsibility and Budget Management (FRBM) Act, 2003, there have been two modifications since the last year.&lt;/p&gt;&lt;p&gt;First, in contrast to the FRBM Act, where the fiscal deficit-GDP ratio acted as the primary policy target, it is the debt-GDP ratio which appears as the primary policy target in the new policy rule.</li><li>Second, the targeted level of debt-GDP ratio in the new rule stands at around 50%, which the government proposes to meet by 2031.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>The new rule allows the government to sustain higher debt-GDP ratio as compared to the level suggested in the FRBM Act (40%).&lt;/p&gt;&lt;p&gt;There are at least two implications of the present variant of sound finance rule for this year’s Budget.</p><h3>Challenges</h3><p>First, since the present level of debt-GDP ratio stands above the targeted level, the government has aimed to reduce its debt-ratio by reducing the primary deficits and fiscal deficits from 0.8% and 4.4% in FY 2026 to 0.7% and 4.3% respectively in FY 2027.</p><h3>Way Forward</h3><p>The fiscal consolidation strategy is similar to one pursued since FY 2022.&lt;/p&gt;&lt;p&gt;Second, the new target of debt-GDP ratio has provided greater fiscal space to the government as compared to the FRBM Act.</p><h3>Prelims Facts</h3><ul><li>direction of fiscal policy is influenced by</li><li>nature of fiscal policy rules. The present</li><li>The present fiscal policy rule of the</li><li>Budget Management (FRBM) Act, 2003, there have</li><li>to the FRBM Act, where the fiscal</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-3"
  },
  {
    "headline": "A cautious nudge: On the 16th Finance Commission’s recommendations",
    "summaryText": "<h2>A cautious nudge: On the 16th Finance Commission’s recommendations</h2><h3>Why in News</h3><p>&lt;div&gt;&lt;p&gt;In its much-awaited recommendations, which were also tabled on Sunday, the Sixteenth Finance Commission (FC-16), as anticipated, has recommended that the vertical devolution ratio — the States’ share in the divisible pool of Central taxes — be retained at 41% for the period 2026-31.</p><h3>Background</h3><p>This is despite the Commission acknowledging the tightening fiscal space States face under the GST framework, and that the growing mismatch between expenditure responsibilities and assured revenues has increasingly left them with “recourse to market borrowings” as the principal adjustment mechanism.</p><h3>Key Highlights</h3><ul><li>Predictably, several States have criticised the projected devolutions for the coming fiscal but have also cautiously welcomed a tweak in the horizontal devolution formula.</li><li>The FC-16 has reworked the earlier “tax effort” criterion into a broader “contribution to GDP” measure and raised its weight sharply — from 2.5% under the FC-15 to 10%.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>This change is intended to reward productive and efficient States and represents a modest but meaningful attempt to link governance outcomes with fiscal transfers.&lt;/p&gt;&lt;p&gt;However, the resulting gains are deliberately restrained.</p><h3>Challenges</h3><p>The FC-16 makes it clear that any restructuring of horizontal devolution must be undertaken “gradually”, to avoid abrupt redistributive shocks to States that are more dependent on transfers.</p><h3>Way Forward</h3><p>Accordingly, the weight accorded to demographic performance has been reduced, reflecting the view that penalising population growth is no longer appropriate at a time when India is close to the peak of its demographic dividend.</p><h3>Prelims Facts</h3><ul><li>the Sixteenth Finance Commission (FC-16), as anticipated,</li><li>is despite the Commission acknowledging the tightening</li><li>limits of the Commission’s ambition. A stronger</li><li>in which States act as implementers of</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-2"
  },
  {
    "headline": "Protecting the freedom of speech of MPs",
    "summaryText": "<h2>Protecting the freedom of speech of MPs</h2><h3>Why in News</h3><p>&lt;div&gt;&lt;p&gt;&lt;span&gt;R&lt;/span&gt;ecent happenings in Parliament have brought into sharp focus the issue of freedom of speech in the Houses, guaranteed by Article 105 of the Constitution.</p><h3>Background</h3><p>Of course, this is subject to other provisions of the Constitution and the rules of the Houses.</p><h3>Key Highlights</h3><ul><li>That the freedom of speech of MPs is subject to the rules of the Houses seems to have created the wrong impression that the provisions of the rules can in a way override constitutional rights.</li><li>The root of the problem which the leaders of the Opposition face in Parliament lies in this erroneous impression.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>The Supreme Court has clarified on many occasions that the restrictions on the rights of citizens should not be such that they eclipse those very rights.</p><h3>Challenges</h3><p>This principle would apply to the freedom of speech of MPs in the Houses as well.</p><h3>Way Forward</h3><p>The rules of the Houses are meant to regulate the conduct of the proceedings in accordance with the Constitution.&lt;/p&gt;&lt;p&gt;&lt;strong&gt;&lt;b&gt;Also Read | Blot on democracy: Rahul Gandhi lodges protest with Lok Sabha Speaker for not being allowed to speak&lt;/b&gt;&lt;/strong&gt;&lt;/p&gt;&lt;h4&gt;Expunging words&lt;/h4&gt;&lt;p&gt;The question which has arisen in the first part of the Budget Session of Parliament is whether there were too many restrictions imposed on the freedom of speech of the members of the Houses, in particular, the leaders of the Opposition.</p><h3>Prelims Facts</h3><ul><li>Houses, guaranteed by Article 105 of the</li><li>impression. The Supreme Court has clarified on</li><li>MP’s right under Article 105 is infringed.</li><li>House is subject? Article 121 says no</li><li>of the Supreme Court or of a</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-2"
  },
  {
    "headline": "U.S. Supreme Court rejects tariffs highlights | Government studying implications of U.S. tariff, says Commerce Ministry",
    "summaryText": "<h2>U.S. Supreme Court rejects tariffs highlights | Government studying implications of U.S. tariff, says Commerce Ministry</h2><h3>Why in News</h3><p>&lt;div&gt;&lt;div&gt;&lt;div&gt;&lt;div&gt;&lt;h5&gt;Key Updates&lt;/h5&gt;&lt;ul&gt;&lt;li&gt; India now faces lower tariff rate of 10% &lt;/li&gt;&lt;li&gt; U.S.</p><h3>Background</h3><p>partners that struck deals with Trump now face 10% tariff: White House &lt;/li&gt;&lt;li&gt; What are Section 122, 301 and 232 tariffs Trump is considering?</p><h3>Key Highlights</h3><ul><li>&lt;/li&gt;&lt;li&gt; ‘They’ll be paying tariffs, and we will not be paying tariffs’: Trump says no changes to India-U.S.</li><li>Supreme Court rejects Trump's global tariffs &lt;/li&gt;&lt;/ul&gt;&lt;/div&gt;&lt;/div&gt;&lt;div&gt;&lt;/div&gt;&lt;div&gt;&lt;ul&gt;&lt;li&gt;&lt;div&gt;&lt;meta&gt;&lt;meta&gt;&lt;meta&gt;&lt;div&gt;February 21, 2026 20:45&lt;/div&gt;&lt;div&gt; Germany's Merz expects lower tariff burden after U.S.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>court verdict on Trump tariffs&lt;/div&gt;&lt;div&gt;&lt;p&gt;German Chancellor Friedrich Merz said on Saturday ‌he expected the tariff burden ⁠on the German economy to be lower after a ‌U.S.</p><h3>Challenges</h3><p>Supreme Court ruling knocking down ‌a large ‌part ⁠of President Donald ⁠Trump’s trade tariffs.&lt;/p&gt;&lt;p&gt;Speaking to Germany’s ARD broadcaster, Mr.</p><h3>Way Forward</h3><p>Merz said there needed to ‌be talks with Washington before German companies could recoup billions ‌and said European Union countries would coordinate closely ahead of ⁠Merz’s upcoming trip to the U.S.&lt;/p&gt;&lt;p&gt;“...</p><h3>Prelims Facts</h3><ul><li>India-U.S. deal post court ruling</li><li>U.S. Supreme Court rejects Trump's global</li><li>burden after U.S. court verdict on Trump</li><li>a ‌U.S. Supreme Court ruling knocking down</li><li>this, because tariff policy is a ‌matter</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-2"
  },
  {
    "headline": "Corporate investment push strengthens, Rs 4.35 lakh crore lined up in FY26: RBI article",
    "summaryText": "<h2>Corporate investment push strengthens, Rs 4.35 lakh crore lined up in FY26: RBI article</h2><h3>Why in News</h3><p>&lt;p&gt;The domestic economy has entered the new year on a firm footing, displaying resilience and renewed momentum, especially in investment intentions by corporates, amid a turbulent global backdrop, according to the ‘State of the economy’ article in the Reserve Bank of India’s monthly bulletin.</p><h3>Background</h3><p>The total flow of financial resources to the commercial sector, meanwhile, rose by 35.29%, supported by credit from both bank and non-bank sources in FY26, according to the article.&lt;/p&gt; &lt;p&gt;Investment intentions by the private corporate sector rose to Rs 4.35 lakh crore during FY26, out of which banks and financial institutions sanctioned Rs 3.45 lakh crore.</p><h3>Key Highlights</h3><ul><li>External commercial borrowings and IPOs — for capital expenditure purposes — accounted for another Rs 85,800 crore, as per the data provided in the article authored by a panel of researchers.</li><li>It was below Rs 4 lakh crore in the previous year.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>Views expressed in the article do not reflect those of the central bank, it stated.&lt;/p&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;div&gt;&lt;img&gt; &lt;h2&gt;Corporate capex push&lt;/h2&gt; &lt;p&gt;Although the total cost of capex projects sanctioned by select banks and financial institutions (FIs) during the third quarter (Q3) was lower than the previous quarter, the sanctioned amount in Q3 was above the average for the post-Covid period, underscoring the persistence of investment appetite, it said.</p><h3>Challenges</h3><p>“Majority of the intended investment is concentrated in the power, chemical and construction industries,” the RBI report said.&lt;/p&gt; &lt;p&gt;On the investment front, total funds raised for capex purposes through different channels during April-December FY26 remained higher than in the comparable period since FY20, indicating sustained investment optimism, the RBI report said.</p><h3>Way Forward</h3><p>A persistent drag on the country’s growth trajectory in recent years has been the muted pace of corporate investment, which has tempered the broader expansion momentum despite otherwise supportive macroeconomic conditions.&lt;/p&gt;&lt;div&gt;&lt;/div&gt; &lt;p&gt;Moreover, during up to January 31, 2026, total flow of financial resources to the commercial sector in FY26 so far increased by nearly 35.29% to Rs 34.5 lakh crore from Rs 25.5 lakh crore a year ago.</p><h3>Prelims Facts</h3><ul><li>of the economy’ article in the Reserve</li><li>according to the article.&lt;/p&gt;\n&lt;p&gt;Investment intentions by the</li><li>provided in the article authored by a</li><li>expressed in the article do not reflect</li><li>according to the article.&lt;/p&gt;&lt;div&gt;&lt;div&gt;Story continues below this</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-3"
  },
  {
    "headline": "IIM Lucknow announces 3 new programmes on Artificial Intelligence, one UG course require JEE score",
    "summaryText": "<h2>IIM Lucknow announces 3 new programmes on Artificial Intelligence, one UG course require JEE score</h2><h3>Why in News</h3><p>&lt;p&gt;Union Education Minister Dharmendra Pradhan on Thursday inaugurated a series of new Artificial Intelligence programmes introduced by the Indian Institute of Management (IIM) Lucknow.</p><h3>Background</h3><p>The launch took place at the Bharat Bodhan AI Conclave 2026, marking what the institute described as a “historic step toward democratising AI education and positioning India as a global leader in responsible and ethical AI.”&lt;/p&gt; &lt;div&gt;&lt;span&gt;READ&lt;/span&gt; | &lt;img&gt;&lt;span&gt;JEE Mains Result 2026&lt;/span&gt;&lt;/div&gt; &lt;p&gt;Addressing the gathering, Pradhan emphasised the transformative potential of artificial intelligence for national development.</p><h3>Key Highlights</h3><ul><li>“We aim to make India a global leader in ethical AI,” he said.</li><li>“Business schools must lead in integrating AI into management, innovation, and real-world problem-solving.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>These programmes will prepare students for an AI-driven future while ensuring that technology remains aligned with human values.”&lt;/p&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;div&gt;&lt;img&gt; &lt;p&gt;He further highlighted India’s demographic advantage.</p><h3>Challenges</h3><p>The minister said the country’s young talent pool places it in a unique position to develop indigenous AI solutions.</p><h3>Way Forward</h3><p>“Aspirational India must leverage AI not only for economic growth but also for inclusive and socially meaningful progress,” he noted.</p><h3>Prelims Facts</h3><ul><li>and the IndiaAI Mission.&lt;/p&gt;\n&lt;section&gt;&lt;div&gt;&lt;/div&gt;&lt;/section&gt;&lt;p&gt;&lt;/p&gt;&lt;/div&gt;</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-2"
  },
  {
    "headline": "RBI keeps repo rate unchanged at 5.25%, maintains neutral stance",
    "summaryText": "<h2>RBI keeps repo rate unchanged at 5.25%, maintains neutral stance</h2><h3>Why in News</h3><p>&lt;p&gt;The Reserve Bank of India (RBI) on Friday kept the policy repo rate unchanged at &lt;strong&gt;5.25%&lt;/strong&gt;, as the six-member Monetary Policy Committee (MPC) concluded its final bi-monthly meeting of FY26.&lt;/p&gt; &lt;p&gt;RBI Governor Sanjay Malhotra on Friday said that the central bank’s monetary policy for the full financial year beginning April will be guided by new inflation data based on the revised GDP series, which is scheduled to be released later this month.&lt;/p&gt;&lt;img&gt; &lt;p&gt;Speaking after the Monetary Policy Committee (MPC) kept the repo rate unchanged at 5.25%, Malhotra said the upcoming data would provide a clearer assessment of price trends and macroeconomic conditions, and help fine-tune future policy actions.&lt;/p&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;div&gt; &lt;p&gt;The Governor also struck an optimistic note on growth prospects, citing recent and upcoming trade developments.</p><h3>Background</h3><p>“With the signing of the India–EU trade deal and the US trade agreement in sight, growth momentum is likely to be sustained for a longer period,” Malhotra said.&lt;/p&gt;&lt;div&gt;&lt;/div&gt; &lt;p&gt;He said the RBI would remain “proactive” in its liquidity management operations to ensure adequate flow of funds to meet the productive requirements of the economy.&lt;/p&gt; &lt;p&gt;The Monetary Policy Committee (MPC), he added, also noted that government security (G-sec) yields have continued to stabilise over the past eight months, broadly tracking global trends.&lt;/p&gt; &lt;p&gt; &lt;/p&gt;&lt;section&gt;&lt;div&gt;&lt;/div&gt;&lt;/section&gt;&lt;p&gt;&lt;/p&gt;&lt;/div&gt;</p><h3>Key Highlights</h3><ul></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>The issue has broader implications for governance and policy.</p><h3>Challenges</h3><p>Implementation challenges remain in addressing this issue.</p><h3>Way Forward</h3><p>A coordinated and policy-driven approach is required.</p><h3>Prelims Facts</h3><ul><li>Friday kept the policy repo rate unchanged</li><li>the six-member Monetary Policy Committee (MPC) concluded</li><li>central bank’s monetary policy for the full</li><li>after the Monetary Policy Committee (MPC) kept</li><li>help fine-tune future policy actions.&lt;/p&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;ev-engagement&gt;&lt;/ev-engagement&gt;&lt;div&gt;\n&lt;p&gt;The Governor also</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-3"
  },
  {
    "headline": "​Building bridges: On Central Bank Digital Currency and BRICS",
    "summaryText": "<h2>​Building bridges: On Central Bank Digital Currency and BRICS</h2><h3>Why in News</h3><p>&lt;div&gt;&lt;p&gt;The RBI’s reported moves towards encouraging India’s BRICS partners to link their digital currencies with the RBI’s own Central Bank Digital Currency (CBDC) are sensible but one that could pose some risks.</p><h3>Background</h3><p>According to news reports, the RBI has recommended to the Centre that a proposal connecting the CBDCs of the BRICS countries be made part of the agenda for the 2026 BRICS summit in India.</p><h3>Key Highlights</h3><ul><li>This is a natural progression of India’s push during its presidency of the G-20 in 2023 for international cooperation and standardisation on cryptocurrencies.</li><li>The RBI has historically been extremely conservative about private cryptocurrencies, repeatedly calling for a ban, and progressive about CBDCs, arguing that they have multiple uses.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>Its stance seems largely correct — it recognises the evident risks of cryptocurrencies as assets to invest in, but sees the advantages of the blockchain as the backbone of payments infrastructure.</p><h3>Challenges</h3><p>While a ban on private cryptocurrencies seems extreme, their widespread adoption does expose the public to extreme volatility, fraud potential, and an erosion of wealth.</p><h3>Way Forward</h3><p>CBDCs have the advantage of a sovereign guarantee and are also not interest-bearing.</p><h3>Prelims Facts</h3><ul><li>destination. A BRICS agreement on such a</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-2"
  },
  {
    "headline": "When Shanti means nuclear energy",
    "summaryText": "<h2>When Shanti means nuclear energy</h2><h3>Why in News</h3><p>&lt;div&gt;&lt;p&gt;Christmas came a bit early in New Delhi in December as the SHANTI Bill, 2025 was tabled in the Lok Sabha on December 15.</p><h3>Background</h3><p>SHANTI stands for Sustainable Harnessing and Advancement of Nuclear Energy for Transforming India, and the Bill, approved by the Lower House on December 17, made its way to the Rajya Sabha the following day for approval and received assent from President Droupadi Murmu on December 20.&lt;/p&gt;&lt;p&gt;The enactment of the SHANTI Act, 2025 is a watershed moment and turning point in India’s energy landscape.</p><h3>Key Highlights</h3><ul><li>The legislation represents the most comprehensive overhaul of India’s civil nuclear framework since Independence.&lt;/p&gt;&lt;p&gt;The Act repeals and replaces the Atomic Energy Act, 1962, and the Civil Liability for Nuclear Damage Act, 2010.</li><li>Most important, its framework will break new ground on modernising the sector, especially opening its once much-guarded doors to private and foreign participation in nuclear power, lowering the drawbridge into a castle of new economic opportunities.&lt;/p&gt;&lt;p&gt;The Act further leverages the epochal India-U.S.</li></ul><h3>Constitutional / Legal Provisions</h3><p>Relevant constitutional provisions, acts, or policy frameworks may apply depending on context.</p><h3>Significance</h3><p>To understand this agreement is to understand the magnitude and turning point of U.S.-India strategic partnership.</p><h3>Challenges</h3><p>The relationship between Washington and New Delhi has had many contours and chapters and ebbed and flowed from a period of estrangement in India’s post-Partition story to a period of engagement in its post-liberalisation era of 1991.&lt;/p&gt;&lt;p&gt;In 1998, after India conducted the nuclear tests in Pokhran, Washington imposed nuclear sanctions under the Glenn Amendment, thereby slashing aid and international loans along with stopping defence sales that severely impacted a newly liberalised post-socialist era economy.&lt;/p&gt;&lt;p&gt;Since the turn of the millennia, sentiments changed.</p><h3>Way Forward</h3><p>As sanctions eased by 2001, the relationship between the world’s oldest democracy and the world’s largest democracy was about to rapidly transform.</p><h3>Prelims Facts</h3><ul><li>as the SHANTI Bill, 2025 was tabled</li><li>India, and the Bill, approved by the</li><li>of the SHANTI Act, 2025 is a</li><li>framework since Independence.&lt;/p&gt;&lt;p&gt;The Act repeals and replaces</li><li>the Atomic Energy Act, 1962, and the</li></ul><h3>GS Paper Categorization</h3><p>Category determined based on syllabus relevance.</p>",
    "category": "GS-2"
  }
]