[
  {
    "headline": "INS Anjadip - built with indigenous SAIL steel to join Indian Navy fleet",
    "summaryText": "<p>INS Anjadip - built with indigenous SAIL steel to join Indian Navy fleet</p><p>Steel Authority of India Limited (SAIL), the largest steelmaking public sector unit and Maharatana company, has supplied the entire quantity of special steel for the INS Anjadip built by Garden Reach Shipbuilders & Engineers Ltd (GRSE). INS Anjadip is the third Anti-Submarine Warfare Shallow Water Craft (ASW-SWC) corvette to be commissioned into the Indian Navy, following the commissioning of INS Arnala and INS Androth last year.</p><p>The ASW-SWC corvettes are being built indigenously to replace the Navy’s aging Abhay-class vessels. Contributing to this strategic effort, SAIL has supplied the full quantity of approximately 3,500 tonnes of special-grade steel for the eight ASW-SWC corvettes being built by (GRSE). The steel was sourced from SAIL’s integrated plants at Bokaro, Bhilai and Rourkela, underscoring the strength of India’s domestic supply chain.</p><p>This milestone highlights SAIL’s commitment to advancing India’s self-reliance in defence manufacturing, reduce import dependence and reinforce the vision of Aatmanirbhar Bharat. . Over the years, SAIL has consistently met the nation’s requirement for special-grade steel in defence indigenization, supplying to landmark projects such as INS Vikrant, INS Udaygiri, INS Nilgiri, INS Surat among others.</p><p>Read this release in: हिन्दी</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/आईएनएसअंजदीपC4ZA.jpeg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233347&reg=3&lang=1"
  },
  {
    "headline": "4th Meeting of Joint Defence Cooperation Committee between India and Kenya Concluded",
    "summaryText": "<p>4th Meeting of Joint Defence Cooperation Committee between India and Kenya Concluded</p><p>The fourth meeting of the Joint Defence Cooperation Committee (JDCC) between India and Kenya was held in Nairobi, Kenyabetween 24th and 26th February 2026. Discussions focused on expanding Services engagements, enhancing training opportunities, strengthening maritime security cooperation, and promoting collaboration in defence R&D and production.</p><p>​Both countries expressed satisfaction on the progress made since the previous JDCC meeting and agreed to formulate a five year roadmap to further deepen and expand defence cooperation. Both sides agreed to broaden the scope of service-to-service engagements, including initiating structured interactions between their respective Navies.</p><p>​Both countries deliberated on cooperation in customized training programmes, instituting military exercises, border management, capacity building in advanced domains such as Electronic Warfare, Cyber Security, cooperation in military medical services, including training and knowledge exchange.</p><p>​The meeting was co-chaired by Shri Amitabh Prasad, Joint Secretary (IC) and Major General Fredrick L. Leuria, Assistant Chief of Defence Forces, Kenya. The Indian delegation included senior officers from Department of Defence, Services and DGAFMS. Ambassador of India in Kenya Dr. Adarsh Swaika and India’s Defence Attache in Kenya also joined the meeting.</p><p>​The Indian delegation called on Chief of Defence Forces General Charles Kahariri and Principal Secretary Defence Dr Patrick Mariru of Kenya and briefed them on the key outcomes of the 4th India-Kenya JDCC. The discussions focused on expanding and deepening India-Kenya defence cooperation.</p><p>​The Indian delegation interacted with Commandant NDC, Kenya Lt Gen Juma Shee Mwinyikai who briefed them on the role of NDC Kenya in preparing Kenyan Defence Forces and civilians to make strategic and important decisions in their future higher roles. Both sides discussed ways to further strengthen defence training cooperation between India and Kenya.</p><p>​The Indian delegation also called on Commander of Kenya Navy Maj Gen Paul Otieno at the Mtongwe Naval base. They discussed ways to further strengthen Naval cooperation through deeper engagement between the two Navies. As part of the visit, the delegation toured the CT Scan Radiology Centre at Mtongwe, gaining insights into ongoing initiatives in military medical infrastructure and healthcare support services, and Kenya Naval Training College at the naval base.</p><p>​Joint Secretary (IC) also paid homage at the Joint India-Africa Commemorative Memorial at Mile 27, Taita Taveta County, Kenya to honour the valour and the supreme sacrifice of the unknown Indian and African soldiers who laid down their lives during World War I in the East African theatre, reaffirming the shared respect for the sacrifices of Indian and African soldiers.</p><p>​India attaches great importance to its relationship with Kenya, which is anchored in historical links, shared democratic values and close people-to-people ties.</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233323&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister Condoles the Passing of Shri Maroof Raza Ji",
    "summaryText": "<p>Prime Minister Condoles the Passing of Shri Maroof Raza Ji</p><p>Prime Minister Narendra Modi has expressed grief over the passing of Shri Maroof Raza Ji, honoring his legacy in the fields of journalism.</p><p>The Prime Minister stated that Shri Maroof Raza Ji made a rich contribution to the world of journalism. He noted that Shri Raza enriched public discourse through his nuanced understanding of defence, national security, and strategic affairs.</p><p>Expressing his sorrow, the Prime Minister said he is pained by his passing and extended his condolences to his family and friends. The Prime Minister shared on X:</p><p>“Shri Maroof Raza Ji made a rich contribution to the world of journalism. He enriched public discourse with his nuanced understanding of defence, national security as well as strategic affairs. Pained by his passing. Condolences to his family and friends”</p><p>Shri Maroof Raza Ji made a rich contribution to the world of journalism. He enriched public discourse with his nuanced understanding of defence, national security as well as strategic affairs. Pained by his passing. Condolences to his family and friends.</p><p>Read this release in: Assamese , Gujarati</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233319&reg=3&lang=1"
  },
  {
    "headline": "PRESIDENT OF INDIA TO TAKE SORTIE IN INDIGENOUS LIGHT COMBAT HELICOPTER (PRACHAND) TOMORROW",
    "summaryText": "<p>PRESIDENT OF INDIA TO TAKE SORTIE IN INDIGENOUS LIGHT COMBAT HELICOPTER (PRACHAND) TOMORROW</p><p>The Hon'ble President of India, Smt Droupadi Murmuwill visit Jaisalmer, Rajasthan tomorrow (February 27, 2026) to witness Indian Air Force's Exercise Vayu Shakti. Prior to the exercise, Hon'ble President will fly a sortie in indigenous Light Combat Helicopter (LCH) at Jaisalmer. The mission will be undertaken as a two aircraft LCH formation, with Chief of the Air Staff, Air Chief Marshal AP Singh, flying in the second LCH.</p><p>Read this release in: Marathi</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233303&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister visits Yad Vashem – The World Holocaust Remembrance Centre",
    "summaryText": "<p>Prime Minister visits Yad Vashem – The World Holocaust Remembrance Centre</p><p>Prime Minister Shri Narendra Modi, accompanied by the Prime Minister of Israel, H.E Mr. Benjamín Netanyahu, visited Yad Vashem – The World Holocaust Remembrance Centre - in Jerusalem today, and paid tribute to the victims of the Holocaust. Prime Minister participated in a solemn ceremony at the Hall of Remembrance. The ceremony was marked by the poignant recital of the \"El Maleh Rahamim\" by the Cantor. Prime Minister also visited the Book of Names Hall which displays personal stories of the victims of the Holocaust. The visit underscores the deep emotional bond and shared commitment to human values between the people of India and Israel.</p><p>Read this release in: Marathi , हिन्दी , Assamese , Gujarati , Kannada</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233272&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister meets with the President of Israel",
    "summaryText": "<p>Prime Minister meets with the President of Israel</p><p>Prime Minister Shri Narendra Modi today called on the President of Israel, H.E. Mr. Isaac Herzog, in Jerusalem. Prime Minister warmly recalled his previous meetings with President Herzog during his visit to Israel in 2017 and in Dubai in 2023. The two leaders noted that the elevation of India-Israel ties to a \"Special Strategic Partnership for Peace, Innovation and Prosperity\" marks a new beginning in bilateral ties and is reflective of the deep trust, shared democratic values and special friendship between the two countries. The two leaders expressed satisfaction at the ongoing cooperation in the fields of trade and technology, innovation and enterprise, defence and security, and counter terrorism. The two leaders also discussed regional issues of mutual interest. Expressing support for the Gaza Peace Plan, Prime Minister conveyed his satisfaction at the progress being made with the initiative to achieve peace and stability in West Asia. In a special gesture, reflecting the shared values of both nations to nurture the environment, Prime Minister, along with President Herzog and the First Lady, planted a tree in the President’s garden under the Ek Ped Maa Ke Naam (One Tree for Mother) initiative. Prime Minister thanked President Herzog for his warmth and hospitality and for his support to the India-Israel partnership.</p><p>Read this release in: Marathi , हिन्दी , Assamese , Gujarati , Kannada</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233271&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister meets with Prime Minister of Israel",
    "summaryText": "<p>Prime Minister meets with Prime Minister of Israel</p><p>On his State Visit to Israel, Prime Minister Shri Narendra Modi held official talks with the Prime Minister of Israel, H.E. Mr. Benjamin Netanyahu, in Jerusalem on February 26, 2026. The two Prime Ministers engaged in comprehensive discussions covering the entire gamut of the India-Israel partnership. Reflecting the deep trust and friendship between the two countries, the leaders decided to elevate the bilateral relationship to a \"Special Strategic Partnership for Peace, Innovation and Prosperity\". This elevation is emblematic of the growing convergence of interests and the shared vision of both countries for a secure and prosperous future. Both leaders expressed satisfaction at the progress made in bilateral cooperation across all domains and agreed to further expand collaboration in the fields of trade and investment, defence and security, space, energy, critical technologies, cyber security, education, scientific research and innovation. They also emphasized the transformative potential of the India-Israel partnership in agriculture, water management, start-ups, fintech, digital healthcare, biotechnology and advanced pharma. The two leaders welcomed the new initiatives to expand mobility partnership, which would give a further boost to people-to-people ties. Calling for early conclusion of the proposed Free Trade Agreement, they noted that the Bilateral Investment Treaty, India-Israel Innovation Bridge, India-Israel Innovation Centre for Agriculture and India-Israel Industrial R&D and Innovation Fund would significantly enhance economic, entrepreneurial and scientific collaborations between the two countries. They also called for greater collaboration in the fields of AI, Semiconductors, Quantum and other cutting-edge technologies, synergising India’s talented workforce and Israel’s innovation. The two leaders also discussed regional and global issues of mutual interest. Prime Minister conveyed his support for the Gaza Peace Plan and hoped that the initiative would bring peace and stability to the region. The two leaders also called for closer cooperation between the two countries on IMEC and I2U2 initiatives. They also expressed their resolve to strengthen the global fight against terrorism. Prime Minister thanked Prime Minister Netanyahu for the support extended by Israel in India’s fight against terrorism. Following the talks, several agreements and Memoranda of Understanding were exchanged [Link]. A Joint Statement outlining the future course of action for the bilateral partnership was adopted on the occasion of the State Visit [Link]. Prime Minister thanked Prime Minister Netanyahu for his warmth and hospitality.</p><p>Read this release in: Marathi , हिन्दी , Gujarati</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233269&reg=3&lang=1"
  },
  {
    "headline": "NAMASTE Scheme Programme Held in Pilibhit in the Presence of Hon’ble MoS Shri B. L. Verma",
    "summaryText": "<p>Ministry of Social Justice & Empowerment</p><p>NAMASTE Scheme Programme Held in Pilibhit in the Presence of Hon’ble MoS Shri B. L. Verma</p><p>Under the National Action for Mechanized Sanitation Ecosystem (NAMASTE) Scheme of the Government of India, a programme was successfully organized on 26 February 2026 at Gandhi Prekshagrih, Gandhi Stadium, Near Jeevan Rekha, Nakhasa, Pilibhit (Uttar Pradesh). The programme was graced by the esteemed presence of Shri B. L. Verma, Hon’ble Minister of State for Social Justice & Empowerment and Consumer Affairs, Food & Public Distribution, Government of India.</p><p>Major Highlights of the Programme were:</p><p>Distribution of Personal Protective Equipment (PPE) kits to Sewer and Septic Tank Workers (SSWs) and waste pickers.</p><p>Distribution of Ayushman Cards to SSWs and waste pickers for health insurance coverage.</p><p>● Distribution of sewing machines to beneficiaries who completed skill development training to promote sustainable livelihoods.</p><p>During the programme, the Hon’ble Ministers emphasized the importance of dignity, safety, and social security of sanitation workers. They shared that under the NAMASTE Scheme, 89,248 sewer and septic tank workers have been verified so far, 87,037 workers have been provided with PPE kits, 74,647 workers have been covered under the Ayushman health insurance scheme. Additionally, 1,87,120 waste pickers have been profiled across the country.</p><p>In Pilibhit, a total of 92 SSWs and 452 waste pickers have been profiled. During the event PPE Kits were distributed to 452 beneficiaries, 30 beneficiaries were provided Ayushman Cards, 15 beneficiaries who underwent skill development training were distributed sewing machines.</p><p>The programme reaffirmed the Government’s commitment to the principle of “priority to the deprived”, ensuring that historically marginalized and overlooked communities receive the support they deserve. The initiative also reflects the broader vision of Viksit Bharat 2047, which envisions inclusive growth where every citizen has the opportunity to contribute to and benefit from India’s development journey.</p><p>The programme was also graced by Shri Gulab Singh, Chairperson, District Panchayat; Dr. Aastha Agrawal, Chairperson, Municipal Council; Shri Swami Prakatanand, Hon’ble MLA; Shri Baburam Paswan, Hon’ble MLA; Shri Vivek Kumar Verma, Hon’ble MLA; Dr. Sudhir Gupta, MLC; Shri Sanjeev P. Singh, BJP District President; Smt. Yogita Swaroop, Senior Economic Advisor, Ministry of Social Justice & Empowerment, Government of India; District Administration officials; and Shri Prabhat Kumar Singh, Managing Director, National Safai Karamcharis Finance and Development Corporation.</p><p>Read this release in: हिन्दी</p>",
    "category": "Health",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001634T.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002GFE1.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0037RIO.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0040TED.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005WHFS.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233255&reg=3&lang=1"
  },
  {
    "headline": "India Set to Become Global Maritime Powerhouse; Among Top Shipping Centres by 2047: MoS Shantanu Thakur",
    "summaryText": "<p>Ministry of Ports, Shipping and Waterways</p><p>India Set to Become Global Maritime Powerhouse; Among Top Shipping Centres by 2047: MoS Shantanu Thakur Ports Handle 95% of India’s Trade by Volume; Maritime Sector Key to Viksit Bharat Vision</p><p>Reinforcing the Government’s commitment to port-led development as a cornerstone of India’s export competitiveness and economic growth, the Ministry of Ports, Shipping and Waterways (MoPSW) is implementing major initiatives to modernise maritime infrastructure, strengthen multimodal connectivity and improve logistics efficiency across the country.</p><p>Addressing the CII EXIM Conference 2026 in Kolkata, the Hon’ble Minister of State for Ports, Shipping and Waterways, Shri Shantanu Thakur, highlighted the central role of the maritime sector in India’s global trade expansion and the vision to position India as a leading shipping hub by 2047.</p><p>Shri Shantanu Thakur said: “Nearly 95% of India’s trade by volume and around 70% by value is handled through our ports. This clearly shows that the maritime sector is not merely a transport channel — it is a strategic enabler of India’s global trade ambitions.”</p><p>Emphasising the progress achieved in the maritime sector over the past decade, the Minister noted that India’s port capacity has more than doubled, cargo handling efficiency has improved significantly, and turnaround time at major ports has reduced substantially, supported by mechanisation and digitalisation initiatives.</p><p>He added: “As India moves towards becoming a USD 5 trillion economy and realising the vision of Viksit Bharat 2047, export competitiveness will be one of the strongest pillars of our economic transformation.”</p><p>Shri Shantanu Thakur also highlighted the Government’s renewed focus on strengthening India’s shipbuilding ecosystem, noting that recent policy measures and budgetary support will help position India as a major global shipbuilding nation.</p><p>He said: “As you are aware, the Hon’ble Finance Minister in the recent Union Budget has emphasised the development of shipbuilding and support for the inland shipbuilding sector. India’s geographical position is highly significant for global trade as well as the global shipbuilding industry.”</p><p>Highlighting India's long-term potential in the sector, the Minister said that with sustained policy support and industry participation, India has the potential to emerge among the leading shipbuilding nations globally.“With the right momentum and support to shipbuilding, we can achieve our targets and reach among the top shipbuilding nations in the world.”</p><p>Shri Thakur emphasised the importance of industry partnership in strengthening the maritime ecosystem and advancing India’s global competitiveness. “With your efforts and support, we will move India forward and bring our maritime sector to the forefront. Under the leadership of Hon’ble Prime Minister Shri Narendra Modi ji, this initiative began in 2014, and we are committed to building a globally competitive maritime sector in the years ahead.”</p><p>The conference brought together policymakers, industry leaders and international partners to deliberate on strengthening India's export ecosystem through improved trade infrastructure and logistics efficiency.</p><p>The inaugural session was attended by Mr Aung Myo Thein, Consul General of Myanmar; Mr Shashwat Goenka, Chairman, CII Eastern Region; and Mr Sandeep Kumar, Chairman, CII ER International Trade Subcommittee, along with senior industry representatives.</p>",
    "category": "Infrastructure",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001YP2K.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002ZZ4U.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003VBW6.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004RWRE.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005MN5C.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233239&reg=3&lang=1"
  },
  {
    "headline": "PM to address Post Budget Webinar on “Technology, Reforms and Finance for Viksit Bharat” on 27th February",
    "summaryText": "<p>PM to address Post Budget Webinar on “Technology, Reforms and Finance for Viksit Bharat” on 27th February It is the first in a series of Post Budget Webinars being organised on key themes emerging from the Union Budget</p><p>Prime Minister Shri Narendra Modi will address the Post Budget Webinar on “Technology, Reforms and Finance for Viksit Bharat” on 27th February at around 11:30 AM via video conferencing. The webinar will entail discussions on public capex, infrastructure, banking sector reforms, financial sector architecture, deepening capital markets, and ease of living through tax reforms.</p><p>The webinar is the first in a series of Post Budget Webinars being organised on key themes emerging from the Union Budget 2026–27. These webinars aim to draw lessons from past experiences and obtain structured feedback from participants to strengthen and ensure outcome-oriented implementation of the Budget announcements for FY 2026-27, drawing upon the practical experience and insights of diverse stakeholders. They will bring together stakeholders from industry, financial institutions, market participants, Government, industry regulators and academia to deliberate on effective implementation pathways for key Budget announcements.</p><p>Read this release in: Telugu , Malayalam , Assamese , Marathi , हिन्दी , Gujarati</p>",
    "category": "Economy",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233236&reg=3&lang=1"
  },
  {
    "headline": "ECI reviews poll preparedness for forthcoming Assembly Elections in Tamil Nadu",
    "summaryText": "<p>ECI reviews poll preparedness for forthcoming Assembly Elections in Tamil Nadu</p><p>Chief Election Commissioner (CEC) Shri Gyanesh Kumar along with Election Commissioners Dr. Sukhbir Singh Sandhu and Dr. Vivek Joshi held a detailed and a comprehensive review of the poll preparedness for the forthcoming Tamil Nadu Legislative Assembly Elections in Chennai today.</p><p>During the review visit, the Commission interacted with the representatives of recognized national and state political parties namely Aam Aadmi Party, Bahujan Samaj Party, Bharatiya Janata Party, Communist Party of India (Marxist), Indian National Congress, National People’s Party, All India Anna Dravida Munnetra Kazhagam, Desiya Murpokku Dravida Kazhagam, Dravida Munnetra Kazhagam, Naam Tamilar Katchi and Viduthalai Chiruthaigal Katchi and sought their suggestions.</p><p>Most of the political parties appreciated the Election Commission of India for the peaceful and smooth conduct of the Special Intensive Revision of the Electoral Rolls in Tamil Nadu.</p><p>Political parties urged the Commission to take stringent measures to curb the use of money power and distribution of freebies during elections. Some political parties asked for an increase in the number of flying squads to curb malpractices during elections.</p><p>Some of the political parties urged the Commission to keep in mind the upcoming festivals while finalising the dates of elections.</p><p>Assuring the political parties that their suggestions will be considered, CEC Shri Gyanesh Kumar assured all the political parties that elections are always held as per law in a free, fair and a transparent manner.</p><p>Following the interaction with the Political Parties, the Commission held a detailed review with the Heads/Nodal Officers of Enforcement Agencies, IGs, DIGs, DEOs, SPs on every aspect of election planning, EVM management, logistics, training of election staff, seizures, law and order, voter awareness and outreach activities.</p><p>The Commission directed all Heads/Nodal Officers of Enforcement Agencies to act with complete impartiality and firmly clamp down on all inducement related activities.</p><p>The Commission also directed all DEOs, SPs, to prioritise voters’ comfort and accessibility at polling stations, and impart robust training to officials and ensure wide awareness about electoral processes.</p><p>The Commission also directed the officers to ensure absolute impartiality and act without fear or favour and underscored that there will be zero-tolerance towards any deviation from the laws, rules and related elections with respect to the conduct of elections.</p><p>Read this release in: हिन्दी</p>",
    "category": "Infrastructure",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233237&reg=3&lang=1"
  },
  {
    "headline": "Centre Approves ₹797 Crore Green Hydrogen Jetty at Paradip Port",
    "summaryText": "<p>Ministry of Ports, Shipping and Waterways</p><p>Centre Approves ₹797 Crore Green Hydrogen Jetty at Paradip Port Union Minister Sarbananda Sonowal Credits PM Narendra Modi’s Leadership in Advancing Clean Energy InfrastructureParadip Port to Anchor National Green Hydrogen Mission With 4 MTPA Dedicated Jetty Project</p><p>New Delhi, Feb. 25, 2026: The Ministry of Ports, Shipping & Waterways (MoPSW) has approved the development of a dedicated jetty with allied facilities for handling green hydrogen, ammonia and other liquid cargo at Paradip Port at an estimated cost of ₹797.17 crores. The project will be implemented by Paradip Port Authority on a build-operate-transfer (BOT) basis.</p><p>The proposed facility will have a handling capacity of 4.0 million tonnes per annum and is designed to strengthen Paradip Port’s role as a hub for green energy cargo. The infrastructure will include a dedicated jetty, storage systems, pipelines, handling equipment and associated facilities.</p><p>Union Minister of Ports, Shipping and Waterways Sarbananda Sonowal said the approval reflects the Centre’s commitment to building future-ready green infrastructure under the leadership of Prime Minister Narendra Modi.</p><p>“This approval is a direct outcome of Prime Minister Narendra Modi ji’s inspiring and decisive leadership in positioning India as a global leader in clean energy. Under his guidance, our ports are being transformed into gateways for green growth, innovation and sustainable logistics,” Sarbananda Sonowal said.</p><p>The jetty will have a centre-to-centre distance of 279 meters between extreme end dolphins and a dredged depth of 14.3 meters in front of the berth to enable safe handling of liquid cargo vessels.</p><p>Paradip Port Authority will provide capital support equivalent to 20% of the project cost, amounting to ₹159.43 crore, during the construction phase. The project is expected to be completed within 24 months.</p><p>Union Minister Sarbananda Sonowal said the dedicated green hydrogen jetty will play a critical role in strengthening export logistics and integrating Odisha’s emerging green hydrogen production clusters with global markets.</p><p>“Guided by Prime Minister Modi ji’s vision of an Atmanirbhar and environmentally responsible India, we are building world-class port infrastructure that supports the National Green Hydrogen Mission. The Paradip project will not only enhance cargo capacity but also catalyse investment, generate employment and create a robust green energy ecosystem in eastern India,” Sonowal added.</p><p>The facility will also include provisions for handling other liquid cargo to ensure optimal utilisation during the initial growth phase of the green hydrogen sector and to diversify Paradip Port’s cargo profile.</p><p>Officials said the project is aligned with the objectives of the National Green Hydrogen Mission and is expected to support investments in green energy infrastructure in Odisha while strengthening port-based logistics for clean energy commodities.</p><p>The proposed jetty will incorporate specialised infrastructure and advanced safety systems for handling and storing green energy derivatives and other liquid cargo, supporting the development of an integrated green hydrogen ecosystem around Paradip Port.</p><p>Read this release in: Odia</p>",
    "category": "Infrastructure",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0017W7D.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002462W.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233235&reg=3&lang=1"
  },
  {
    "headline": "India - Israel Joint Statement",
    "summaryText": "<p>India - Israel Joint Statement</p><p>A Special Strategic Partnership for Peace, Innovation, and Prosperity Recognising the warmth, goodwill, and deep strategic partnership between India and Israel, the Prime Minister Shri Narendra Modi made a state visit to Israel from 25 to 26 February 2026 on the invitation of Mr. Benjamin Netanyahu, Prime Minster of the State of Israel. The Prime Minister was accompanied by a high-level delegation comprised of senior ministers and officials. Recalling Indian Prime Minister Narendra Modi's historic visit to Israel in 2017 and Prime Minister Netanyahu’s visit to India in 2018, which together laid the foundation for a new era of partnership and collaboration, the leaders noted the immense progress made in the India-Israel bilateral relationship across diverse domains, including emerging technologies, cyber, agriculture, water management, health, entrepreneurship, defence, security, and more. Prime Minister Netanyahu and Prime Minister Modi agreed and decided to elevate the Strategic Partnership to a new level – ‘A Special Strategic Partnership for Peace, Innovation & Prosperity.’ Together into the future The Prime Ministers reaffirmed their shared vision for a robust special strategic partnership rooted in mutual aspirations for peace, security and prosperity through technological innovations and entrepreneurship. The leaders acknowledged that Indian and Israeli capabilities complement each other perfectly - Israel is a global powerhouse of technology and innovation, India serves as a hub of talent, manufacturing excellence and entrepreneurial energy. The Prime Ministers affirmed their commitment to integrating India's and Israel's advancements in AI, cybersecurity, semiconductors, quantum computing, biotechnology, agriculture and water management, defence platforms, and space exploration. This partnership strengthens India’s vision of an ‘Atmanirbhar and Viksit Bharat 2047’, aims to spark the next wave of technological transformation and shared progress of both countries. Underscoring the shared commitment to transform policy priorities into tangible outcomes, the Prime Ministers emphasised the importance of institutionalising bilateral mechanisms across Government-to-Government, Business-to-Business, and People-to-People domains to ensure sustained collaboration and meaningful impact. Defence and Security Welcoming the Memorandum of Understanding on Defence Cooperation signed on 4th November 2025, Prime Minister Netanyahu and Prime Minister Modi acknowledged the significant growth made in defence cooperation between their nations, both in scope and scale. Both leaders provided a vision and a roadmap for future defence cooperation. Technology and Innovation Acknowledging the complementary strengths of India's and Israel's technological prowess that create avenues for deeper collaboration in Critical and Emerging Technology (CET) sectors, Prime Minister Netanyahu and Prime Minister Modi welcomed the new initiative on Critical and Emerging Technologies led by the National Security Advisors of the two countries. They emphasised that this initiative would synergise the individual strengths of both countries in niche technologies, fostering a focused and futuristic partnership. The leaders called on both sides to take forward the initiative. The Prime Ministers reviewed the functioning of the India-Israel Industrial R&D and Innovation Fund (I4F), jointly implemented by the Department of Science and Technology of India and the Israel Innovation Authority, and reaffirmed its important role in advancing industrial collaboration between the two countries. They agreed to further strengthen the operational implementation of the I4F mechanism, including enhanced outreach to industry and facilitation of high-quality joint R&D partnerships, in order to fully realize the Fund’s potential and expand impactful cooperation between Indian and Israeli enterprises. Acknowledging the success of the India-Israel Joint Research Calls (IIJRC), implemented by Department of Science and Technology (DST), India, and Ministry of Innovation, Science and Technology (MOST), Israel, the Prime Ministers agreed to increase the contribution of both sides— from the current USD 1 million to USD 1.5 million each. This will promote joint research between Indian and Israeli universities through joint use of research facilities, materials, and equipment, and will also provide for exchange visits of the collaborating scientists. Both sides agreed to mandate the Joint Scientific Committee to coordinate and advance the Joint Research Call. The leaders also welcomed the elevation of the Joint Commission on Science and Technology to the Ministerial level and both sides agreed to hold the JCM on Science and Technology at Ministerial level at the earliest possible occasion in India or in Israel. The Prime Ministers recognized the importance of strengthening academia–industry linkages as a key driver of innovation and agreed to promote structured networking and collaboration between researchers, industry leaders and technology experts from both countries, with a view to advancing joint research, technology development and commercial partnerships. The Prime Ministers recognized the importance of creating institutional support to advance joint innovation activities between the two countries. In this context, they agreed to explore the development of Tech Gateway mechanisms to facilitate collaborative R&D initiatives, technology validation processes, pilot projects and joint development activities between Indian and Israeli innovation ecosystems. The Prime Ministers recognized the strategic importance of Artificial Intelligence as a key driver of innovation and agreed to deepen cooperation in AI talent and expertise. They welcomed efforts to develop enabling frameworks that strengthen linkages between AI professionals, research institutions and innovative enterprises, including by facilitating professional collaboration and participation in leading innovation activities in both countries. Recognising the advances made by Israel and India in artificial intelligence, both leaders welcomed the signing of the MoU on Cooperation in Artificial Intelligence (AI) and agreed to deepen collaboration in this frontier technology for the welfare of their peoples. The Prime Ministers welcomed the ongoing collaboration between the Israel Space Agency (ISA) and the Indian Space Research Organisation (ISRO), recognising the significant potential for Israeli space-based start-ups and companies to engage more deeply with their Indian counterparts. They emphasised the importance of fostering greater cooperation between the two nations' space industries, encouraging joint ventures, innovation partnerships, and knowledge exchange to drive progress in the global space sector. Both leaders welcomed the signing of the Declaration of Intent for cooperation in establishing a ‘Horizon Scanning/Strategic Foresight Mechanism’. This mechanism helps identify emerging global trends in areas like technology, economy and society, by leveraging data, AI and expert insights to support strategic planning and decision making. Cybersecurity The Prime Ministers reaffirmed their commitment to enhancing cybersecurity in both governmental and private sectors. They emphasized the need for robust dialogue between their national cyber authorities and pledged to deepen cooperation in this field. In addition, they committed to developing a multi-year strategic program to guide bilateral collaboration in cybersecurity and advance a joint roadmap for implementation. The roadmap will include, among other elements, human capacity building, cybersecurity and AI, applied research, the integration of Security by Design principles and regular joint table top exercises. Recognising the importance of strengthening and institutionalising their comprehensive cyber cooperation, they welcomed the successful convening of the inaugural India-Israel Cyber Policy Dialogue in March 2025. In a significant step forward, both leaders welcomed the signing of Letter of Intent for the establishment of an India-Israel Centre of Excellence in Cybersecurity in India to foster the activities outlined above. Trade, Investment, and Connectivity Prime Minister Modi and Prime Minister Netanyahu emphasised the importance of unlocking the full potential of bilateral trade and investment. They welcomed the signing of the India-Israel Bilateral Investment Agreement by the two Finance Ministers in New Delhi in September 2025, which is expected to enhance investor confidence, promote greater two-way investments, and ensure transparency, predictability, and protection through a clear framework of treatment of investment and independent dispute resolution mechanism. Both leaders welcomed the signing of the Terms of Reference (ToR) for the Free Trade Area (FTA) Agreement negotiations and the convening of the first negotiating round in New Delhi. The leaders assert their commitment for the realization of the FTA Agreement between the two countries and tasked the negotiating teams to expedite the negotiations for an early signing of an FTA. Both Leaders emphasized that a resilient financial ecosystem is a fundamental pillar of economic stability. They welcomed the strategic partnership in the financial-cyber domain. This collaboration will focus on enhancing the resilience of the financial ecosystem through the exchange of financial- cyber intelligence, joint development of methodologies, and the performance of multilateral financial-cyber simulations operationalised through Financial Computer Security Incident Response Teams of both countries. Prime Minister Netanyahu appreciated India’s fintech revolution, exemplified by the Unified Payments Interface (UPI), which is a world-class model for affordable, real-time cross-border transactions. Both sides agreed to explore linking UPI with Israel’s fast payment system to enhance interoperability and strengthen economic ties. Both leaders welcomed the signing of an MoU between NPCI International and MASAV for cooperation in order to examine linkages between NPCI and MASAV for cross-border payments between the countries. The leaders noted that direct air connectivity is a basic building block that is essential for scaling the bilateral relationship to new heights. In this regard, they expressed their desire to expand direct air connectivity between Tel Aviv and major Indian cities and encouraged both Indian and Israeli airlines to take up the opportunity to start direct flight operations between the two countries. The leaders welcomed the launch of the India–Israel Financial Dialogue to boost closer financial cooperation. Both leaders encouraged more Indian participation in the infrastructure sector of Israel, particularly in light of major upcoming projects in Israel in the sectors of metro, rail, road, airports, desalination plants, waste-water treatment plants, etc. The two leaders welcomed the successful conclusion of the 4th round of India-Israel CEOs Forum and Business Summit in Tel Aviv in November 2025. They commended the meaningful engagement between business and government leaders, which contributed to strengthening bilateral economic cooperation and unlocking new opportunities for investment and collaboration across key sectors. Both leaders reaffirmed their commitment to building on this positive momentum to further deepen the India-Israel strategic partnership. They also welcomed the signing of the MoU on Arbitration between Indian Council of Arbitration (ICA) and Israeli Institute of Commercial Arbitration (IICA) recognising it as a significant step toward facilitating smoother commercial dispute resolution and enhancing investor confidence. Agriculture, Water and Environmental Protection Recognizing the critical role of water and agriculture in sustainable development, Prime Minister Modi and Prime Minister Netanyahu affirmed the importance of efforts to strengthen the partnership in water and agriculture. The partnership focusses on key areas of water conservation, wastewater treatment and its reuse for agriculture, desalination, water utility reforms, and the cleaning of the Ganges and other rivers using advanced water technologies. The Prime Ministers also agreed to strengthen the ongoing capacity building program in agriculture in Israel, led by MASHAV in collaboration with the Ministry of Agriculture of India. This multifaceted program benefits hundreds of thousands of Indian farmers, through trainings, introduction of unique and innovative techniques and knowledge transfer. The Prime Ministers apprised the progress of the 35 centres of excellence in agriculture already operating and the 8 that are being jointly operationalised in various locations across India. Both leaders noted with satisfaction that more than a million Indian farmers have been trained at these centres of excellence so far. The Prime Ministers welcomed the signing of the MOU between ICAR and MASHAV regarding the India – Israel Innovation Centre for Agriculture (IINCA) –This initiative will drive innovation and research, enhance productivity, and promote sustainable growth in agriculture. Both leaders also welcomed the launch of 20 Joint Fellowships for Agricultural Research by Indian researchers at the Volcani Agriculture Research Organization. Both leaders welcomed the signing of the Declaration of Intent on cooperation in fisheries and aquaculture in January 2026 and agreed to strengthen cooperation in this area including through setting up of a Joint Centre of Excellence in Fisheries and Aquaculture. The Prime Ministers underlined the importance of cooperation in the field of environment and climate change and agreed to have bilateral consultations to strengthen collaboration among stakeholders on climate action, including capacity building and examining possibilities for technology transfer as well as jointly promoting a circular economy, protection of biodiversity and prevention of environmental pollution. Combating Terror, Promoting Peace The leaders unequivocally and strongly condemned terrorism, in all its forms and manifestations including cross-border terrorism. They called for decisive and concerted international efforts to combat terrorism in a comprehensive and sustained manner. Expressing the grave concern over this common challenge, the Prime Ministers reaffirmed their collective resolve to combat this menace as the leaders of two vibrant and resilient democracies. They strongly condemned the heinous October 7, 2023 terror attack on Israel, the savage terror attack on Indian tourists at Pahalgam in Jammu & Kashmir in India on April 22, 2025 and the terror incident near Red Fort, New Delhi on November 10, 2025. Prime Minister Modi and Prime Minister Netanyahu reiterated their unwavering commitment to advancing global peace and security and welcomed US President Donald Trump’s \"Comprehensive Plan to End the Gaza Conflict.” The two leaders discussed the regional developments, including the peace process, and underlined the need for the establishment of a just and durable peace, security and freedom of navigation and trade in the region through dialogue and mutual understanding. Parliamentary Cooperation In view of the excellent parliamentary cooperation between the two vibrant democracies of India and Israel, and following the Memorandum of Understanding signed by the Speaker of the Lok Sabha and the Speaker of the Knesset, the leaders also welcomed the establishment of the India-Israel Parliamentary Friendship Group in the Parliament of India. People to People Cooperation The Prime Ministers emphasized that true friendship between nations leads to a connection between people that is strengthened through culture and sport. The Ministry of Culture and Sports of the State of Israel will work to deepen cooperation with the Republic of India in the field of cinema. This will include exchanges between creators, joint productions of films and series, and platforms that strengthen ties between the industries and audiences in both countries, while showcasing the unique cultures of each nation. Prime Minister Modi and Prime Minister Netanyahu acknowledged the contributions of Indian workers in Israel, who strengthen the bonds of friendship through their work. They acknowledged the importance of the Framework Agreement and Implementation Protocols, signed in November 2023, in facilitating the safe and secure mobility of Indian workers in the construction and caregiver sectors. In this regard, both leaders also welcomed the signing of the Protocols concerning the Commerce & Services, Manufacturing and Restaurant sectors. The Prime Ministers emphasized the need to ensure the safety, security, and legal rights of workers. They also emphasised the importance of expanding opportunities for Indian professionals in high-skill sectors such as data science, AI, and hi-tech. Both leaders agreed that up to 50,000 additional Indian workers may arrive in Israel within the next five years. The two leaders reviewed the work of the Joint Coordination Committee (JCC) and tasked the JCC to meet frequently to discuss outstanding issues related to workers and to resolve them at the earliest. Health The Prime Ministers called upon both sides to hold the first JWG on Health in early 2026. Both leaders agreed to collaborate on healthcare innovation, AI and digital transformation through sharing of best practices and cooperation between institutions of the countries. Education - Securing the Future Prime Minister Modi and Prime Minister Netanyahu agreed that, as knowledge-driven economies, India and Israel need to further deepen their collaborative endeavours in the field of education and promote cooperation through joint initiatives between universities, student and faculty exchanges, and the facilitation of student internships at each other's universities. Both leaders welcomed the signing of the MoU between Nalanda University and the Hebrew University of Jerusalem. They also welcomed the signing of MoU on Cooperation in advancing education through the use of Artificial Intelligence (AI). Prime Minister Modi apprised Prime Minister Netanyahu of the National Education Policy 2020, which aims to create an educational system rooted in Indian ethos as well as aligned with the 2030 Agenda for Sustainable Development. India and Israel agree to establish the India-Israel Academic Cooperation Forum (the I2I Forum) – a university-led platform for high-level, focused dialogue of academic and research institutions, policymakers, Higher Education experts, and other relevant stakeholders of India and Israel. The Forum will convene annually on rotation between India and Israel. Transforming the landscape of new global trade In an era of global uncertainties, Prime Minister Modi and Prime Minister Netanyahu reaffirmed their commitment to advancing transformative initiatives such as the I2U2 quadrilateral partnership. This framework serves as a vital instrument for fostering deeper engagement, trade, investment, innovation and leveraging the complementary strengths of both nations. The leaders discussed the India-Middle East-Europe Economic Corridor (IMEC) and expressed their intent to advance cooperation to promote regional connectivity, stability and shared prosperity through the initiative and explore Israel's role within its frameworks. Recognizing the strategic partnership and advocating the need to comprehensively enhance bilateral relations, the Prime Ministers welcomed the signing of the following new agreements: 1) MoU on cooperation in Artificial Intelligence (AI). 2) Letter of Intent on establishment of Indo Israel Cyber Centre of Excellence in India. 3) Memorandum of Understanding between the Minister of Education of Republic of India and Minister of Education of the State of Israel on the Cooperation on Advancing Education through the use of Artificial Intelligence (AI). 4) Cultural Exchange Programme between the Government of the Republic of India and the Government of the State of Israel for the Years 2026-2029. 5) Memorandum of Understanding between the Indian Council of Agricultural Research, New Delhi, Republic of India and MASHAV- Israel’s Agency for International Development Cooperation, the State of Israel on establishment of the India-Israel Innovation Centre for Agriculture (IINCA) for Cooperation in Agricultural Research and Education. 6) Memorandum of Understanding between the Ministry of Mines of the Government of the Republic of India and the Ministry of Energy and Infrastructure of the Government of the State of Israel on co-operation in the field of Geophysical Exploration. 7) Memorandum of Understanding between Ministry of Ports, Shipping and Waterways, of the Republic of India and Israel Antiquities Authority- Underwater Archaeology Unit for development of National Maritime Heritage Complex (NMHC), Lothal at Gujarat. 8) Declaration of Intent between the Ministry of Innovation, Science and Technology of the State of Israel and Office of the Principal Scientific Adviser, Republic of India on cooperation in the field of Horizon Scanning. 9) Memorandum of Understanding between the Department of Fisheries, Ministry of Fisheries, Animal Husbandry and Dairying, Government of the Republic of India and the Department of Fisheries and Aquaculture, Ministry of Agriculture and Food Security of the State of Israel on Cooperation in the field of Fisheries and Aquaculture. 10) Presentation of Report of the 4th India Israel CEO Forum. 11) Implementation Protocol C to the Agreement between the Government of the State of Israel and the Government of the Republic of India on Facilitation of the Temporary Employment of Indian Workers in Specific Labor Market Sectors in the State of Israel in Commerce and Services Sector. 12) Implementation Protocol E to the Agreement between the Government of the State of Israel and the Government of the Republic of India on Facilitation of the Temporary Employment of Indian Workers in Specific Labor Market Sectors in the State of Israel in Manufacturing Sector. 13) Implementation Protocol D to the Agreement between the Government of the State of Israel and the Government of the Republic of India on Facilitation of the Temporary Employment of Indian Workers in Specific Labor Market Sectors in the State of Israel in Restaurant Sector. 14) MOU between NPCI International Payments Limited and MASAV for linking payment systems of India and Israel (Linking of UPI with Israeli Payment system). 15) Agreement on Cooperation between Israeli Institute of Commercial Arbitration (IICA) and Indian Council of Arbitration (ICA). 16) Memorandum of Understanding between the International Financial Services Centres Authority (IFSCA) And Israel Securities Authority (ISA) in relation to mutual cooperation. Prime Minister Netanyahu and Prime Minister Modi reaffirmed their commitment to maintaining high-level engagement between the governments, industries, and peoples of both nations, with a shared vision of building an enduring India–Israel partnership that harnesses the ambitions of our knowledge-driven economies to forge a future defined by creativity, technology, collaboration, and shared success.</p><p>Read this release in: Urdu , हिन्दी , Gujarati , Odia , Kannada</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233228&reg=3&lang=1"
  },
  {
    "headline": "CDS inaugurates two-day CBRN Conclave organised by DRDO in New Delhi",
    "summaryText": "<p>CDS inaugurates two-day CBRN Conclave organised by DRDO in New Delhi</p><p>Defence Research and Development Organisation (DRDO) is organising Chemical, Biological, Radiological and Nuclear (CBRN) Conclave at Manekshaw Centre, New Delhi on February 26 & 27, 2026. The conference, with the theme ‘From policy to practice: Building CBRN resilient India’, was inaugurated by Chief of Defence Staff General Anil Chauhan. It brings together various experts and policymakers from the Armed Forces, CAPFs, and NDRF etc. with the aim to strengthen India’s response against CBRN threats.</p><p>In his address, the Chief of Defence Staff commended the work done by DRDO towards achieving self-reliance in CBRN defence technologies. Quoting Prime Minister Shri Narendra Modi, he stated that India will not be deterred by nuclear blackmail, emphasising that “CBRN needs to be considered as more of an environment than a threat, and we should brace ourselves to learn to live and operate in contaminated environments.” He underlined the need to stay ready with indigenous, state-of-the-art CBRN defence equipment for early warning systems, light weight Individual Protective Equipment & gadgets, well researched SOPs, and protocols to carry out coordinated operations in synergy with military and civilian establishment.</p><p>Secretary, Department of Defence R&D and Chairman DRDO Dr Samir V Kamat voiced the DRDO’s commitment to build CBRN resilient India through its specialised labs and centres which dedicatedly work on developing advanced technology for defence against CBRN threats. He urged the participants of the conference to utilise this as an opportunity for peer learning and contribute to advance research endeavours to build a resilient India.</p><p>Guest of Honour of the event, DG Armed Forces Medical Services (AFMS) Surgeon Vice Admiral Arti Sarin congratulated DRDO for timely organising this conclave and said that this will not only help in reflecting on the outstanding work done by its Scientists & Engineers but also bring in the users’ perspective for making a robust plan for futuristic technology development. She commended Vikiran Prehri program, a joint initiative of DRDO and AFMS for training the medical doctors of AFMS & CAPFs and said that the program has resulted in capacity building in the country for availability of trained manpower in medical management of radiological events.</p><p>DG (Soldier Support System) Dr UK Singh spelt out the broad contours of the conclave and modalities of engagement. He urged all the stakeholders to utilise this platform as an opportunity to come up with varied scenarios and the criticality in their operations and prepare a comprehensive plan, which will work as a guiding document for development of products/technologies with a speed of relevance to tackle any CBRN threat whatsoever.</p><p>The two-day event focuses on enhancing national resilience by incorporation of stakeholder’s perspectives in training and infusion of technologies. This will enhance the preparedness of security agencies in coordinated response for handling any CBRN event. The conclave underlined DRDO’s commitment in building a robust national network centric command and control framework utilising state-of-the-art sensors and Artificial Intelligence/Machine Learning tech for CBRN security & defence of the nation.</p><p>Read this release in: Urdu , हिन्दी , Tamil</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0014SNO.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image00248SX.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233229&reg=3&lang=1"
  },
  {
    "headline": "List of Outcomes: Visit of Prime Minister to Israel",
    "summaryText": "<p>List of Outcomes: Visit of Prime Minister to Israel</p><p>ANNOUNCEMENTS 1. Elevation of relationship to Special Strategic Partnership 2. JCM on Science and Technology elevated to Ministerial level 3. Initiative to collaborate in Critical and Emerging Technologies led by National Security Advisors 4. Financial Dialogue 5. Tech-Gateway Initiative 6. 20 Joint Fellowships in Agricultural Research 7. Increase of contribution of both sides for the Joint Research Calls 8. Quota of up to 50,000 Indian workers over the next 5 years. 9. India-Israel Academic Cooperation Forum 10. India- Israel Parliamentary Friendship Group</p><p>Read this release in: Urdu , हिन्दी , Marathi , Tamil , Kannada , Malayalam</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233226&reg=3&lang=1"
  },
  {
    "headline": "MoRTH Sensitizes Stakeholders on “PM RAHAT” – Cashless Treatment of Road Accident Victims",
    "summaryText": "<p>Ministry of Road Transport & Highways</p><p>MoRTH Sensitizes Stakeholders on “PM RAHAT” – Cashless Treatment of Road Accident Victims</p><p>Ministry of Road Transport and Highways (MoRTH) conducted a high-level meeting in hybrid mode under the Chairmanship of Hon’ble Minister Shri Nitin Jairam Gadkari and Hon’ble Ministers of State Shri Ajay Tamta & Shri Harsh Malhotra to assess the status of actions being undertaken for the seamless nationwide implementation of the PM RAHAT (Road Accident Victims’ Hospitalization and Assured Treatment) Scheme, launched by the Hon’ble Prime Minister on 13.02.2026. The meeting aimed at reviewing overall readiness and coordination across concerned stakeholders, including integration for emergency response, platform onboarding and system preparedness, expansion and preparedness of the designated hospital network, and the governance and grievance redressal framework to ensure effective and timely cashless treatment to road accident victims.</p><p>India records a significant number of road accident fatalities every year, many of which are preventable with timely medical intervention. Studies indicate that nearly 50% of road accident deaths can be averted if victims are admitted to hospital within the first hour.</p><p>Integration with the Emergency Response Support System (ERSS) 112 helpline ensures that accident victims reach hospitals within the Golden Hour. Road accident victims, Rah-Veer (Good Samaritans), or any person at the accident site may dial 112 to obtain details of the nearest designated hospital and request ambulance assistance, enabling swift coordination between emergency responders, police authorities and hospitals.</p><p>Under the Scheme, every eligible road accident victim on any category of road will be entitled to cashless treatment up to ₹1.5 lakh per victim, for period of 7 days from the date of accident. Stabilization treatment will be provided for up to 24 hours in non-life-threatening cases and up to 48 hours in life-threatening cases, subject to police authentication on an integrated digital system.</p><p>PM RAHAT is implemented through a robust, technology-driven framework amalgamating the Electronic Detailed Accident Report (eDAR) platform of the Ministry of Road Transport and Highways with the Transaction Management System (TMS 2.0) of the National Health Authority. This integration enables seamless digital linkage from accident reporting to hospital admission, police authentication, treatment administration, claim processing, and final payment. Police confirmation is required within defined timelines – 24 hours for non-life-threatening cases and 48 hours for life-threatening cases – ensuring accountability while allowing uninterrupted emergency care.</p><p>Reimbursement to hospitals will be made through the Motor Vehicle Accident Fund (MVAF). In cases where the offending vehicle is insured, payment will be drawn from contributions made by General Insurance Companies. In uninsured and Hit & Run cases, payment will be made through budgetary allocation by Government of India. Claims approved by the State Health Agency will be paid within 10 days, thereby providing financial certainty to hospitals and encouraging uninterrupted treatment.</p><p>Grievances of road accident victims will be addressed by a Grievance Redressal Officer nominated by the District Road Safety Committee chaired by the District Collector / District Magistrate / Deputy Commissioner, ensuring accountability at the district level.</p><p>The meeting witnessed active and constructive participation from Hon’ble Ministers of Transport and Health from various States/UTs, Transport and Health Secretaries, DGPs from States / UTs, along with senior officials from MoRTH, MHA, MoHFW, DFS, NHA, NIC, PFMS, State Health Agencies, and other key stakeholders. States shared encouraging progress on implementation readiness, including onboarding on TMS 2.0, creation of PFMS credentials by District Collectors and other important parameters for scheme implementation readiness. The collective commitment demonstrated during the deliberations reflects “whole of Government approach” and readiness to operationalize the PM RAHAT scheme effectively across the country, ensuring timely cashless treatment support to road accident victims.</p><p>Read this release in: Urdu , हिन्दी</p>",
    "category": "Health",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001VI9I.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002HXEY.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233219&reg=3&lang=1"
  },
  {
    "headline": "Vice-President Shri C. P. Radhakrishnan to Visit Tamil Nadu on 27th February, 2026",
    "summaryText": "<p>Vice President's Secretariat</p><p>Vice-President Shri C. P. Radhakrishnan to Visit Tamil Nadu on 27th February, 2026</p><p>The Vice-President of India, Shri C. P. Radhakrishnan, will visit Salem, Tamil Nadu on 27 February, 2026. During the visit, the Vice President will inaugurate the new academic building of the Indian Institute of Handloom Technology (IIHT), Salem.</p><p>Read this release in: Urdu , हिन्दी , Malayalam</p>",
    "category": "General",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233212&reg=3&lang=1"
  },
  {
    "headline": "First Round of India–Israel FTA Talks Conclude Successfully in New Delhi",
    "summaryText": "<p>Ministry of Commerce & Industry</p><p>First Round of India–Israel FTA Talks Conclude Successfully in New Delhi FTA Talks Cover Wide-Ranging Issues; Next Round to Be Held in Israel in May 2026</p><p>The first round of negotiations for the India–Israel Free Trade Agreement (FTA), held from 23 to 26 February 2026 in New Delhi, concluded successfully today. The Terms of Reference (ToR) was signed in November 2025, establishing a structured framework for discussions on identified areas to enhance trade and economic cooperation.</p><p>Presently on a two-day State Visit to Israel, Prime Minister Shri Narendra Modi while addressing a Special Plenary of the Knesset in Jerusalem on February 25, 2026, called for early finalization of an ambitious Free Trade Agreement to realize the untapped trade potential between the two countries.</p><p>On 24th February 2026, Union Minister of Commerce and Industry, Shri Piyush Goyal, met the visiting Israeli delegation and emphasized that both sides should work closely to unlock new opportunities in trade, innovation, and growth, thereby further strengthening the valued partnership between the two countries. He encouraged both sides to strive towards a modern, comprehensive, and future-ready trade agreement.</p><p>During the four-day negotiations, both countries engaged in discussions covering a wide range of areas, including trade in goods and services, rules of origin, sanitary and phytosanitary measures, technical barriers to trade, customs procedures, intellectual property rights, digital trade, and other key chapters. Discussions were held in a constructive and forward-looking manner, with both sides reaffirming their objective of negotiating a comprehensive, balanced, and mutually beneficial agreement. Both sides also agreed to continue inter-sessional engagements virtually. The next round of in-person negotiations will be held in May 2026 in Israel.</p><p>Bilateral merchandise trade between the two countries stood at approximately USD 3.62 billion in FY 2024–25. The proposed FTA offers a valuable opportunity to enhance trade flows by providing a stable and predictable framework for businesses in both India and Israel. Both sides noted the untapped potential in key sectors, including machinery, chemicals, textiles, agriculture, medical devices, and advanced technologies. The successful conclusion of the first round reflects a shared commitment to deepen economic partnership and creating new opportunities for stakeholders.</p><p>Abhishek Dayal/ Abhijith Narayanan/ Ishita Biswas</p><p>Read this release in: Urdu , Marathi , हिन्दी , Gujarati , Telugu , Malayalam</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233199&reg=3&lang=1"
  },
  {
    "headline": "Indian Railways and Indian Army Launch ‘Framework of Cooperation’ to Strengthen Post-Retirement Career Opportunities for Agniveers and Serving Army Personnel",
    "summaryText": "<p>Indian Railways and Indian Army Launch ‘Framework of Cooperation’ to Strengthen Post-Retirement Career Opportunities for Agniveers and Serving Army Personnel Major Employment Push with Dedicated Reservation for Ex-Servicemen and Ex-Agniveers in Level-1 and Level-2/Above PostsRailways to Recruit Over 5,000 Ex-Servicemen as Pointsmen on Contract Basis to Fill Vacancies FasterRailways Reserved 14,788 Posts for Ex-Servicemen in 2024–25 Vacancy Notifications</p><p>In a significant step towards deepening institutional collaboration, Indian Railways and the Indian Army have introduced a “Framework of Cooperation” aimed at expanding post-retirement employment opportunities for Agniveers and serving Army personnel transitioning to civilian life.</p><p>Spearheaded by senior leadership from the Army and the Ministry of Railways, the initiative is designed to ensure a smoother shift from military to civilian careers. It will also increase awareness about job prospects within the Railways and create a dedicated support system to assist retiring personnel.</p><p>This collaborative framework underscores a shared commitment to providing veterans with meaningful second-career pathways while supporting broader national development goals.</p><p>Major Employment Opportunities for Ex-Servicemen</p><p>Welfare and resettlement of retired armed forces personnel form an important component of Indian Railways’ policy framework.</p><p>To provide employment avenues for ex-servicemen and ex-agniveers:</p><p>10% horizontal reservation in Level-2/above posts and 20% in Level-1 posts has been provisioned for ex-servicemen.</p><p>Additionally, 5% reservation in Level-2/above posts and 10% in Level-1 posts has been earmarked for ex-agniveers.</p><p>In the years 2024 and 2025, a total of 14,788 posts were reserved for ex-servicemen in railway vacancy notifications, including:</p><p>8,303 posts in Level-2/above</p><p>Recruitment to Level-1 (erstwhile Group D) and Level-2/above posts is conducted through Railway Recruitment Centres (RRCs) and Railway Recruitment Boards (RRBs), respectively, via competitive examinations.</p><p>Immediate Engagement Through Contractual Appointments</p><p>To promote faster engagement of ex-servicemen and address existing vacancies, the Ministry of Railways has decided to recruit ex-servicemen as ‘Pointsmen’ across Indian Railways on a contract basis until regular recruitment processes are completed.</p><p>More than 5,000 Level-1 posts are currently being processed at the Zonal and Divisional levels. So far, 9 Divisions have entered into MoUs with concerned Army organizations for hiring of Pointsmen.</p><p>The collaborative framework also calls upon Army recruiting organizations to proactively engage with Railway Divisions to expedite the filling of these posts.</p><p>Harnessing Collective Strengths for Nation Building</p><p>Indian Railways and Indian Army share valuable skills, discipline, technical competence and leadership qualities developed during service, contributing significantly to nation building. A substantial number of soldiers retire at a comparatively young age with rich operational and managerial experience, along with strong discipline and national fervour.</p><p>The cooperation between Indian Railways and Indian Army plays a vital role in logistics and personnel movement. Strategic infrastructure projects such as the Dedicated Freight Corridors and the Udhampur–Srinagar–Baramulla Rail Link have enhanced rapid deployment capabilities for troops and equipment. Skill-sharing initiatives are also being promoted through Memorandums of Understanding (MoUs) with Gati Shakti Vishwavidyalaya.</p><p>The framework promotes structured engagement of ex-servicemen and ex-agniveers within the existing recruitment system and strengthens long-term collaboration. The initiative underscores the Government’s commitment to leveraging the experience and discipline of armed forces veterans while strengthening national infrastructure and security coordination.</p><p>Dharmendra Tewari/ Ritu Raj</p><p>Read this release in: Urdu , Marathi , हिन्दी , Gujarati , Tamil , Kannada , Malayalam</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233196&reg=3&lang=1"
  },
  {
    "headline": "“Shilp Samagam is not merely a fair, but a bridge to self-reliance and dignity” – Dr. Virendra Kumar inaugurates ‘Shilp Samagam–2026’",
    "summaryText": "<p>Ministry of Social Justice & Empowerment</p><p>“Shilp Samagam is not merely a fair, but a bridge to self-reliance and dignity” – Dr. Virendra Kumar inaugurates ‘Shilp Samagam–2026’</p><p>“This is not merely an exhibition of products, but a celebration of self-reliance, dignity and social empowerment.” With these words, the Union Minister for Social Justice and Empowerment, Dr. Virendra Kumar, today inaugurated the Shilp Samagam Mela–2026 at ‘Vallabh Sadan’, Sabarmati Riverfront, Ahmedabad.</p><p>Extending greetings to all present on the occasion of the upcoming festival of Holi, the Minister stated that the fair symbolizes the Ministry’s sustained commitment towards economically empowering the targeted sections of society and integrating them into the mainstream.</p><p>The Minister informed that since 2014, nearly 100 Shilp Samagam Melas have been organized or participated in by the Department of Social Justice and Empowerment. During 2025–26, five (05) such melas have been organized, and more are planned for 2026–27. He noted that Ahmedabad, known for its association with the freedom movement, Mahatma Gandhi’s Sabarmati Ashram, and as the karmabhoomi of Sardar Vallabhbhai Patel, is an appropriate venue for such an inclusive event.</p><p>The Ministry is implementing various schemes for the social and economic upliftment of Scheduled Castes, Other Backward Classes, Safai Karamcharis, Divyangjans, De-notified, Nomadic and Semi-Nomadic Tribes (DNT/NT/SNT), Senior Citizens and the Transgender community. The Minister stated that fairs like Shilp Samagam provide a direct marketing platform to artisans and beneficiaries belonging to these sections.</p><p>The mela, being held from February 26 to March 4, features 75 stalls allocated to artisans from 14 States. A wide range of handicraft products are on display, including Lucknowi Chikankari, Banarasi sarees, Chanderi and Maheshwari textiles, Bhagalpuri Tussar silk, Jaipuri and Kolhapuri footwear, Agate stone work, bamboo products, Kota Doria, and Carpets etc.</p><p>The Minister further informed that for artisans who are unable to participate directly, the Ministry has developed the ‘Bharat Tulip’ online platform to facilitate the sale of their products, which has been integrated with various e-commerce platforms. A ‘Bharat Tulip Showroom’ has also been launched at the mela to connect more beneficiaries with market opportunities.</p><p>Under the SEED Scheme for the empowerment of De-notified, Nomadic and Semi-Nomadic Tribes, 5,581 Women Self-Help Groups have been formed across eight States. These groups are being provided Revolving Funds, Entry Point Funds, and skill training. Under the health component, approximately 75,000 Ayushman Cards have been distributed.</p><p>The Minister stated that on March 13, 2024, Hon’ble Prime Minister Shri Narendra Modi dedicated the ‘PM-SURAJ Portal’ to the nation, enabling transparent and accessible delivery of concessional loan schemes of the Ministry to targeted beneficiaries. The ‘PM-DAKSH Portal’ has been developed for skill training, and the ‘SFMP Portal’ for scholarships. These digital initiatives have significantly enhanced transparency and efficiency in implementation.</p><p>He further informed that under the Ministry’s ‘VISVAS' yojana, eligible beneficiaries are provided a 5 percent interest subvention on bank loans. The ‘NAMASTE' scheme ensures safety and dignity for workers engaged in septic tank and sewer-related work. The Apex Corporations under the Ministry have so far extended loan assistance to nearly 60 lakh individuals and their families, and provided skill training to more than 6 lakh youth.</p><p>Expressing confidence, the Minister said that Shilp Samagam Mela at Ahmedabad will not only boost the sales of artisans’ products but also connect them with self-reliance, dignity and new opportunities. Concluding his address, he conveyed his best wishes to all participants and reaffirmed the Ministry’s continued commitment to bringing marginalized communities into the mainstream.</p><p>Read this release in: Urdu , हिन्दी , Gujarati</p>",
    "category": "Economy",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001DFQF.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002HFIF.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003U7JN.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004GCOE.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0052BWG.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233191&reg=3&lang=1"
  }
]