[
  {
    "headline": "Privacy and transparency: On the RTI Act amendment, petitions",
    "summaryText": "<h3>Why in News</h3>\n<p>The RTI Act amendment has been in news due to petitions filed against it, highlighting the need for privacy and transparency in the functioning of the government.</p>\n\n<h3>Background</h3>\n<p>The Right to Information (RTI) Act, 2005 is a landmark legislation that aims to promote transparency and accountability in the functioning of the government. However, recent amendments to the Act have raised concerns about the erosion of transparency and the potential for abuse of power.</p>\n\n<h3>Key Highlights</h3>\n<p>The amendments to the RTI Act have introduced changes to the tenure and salary of the Chief Information Commissioner and Information Commissioners, which has sparked controversy and debate. The petitions filed against the amendments argue that these changes undermine the independence of the information commission and compromise the effectiveness of the RTI Act.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The RTI Act is a constitutional right, enshrined in Article 19(1)(a) of the Constitution, which guarantees the freedom of speech and expression. The Act is also supported by various judicial pronouncements, including the landmark judgment in the case of S.P. Gupta vs. Union of India.</p>\n\n<h3>Significance</h3>\n<p>The RTI Act has been a powerful tool for promoting transparency and accountability in the functioning of the government. It has enabled citizens to access information about government policies, decisions, and actions, which has helped to prevent corruption and abuse of power.</p>\n\n<h3>Challenges</h3>\n<p>Despite its significance, the RTI Act faces several challenges, including the lack of awareness and education among citizens about their rights under the Act. Additionally, the amendments to the Act have raised concerns about the potential for abuse of power and the erosion of transparency.</p>\n\n<h3>Way Forward</h3>\n<p>To address the challenges facing the RTI Act, it is essential to promote awareness and education among citizens about their rights under the Act. Additionally, the government should ensure that the amendments to the Act do not compromise the independence of the information commission and the effectiveness of the RTI Act.</p>\n\n<h3>Prelims Facts</h3>\n<p>The RTI Act, 2005 was enacted to promote transparency and accountability in the functioning of the government. The Act applies to all public authorities, including government departments, public sector undertakings, and non-governmental organizations receiving government funding.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>Polity and Governance, Social Justice</p>",
    "category": "GS-2"
  },
  {
    "headline": "Monetary Policy Meet: Repo rate steady at 5.25%; FY26 GDP, inflation projections raised",
    "summaryText": "<h3>Why in News</h3>\n<p>The Monetary Policy Committee (MPC) of the Reserve Bank of India (RBI) has decided to keep the repo rate steady at 5.25% in its recent meeting, while raising the FY26 GDP and inflation projections.</p>\n\n<h3>Background</h3>\n<p>The RBI's monetary policy decisions are guided by the objective of maintaining price stability, while also supporting economic growth. The MPC reviews the economic situation and makes decisions on monetary policy every two months.</p>\n\n<h3>Key Highlights</h3>\n<p>The key highlights of the recent monetary policy meeting include: \n- The repo rate has been kept unchanged at 5.25%. \n- The FY26 GDP growth projection has been raised to 6.5% from 6.3% earlier. \n- The inflation projection for FY26 has been raised to 4.5% from 4.3% earlier.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The RBI is governed by the Reserve Bank of India Act, 1934, which gives the central bank the power to regulate the money supply and maintain price stability in the economy.</p>\n\n<h3>Significance</h3>\n<p>The decision to keep the repo rate steady is significant as it indicates that the RBI is prioritizing price stability over economic growth. The raise in GDP and inflation projections suggests that the RBI is expecting a pickup in economic activity and higher prices in the coming year.</p>\n\n<h3>Challenges</h3>\n<p>The RBI faces several challenges in achieving its objectives, including managing inflation, supporting economic growth, and maintaining financial stability. The MPC must balance these competing objectives while making its monetary policy decisions.</p>\n\n<h3>Way Forward</h3>\n<p>The way forward for the RBI will depend on the evolving economic situation and the MPC's assessment of the risks and opportunities facing the economy. The RBI may need to adjust its monetary policy stance in response to changes in the economic environment.</p>\n\n<h3>Prelims Facts</h3>\n<p>Key facts for the UPSC prelims exam include: \n- The repo rate is the rate at which the RBI lends to commercial banks. \n- The RBI is responsible for regulating the money supply and maintaining price stability in the economy. \n- The MPC is a committee of the RBI that reviews the economic situation and makes decisions on monetary policy.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic can be categorized under the Indian Economy section of the GS Paper III syllabus, which includes topics such as monetary policy, inflation, and economic growth.</p>",
    "category": "GS-3"
  },
  {
    "headline": "Daily Quiz: On Artificial Intelligence",
    "summaryText": "<h3>Why in News</h3>\n<p>Artificial Intelligence (AI) has been in the news due to its increasing applications and potential to transform various sectors.</p>\n\n<h3>Background</h3>\n<p>Artificial Intelligence refers to the development of computer systems that can perform tasks that typically require human intelligence, such as visual perception, speech recognition, and decision-making.</p>\n\n<h3>Key Highlights</h3>\n<p>Key highlights of AI include its ability to learn, reason, and interact with humans, making it a significant technology with vast potential.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>There are no specific constitutional provisions related to AI, but laws and regulations are being developed to govern its development and use.</p>\n\n<h3>Significance</h3>\n<p>AI has the potential to significantly impact various sectors, including healthcare, finance, and education, and can help solve complex problems.</p>\n\n<h3>Challenges</h3>\n<p>Challenges related to AI include concerns about job displacement, bias, and privacy, as well as the need for significant investment in infrastructure and skills development.</p>\n\n<h3>Way Forward</h3>\n<p>The way forward for AI involves addressing the challenges and ensuring that its development and use are aligned with human values and promote societal benefit.</p>\n\n<h3>Prelims Facts</h3>\n<p>Prelims facts related to AI include its definition, types, and applications, as well as key terms such as machine learning and natural language processing.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>AI can be categorized under GS Paper III, which covers science and technology, and GS Paper II, which covers governance and social justice.</p>",
    "category": "GS-2"
  },
  {
    "headline": "Those supporting terrorism will meet fate of Afzal Guru: Amit Shah",
    "summaryText": "<h3>Why in News</h3>\n<p>Union Home Minister Amit Shah recently stated that those supporting terrorism will meet the fate of Afzal Guru, emphasizing the government's commitment to combating terrorism.</p>\n\n<h3>Background</h3>\n<p>Afzal Guru was a key conspirator in the 2001 Indian Parliament attack and was subsequently hanged in 2013 for his role in the attack. The statement by Amit Shah comes amidst ongoing efforts to curb terrorism and militancy in the country.</p>\n\n<h3>Key Highlights</h3>\n<p>The statement highlights the government's resolve to take strong action against those involved in or supporting terrorism. It also underscores the importance of national security and the need to protect the country from terrorist activities.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The statement is in line with the constitutional provisions and legal frameworks that govern the country's approach to terrorism, including the Unlawful Activities (Prevention) Act and the National Investigation Agency Act.</p>\n\n<h3>Significance</h3>\n<p>The statement holds significant implications for national security and the government's approach to combating terrorism. It also serves as a warning to those involved in or supporting terrorist activities.</p>\n\n<h3>Challenges</h3>\n<p>Despite the government's efforts, terrorism remains a significant challenge for the country. The statement highlights the need for continued vigilance and strong action against those involved in or supporting terrorism.</p>\n\n<h3>Way Forward</h3>\n<p>The government's approach to combating terrorism will likely involve a combination of legislative, administrative, and security measures. This may include strengthening existing laws and frameworks, improving intelligence gathering, and enhancing cooperation with international partners.</p>\n\n<h3>Prelims Facts</h3>\n<p>Afzal Guru was hanged in 2013 for his role in the 2001 Indian Parliament attack. The Unlawful Activities (Prevention) Act and the National Investigation Agency Act are key legal frameworks that govern the country's approach to terrorism.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>Internal Security, Polity, and Governance.</p>",
    "category": "GS-2"
  },
  {
    "headline": "At Delhi AI Impact Summit 2026, PM Modi unveils ‘MANAV’ vision for artificial intelligence",
    "summaryText": "<h3>Why in News</h3>\n<p>Prime Minister Narendra Modi has unveiled the ‘MANAV’ vision for artificial intelligence at the Delhi AI Impact Summit 2026, highlighting the government's focus on leveraging AI for the betterment of humanity.</p>\n\n<h3>Background</h3>\n<p>The Delhi AI Impact Summit 2026 is a significant event that brings together experts, policymakers, and industry leaders to discuss the impact of artificial intelligence on society and the economy. The summit aims to explore the potential of AI in driving innovation, growth, and development.</p>\n\n<h3>Key Highlights</h3>\n<p>The ‘MANAV’ vision for artificial intelligence encompasses four key aspects: \n1. Mapping India's AI landscape\n2. Accelerating AI adoption\n3. Nurturing AI innovation\n4. Achieving AI for all\nThese aspects are expected to guide the government's AI strategy and initiatives in the coming years.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The Indian government has established the National AI Strategy, which outlines the country's approach to AI development and adoption. The strategy emphasizes the need for a holistic and inclusive approach to AI, ensuring that its benefits are accessible to all sections of society.</p>\n\n<h3>Significance</h3>\n<p>The ‘MANAV’ vision for artificial intelligence has significant implications for India's economic and social development. By leveraging AI, the country can drive innovation, improve productivity, and enhance the quality of life for its citizens.</p>\n\n<h3>Challenges</h3>\n<p>Despite the potential benefits of AI, there are several challenges that need to be addressed, including the need for skilled workforce, infrastructure development, and addressing ethical concerns related to AI adoption.</p>\n\n<h3>Way Forward</h3>\n<p>To realize the ‘MANAV’ vision, the government needs to work closely with industry leaders, academia, and civil society to create a conducive ecosystem for AI development and adoption. This includes investing in AI research and development, promoting AI education and training, and establishing regulatory frameworks to ensure responsible AI use.</p>\n\n<h3>Prelims Facts</h3>\n<p>Delhi AI Impact Summit 2026, ‘MANAV’ vision, National AI Strategy, artificial intelligence.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>Science and Technology, Governance, Economic Development, Social Justice.</p>",
    "category": "GS-2"
  },
  {
    "headline": "Why the new Digital Personal Data Protection Act faces a constitutional challenge in the Supreme Court",
    "summaryText": "<h3>Why in News</h3>\n<p>The Digital Personal Data Protection Act has been challenged in the Supreme Court, citing concerns over its constitutionality and potential impact on individual privacy rights.</p>\n\n<h3>Background</h3>\n<p>The Digital Personal Data Protection Act aims to regulate the collection, storage, and processing of personal data in India, providing a framework for data protection and privacy.</p>\n\n<h3>Key Highlights</h3>\n<p>The Act establishes a Data Protection Board to oversee compliance, imposes penalties for non-compliance, and introduces provisions for data localization and cross-border data transfers.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The challenge in the Supreme Court argues that the Act infringes upon the right to privacy, as guaranteed under Article 21 of the Indian Constitution, and raises concerns over the potential for mass surveillance and data breaches.</p>\n\n<h3>Significance</h3>\n<p>The outcome of the challenge will have significant implications for the implementation of the Digital Personal Data Protection Act and the protection of individual privacy rights in India.</p>\n\n<h3>Challenges</h3>\n<p>The Act faces challenges in balancing individual privacy rights with the need for data-driven innovation and economic growth, as well as addressing concerns over data security and cross-border data transfers.</p>\n\n<h3>Way Forward</h3>\n<p>The Supreme Court's decision will provide clarity on the constitutionality of the Act, and the government may need to revisit and revise the legislation to address the concerns raised.</p>\n\n<h3>Prelims Facts</h3>\n<p>The Digital Personal Data Protection Act was introduced to replace the Information Technology (Reasonable Security Practices and Procedures and Sensitive Personal Data or Information) Rules, 2011.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>Polity and Governance, Science and Technology</p>",
    "category": "GS-2"
  },
  {
    "headline": "Congress slams Economic Survey’s RTI review call, but UPA ministers once raised similar concerns",
    "summaryText": "<h3>Why in News</h3>\n<p>The Congress has slammed the Economic Survey's call for a review of the Right to Information (RTI) Act, but UPA ministers had once raised similar concerns.</p>\n\n<h3>Background</h3>\n<p>The RTI Act was enacted in 2005 to promote transparency and accountability in government. It allows citizens to access information from public authorities, subject to certain exemptions.</p>\n\n<h3>Key Highlights</h3>\n<p>The Economic Survey has suggested a review of the RTI Act to balance the need for transparency with the need to protect sensitive information. The Survey notes that the Act has led to an overwhelming number of requests, which can be burdensome for public authorities.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>Article 19(1)(a) of the Constitution guarantees the right to freedom of speech and expression, which includes the right to information. The RTI Act is a statutory enactment that operationalizes this right.</p>\n\n<h3>Significance</h3>\n<p>The RTI Act has been instrumental in promoting transparency and accountability in government. It has enabled citizens to access information on various aspects of governance, including policy decisions, public expenditure, and administrative actions.</p>\n\n<h3>Challenges</h3>\n<p>Despite its significance, the RTI Act faces several challenges, including the overwhelming number of requests, lack of infrastructure, and inadequate training of public information officers. There are also concerns about the misuse of the Act for frivolous or vexatious purposes.</p>\n\n<h3>Way Forward</h3>\n<p>To address these challenges, the government could consider measures such as streamlining the process for handling RTI requests, providing training to public information officers, and introducing measures to prevent the misuse of the Act.</p>\n\n<h3>Prelims Facts</h3>\n<p>The RTI Act was enacted in 2005. The Act applies to all public authorities, including government departments, public sector undertakings, and non-governmental organizations receiving government funding.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>Polity and Governance, Social Justice</p>",
    "category": "GS-2"
  },
  {
    "headline": "Corporate investment push strengthens, Rs 4.35 lakh crore lined up in FY26: RBI article",
    "summaryText": "<h3>Why in News</h3>\n<p>The Reserve Bank of India (RBI) has reported a significant surge in corporate investment, with a projected outlay of Rs 4.35 lakh crore for the fiscal year 2026, marking a substantial increase in investment plans.</p>\n\n<h3>Background</h3>\n<p>The Indian economy has been witnessing a slowdown in investment growth over the past few years, which has been a major concern for policymakers. However, the recent data suggests a turnaround, with corporates planning to invest heavily in various sectors.</p>\n\n<h3>Key Highlights</h3>\n<p>The RBI report highlights that the proposed investment of Rs 4.35 lakh crore is expected to be distributed across various sectors, including infrastructure, manufacturing, and services. This investment push is likely to have a positive impact on economic growth and job creation.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The government has implemented various policy measures to boost investment, including the introduction of the Production-Linked Incentive (PLI) scheme and the National Infrastructure Pipeline (NIP). These initiatives aim to create a conducive business environment and attract investments.</p>\n\n<h3>Significance</h3>\n<p>The increase in corporate investment is significant, as it can help stimulate economic growth, create employment opportunities, and improve the overall business environment. This, in turn, can have a positive impact on the country's GDP and help achieve the government's vision of becoming a $5 trillion economy.</p>\n\n<h3>Challenges</h3>\n<p>Despite the positive outlook, there are challenges that need to be addressed, including the need for improved infrastructure, reduced regulatory hurdles, and enhanced ease of doing business. Additionally, the government must ensure that the investments are sustainable and environmentally friendly.</p>\n\n<h3>Way Forward</h3>\n<p>To sustain the investment momentum, the government must continue to implement policies that promote ease of doing business, improve infrastructure, and provide incentives for investments. Additionally, the private sector must be encouraged to invest in research and development, innovation, and human capital to drive growth and competitiveness.</p>\n\n<h3>Prelims Facts</h3>\n<p>Key facts to remember: The proposed investment outlay is Rs 4.35 lakh crore, the investment is expected to be distributed across various sectors, and the government has implemented policies like PLI and NIP to boost investment.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic can be categorized under the General Studies Paper III, which covers topics related to Indian Economy, including investment models, economic growth, and development.</p>",
    "category": "GS-2"
  },
  {
    "headline": "President of Switzerland on India’s AI summit: Can we make Artificial Intelligence more equal, together?",
    "summaryText": "<h3>Why in News</h3>\n<p>The President of Switzerland recently attended India's AI summit, highlighting the need for collaboration to make Artificial Intelligence more equal and accessible.</p>\n\n<h3>Background</h3>\n<p>Artificial Intelligence has been rapidly advancing in recent years, with significant investments and developments in the field. However, concerns have been raised regarding the unequal distribution of benefits and potential biases in AI systems.</p>\n\n<h3>Key Highlights</h3>\n<p>The President of Switzerland emphasized the importance of international cooperation to address the challenges associated with AI, including ensuring that its benefits are shared equitably among all nations and communities.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>There are currently no specific international laws or regulations governing the development and use of Artificial Intelligence, although various countries have established their own guidelines and frameworks.</p>\n\n<h3>Significance</h3>\n<p>The collaboration between India and Switzerland on AI can have significant implications for the global community, as it can help establish standards and best practices for the development and deployment of AI technologies.</p>\n\n<h3>Challenges</h3>\n<p>One of the major challenges in making AI more equal is addressing the issue of data bias, which can perpetuate existing social and economic inequalities. Additionally, there are concerns regarding job displacement and the need for upskilling and reskilling of workers.</p>\n\n<h3>Way Forward</h3>\n<p>To make AI more equal, it is essential to prioritize transparency, accountability, and inclusivity in its development and deployment. This can be achieved through international cooperation, investments in education and training, and the establishment of robust regulatory frameworks.</p>\n\n<h3>Prelims Facts</h3>\n<p>Artificial Intelligence refers to the development of computer systems that can perform tasks that typically require human intelligence, such as visual perception, speech recognition, and decision-making.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic can be categorized under GS Paper 3, which covers topics related to science and technology, including advancements in fields like Artificial Intelligence and their implications for society and governance.</p>",
    "category": "GS-2"
  },
  {
    "headline": "IIM Lucknow announces 3 new programmes on Artificial Intelligence, one UG course require JEE score",
    "summaryText": "<h3>Why in News</h3>\n<p>IIM Lucknow has announced the launch of three new programmes on Artificial Intelligence, including one undergraduate course that requires a JEE score.</p>\n\n<h3>Background</h3>\n<p>Indian Institute of Management (IIM) Lucknow has been expanding its academic offerings to cater to the growing demand for AI and related technologies. The new programmes aim to provide students with a comprehensive understanding of AI and its applications in management.</p>\n\n<h3>Key Highlights</h3>\n<p>The three new programmes include a 4-year undergraduate course, a 2-year postgraduate course, and a 1-year executive programme. The undergraduate course requires a valid JEE score, while the postgraduate and executive programmes require a graduate degree and work experience, respectively.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The launch of these new programmes is in line with the National Education Policy (NEP) 2020, which emphasizes the importance of emerging technologies like AI in education. The programmes are also compliant with the regulations of the All India Council for Technical Education (AICTE) and the University Grants Commission (UGC).</p>\n\n<h3>Significance</h3>\n<p>The introduction of these programmes is significant as it marks a major step towards integrating AI into management education. The programmes will provide students with a unique blend of technical and managerial skills, making them industry-ready and equipped to tackle complex business problems.</p>\n\n<h3>Challenges</h3>\n<p>The implementation of these programmes may face challenges such as faculty recruitment, infrastructure development, and industry partnerships. Additionally, the programmes may require significant investment in resources and technology to provide students with hands-on experience in AI.</p>\n\n<h3>Way Forward</h3>\n<p>To overcome the challenges, IIM Lucknow may need to collaborate with industry partners, recruit faculty with expertise in AI, and invest in state-of-the-art infrastructure. The institute may also need to develop a robust curriculum that balances technical and managerial aspects of AI.</p>\n\n<h3>Prelims Facts</h3>\n<p>IIM Lucknow has launched three new programmes on Artificial Intelligence. The programmes include a 4-year undergraduate course, a 2-year postgraduate course, and a 1-year executive programme. The undergraduate course requires a valid JEE score.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic can be categorized under GS Paper 3 (Science and Technology) and GS Paper 2 (Polity and Governance), as it relates to education policy and emerging technologies.</p>",
    "category": "GS-2"
  },
  {
    "headline": "RBI doubles collateral-free loans to MSMEs to Rs 20 lakh",
    "summaryText": "<h3>Why in News</h3>\n<p>The Reserve Bank of India (RBI) has doubled the limit of collateral-free loans to Micro, Small, and Medium Enterprises (MSMEs) to Rs 20 lakh.</p>\n\n<h3>Background</h3>\n<p>The RBI has taken this step to support the MSME sector, which is facing challenges due to the COVID-19 pandemic. The move is expected to provide relief to small businesses and help them recover from the economic downturn.</p>\n\n<h3>Key Highlights</h3>\n<p>The key highlights of the RBI's decision include: \n- Doubling the limit of collateral-free loans to MSMEs to Rs 20 lakh.\n- The increased limit will apply to loans given by banks, non-banking financial companies (NBFCs), and other financial institutions.\n- The move is expected to benefit over 8.5 million MSMEs in the country.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The RBI's decision is based on the provisions of the Banking Regulation Act, 1949, which empowers the central bank to regulate and supervise the banking sector.</p>\n\n<h3>Significance</h3>\n<p>The decision to double the limit of collateral-free loans to MSMEs is significant as it will provide much-needed relief to small businesses. The move is expected to increase credit flow to the sector and help MSMEs recover from the economic downturn.</p>\n\n<h3>Challenges</h3>\n<p>Despite the RBI's efforts, the MSME sector continues to face challenges such as limited access to credit, high interest rates, and lack of infrastructure. The sector also faces competition from large businesses and foreign companies.</p>\n\n<h3>Way Forward</h3>\n<p>To support the MSME sector, the government and the RBI need to take further steps such as providing easy access to credit, reducing interest rates, and improving infrastructure. The government also needs to implement policies that promote the growth of MSMEs and protect them from competition.</p>\n\n<h3>Prelims Facts</h3>\n<p>Key facts for prelims include: \n- The RBI has doubled the limit of collateral-free loans to MSMEs to Rs 20 lakh.\n- The move is expected to benefit over 8.5 million MSMEs in the country.\n- The decision is based on the provisions of the Banking Regulation Act, 1949.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>The topic can be categorized under the GS Paper III (Economy) and is relevant for the UPSC Civil Services Examination.</p>",
    "category": "GS-3"
  },
  {
    "headline": "India well placed amid global uncertainty, growth strong and inflation benign: RBI Governor",
    "summaryText": "<h3>Why in News</h3>\n<p>The RBI Governor recently stated that India is well-placed amid global uncertainty, with strong growth and benign inflation, in a significant development that highlights the country's economic resilience.</p>\n\n<h3>Background</h3>\n<p>The global economy is facing significant challenges, including the ongoing COVID-19 pandemic, the Russia-Ukraine conflict, and rising inflation. However, India has managed to maintain a strong growth trajectory, with the RBI Governor citing the country's robust economic fundamentals and effective policy responses.</p>\n\n<h3>Key Highlights</h3>\n<p>The RBI Governor highlighted several key factors that contribute to India's strong economic position, including:</p>\n<ul>\n  <li>Robust growth momentum</li>\n  <li>Benign inflation</li>\n  <li>Stable financial markets</li>\n  <li>Effective policy responses</li>\n</ul>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The RBI Governor's statement is significant, as it reflects the central bank's commitment to maintaining price stability and promoting economic growth, in line with its statutory mandate under the Reserve Bank of India Act, 1934.</p>\n\n<h3>Significance</h3>\n<p>The RBI Governor's assessment has important implications for India's economic trajectory, as it suggests that the country is well-positioned to navigate global uncertainty and maintain its growth momentum, with potential benefits for employment, investment, and overall economic development.</p>\n\n<h3>Challenges</h3>\n<p>Despite the positive assessment, India still faces significant challenges, including:</p>\n<ul>\n  <li>Rising inflationary pressures</li>\n  <li>Global economic uncertainty</li>\n  <li>Dependence on imported energy sources</li>\n  <li>Infrastructure and logistical bottlenecks</li>\n</ul>\n\n<h3>Way Forward</h3>\n<p>To build on the current momentum, the RBI Governor emphasized the need for:</p>\n<ul>\n  <li>Monetary policy calibration</li>\n  <li>Fiscal policy support</li>\n  <li>Structural reforms</li>\n  <li>Investment in human capital and infrastructure</li>\n</ul>\n\n<h3>Prelims Facts</h3>\n<p>Key facts for prelims include:</p>\n<ul>\n  <li>RBI Governor's statement on India's economic position</li>\n  <li>Global economic challenges and their impact on India</li>\n  <li>India's economic growth rate and inflation targets</li>\n</ul>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic is relevant to GS Paper III, which covers Indian Economy and issues related to planning, mobilization of resources, growth, development, and employment.</p>",
    "category": "GS-3"
  },
  {
    "headline": "RBI keeps repo rate unchanged at 5.25%, maintains neutral stance",
    "summaryText": "<h3>Why in News</h3>\n<p>The Reserve Bank of India (RBI) has decided to keep the repo rate unchanged at 5.25%, while maintaining a neutral stance, in its recent monetary policy review.</p>\n\n<h3>Background</h3>\n<p>The RBI's decision to keep the repo rate unchanged is aimed at balancing the need to control inflation with the need to support economic growth. The neutral stance indicates that the RBI is open to either increasing or decreasing the repo rate in the future, depending on the economic conditions.</p>\n\n<h3>Key Highlights</h3>\n<p>The key highlights of the RBI's monetary policy review include the decision to keep the repo rate unchanged at 5.25%, the reverse repo rate unchanged at 4.75%, and the marginal standing facility (MSF) rate unchanged at 5.50%. The RBI has also projected a GDP growth rate of 6.4% for the current fiscal year.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The RBI's monetary policy decisions are guided by the Reserve Bank of India Act, 1934, which mandates the RBI to regulate the money supply and credit in the country. The RBI is also required to maintain price stability and promote economic growth.</p>\n\n<h3>Significance</h3>\n<p>The RBI's decision to keep the repo rate unchanged has significant implications for the economy. It is expected to help maintain liquidity in the system, support economic growth, and control inflation. The neutral stance also provides flexibility to the RBI to respond to changing economic conditions.</p>\n\n<h3>Challenges</h3>\n<p>The RBI faces several challenges in maintaining a balance between controlling inflation and supporting economic growth. The rising crude oil prices, volatility in the global economy, and the impact of the COVID-19 pandemic are some of the key challenges that the RBI needs to address.</p>\n\n<h3>Way Forward</h3>\n<p>The RBI's decision to keep the repo rate unchanged is expected to be followed by a series of measures to support economic growth and control inflation. The RBI may consider reducing the cash reserve ratio (CRR) or introducing other measures to increase liquidity in the system.</p>\n\n<h3>Prelims Facts</h3>\n<p>The repo rate is the rate at which the RBI lends money to commercial banks. The reverse repo rate is the rate at which the RBI borrows money from commercial banks. The marginal standing facility (MSF) rate is the rate at which the RBI lends money to commercial banks for a short period.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic can be categorized under the Indian Economy section of the General Studies paper, which includes topics related to monetary policy, fiscal policy, and economic growth.</p>",
    "category": "GS-3"
  },
  {
    "headline": "Union Budget: Rs 10,000-crore SME Growth Fund, reform to boost liquidity for MSMEs",
    "summaryText": "<h3>Why in News</h3>\n<p>The Union Budget has announced a Rs 10,000-crore SME Growth Fund to boost liquidity for Micro, Small, and Medium Enterprises (MSMEs), which has been a significant sector in the country's economic growth.</p>\n\n<h3>Background</h3>\n<p>The MSME sector has been facing challenges such as limited access to credit, high credit costs, and lack of liquidity, which have hindered their growth and development. The government has been taking various measures to address these issues and promote the sector.</p>\n\n<h3>Key Highlights</h3>\n<p>The SME Growth Fund will provide liquidity to MSMEs, enabling them to meet their working capital requirements and invest in growth initiatives. The fund will also support the development of the MSME sector by providing financial assistance to startups and small businesses.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The government has announced various initiatives to support the MSME sector, including the Micro, Small, and Medium Enterprises Development (MSMED) Act, 2006, which provides a framework for the promotion and development of the sector.</p>\n\n<h3>Significance</h3>\n<p>The SME Growth Fund is expected to have a positive impact on the MSME sector, enabling them to access credit at affordable rates and boost their growth and development. This, in turn, will contribute to the country's economic growth and job creation.</p>\n\n<h3>Challenges</h3>\n<p>Despite the government's initiatives, the MSME sector still faces challenges such as limited access to credit, high credit costs, and lack of liquidity. The sector also requires support in terms of infrastructure, technology, and skills development to compete in the global market.</p>\n\n<h3>Way Forward</h3>\n<p>To address the challenges faced by the MSME sector, the government needs to continue its support through initiatives such as the SME Growth Fund. Additionally, the sector requires support from other stakeholders, including banks, financial institutions, and the private sector, to provide access to credit, technology, and markets.</p>\n\n<h3>Prelims Facts</h3>\n<p>The MSME sector is the second-largest employer in the country, after agriculture. The sector contributes around 30% to the country's GDP and accounts for around 45% of the country's total exports.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic can be categorized under GS Paper III, which covers topics related to the Indian economy, including economic growth, development, and planning. Specifically, it can be categorized under the sub-topic of \"Economic Growth and Development\" and \"Industry and Infrastructure\".</p>",
    "category": "GS-3"
  },
  {
    "headline": "Union Budget 2026: Govt proposes to top up Self Reliant India Fund with Rs 4,000 crore in FY27 to support MSMEs",
    "summaryText": "<h3>Why in News</h3>\n<p>The Union Budget 2026 has proposed to top up the Self Reliant India Fund with Rs 4,000 crore in FY27 to support MSMEs, as announced by the government.</p>\n\n<h3>Background</h3>\n<p>The Self Reliant India Fund was established to provide financial support to Micro, Small, and Medium Enterprises (MSMEs) in India, with the aim of promoting self-reliance and entrepreneurship in the sector.</p>\n\n<h3>Key Highlights</h3>\n<p>The key highlights of the proposal include: \n- Allocation of Rs 4,000 crore to the Self Reliant India Fund in FY27.\n- The fund will provide financial support to MSMEs, focusing on promoting self-reliance and entrepreneurship.\n- The move is expected to boost the growth and development of MSMEs in India.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The proposal is in line with the government's vision to promote MSMEs and entrepreneurship in India, as outlined in various policies and schemes, including the Micro, Small, and Medium Enterprises Development Act, 2006.</p>\n\n<h3>Significance</h3>\n<p>The proposal to top up the Self Reliant India Fund is significant, as it will provide much-needed financial support to MSMEs, which are a crucial sector in the Indian economy, contributing to employment, growth, and development.</p>\n\n<h3>Challenges</h3>\n<p>Despite the proposal, MSMEs in India continue to face challenges, including access to finance, competition from larger enterprises, and regulatory hurdles, which need to be addressed to ensure the effective implementation of the fund.</p>\n\n<h3>Way Forward</h3>\n<p>The way forward involves effective implementation of the fund, ensuring that the allocated amount reaches the intended beneficiaries, and addressing the challenges faced by MSMEs, to promote self-reliance and entrepreneurship in the sector.</p>\n\n<h3>Prelims Facts</h3>\n<p>Key facts for prelims include: \n- The Self Reliant India Fund was established to support MSMEs.\n- The fund will be topped up with Rs 4,000 crore in FY27.\n- The move aims to promote self-reliance and entrepreneurship in the MSME sector.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>The topic can be categorized under GS Paper 3, which includes topics related to Indian economy, economic growth, and development, including government schemes and policies for promoting entrepreneurship and self-reliance.</p>",
    "category": "GS-3"
  },
  {
    "headline": "Congress leaders accepted Partition as only way forward: New NCERT book",
    "summaryText": "<h3>Why in News</h3>\n<p>A new NCERT book has been released, which states that Congress leaders accepted Partition as the only way forward.</p>\n\n<h3>Background</h3>\n<p>The book highlights the historical context surrounding the Partition of India and the role of Congress leaders in accepting it as a solution.</p>\n\n<h3>Key Highlights</h3>\n<p>The book mentions that the Congress leaders, including Jawaharlal Nehru and Mahatma Gandhi, eventually accepted the Partition plan due to the mounting pressure and violence in the country.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The Indian Independence Act, 1947, paved the way for the Partition of India, which led to the creation of two separate nations: India and Pakistan.</p>\n\n<h3>Significance</h3>\n<p>The acceptance of Partition by Congress leaders marked a significant turning point in Indian history, shaping the country's future and its relations with neighboring nations.</p>\n\n<h3>Challenges</h3>\n<p>The Partition led to massive displacement, violence, and loss of life, posing significant challenges for the newly formed governments of India and Pakistan.</p>\n\n<h3>Way Forward</h3>\n<p>The book emphasizes the need to learn from the past and work towards building stronger relations between India and its neighboring countries, promoting peace and cooperation in the region.</p>\n\n<h3>Prelims Facts</h3>\n<p>Key facts to remember: The Indian Independence Act, 1947, the role of Congress leaders in accepting Partition, and the significance of the event in Indian history.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic can be categorized under GS Paper 1: History of India and the Indian National Movement.</p>",
    "category": "GS-1"
  },
  {
    "headline": "ISRO rocket LVM-3 places 6000-kg US satellite – its heaviest – into orbit",
    "summaryText": "<h3>Why in News</h3>\n<p>The Indian Space Research Organisation (ISRO) has successfully launched its heaviest satellite, a 6000-kg US satellite, into orbit using the LVM-3 rocket.</p>\n\n<h3>Background</h3>\n<p>The LVM-3 rocket, also known as the Geosynchronous Satellite Launch Vehicle Mark III (GSLV Mk III), is a heavy-lift launch vehicle developed by ISRO. It has a payload capacity of up to 8000 kg to Geosynchronous Transfer Orbit (GTO).</p>\n\n<h3>Key Highlights</h3>\n<p>The LVM-3 rocket has placed the 6000-kg US satellite into a Geosynchronous Transfer Orbit (GTO). This is the heaviest satellite launched by ISRO to date. The launch demonstrates ISRO's capability to launch heavy satellites into orbit.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The launch is in line with the Indian Space Policy, which aims to promote the use of space technology for national development. The launch also complies with international regulations and guidelines for space launches.</p>\n\n<h3>Significance</h3>\n<p>The successful launch of the LVM-3 rocket with a heavy satellite has significant implications for India's space program. It demonstrates ISRO's capability to launch heavy satellites and opens up new opportunities for commercial satellite launches.</p>\n\n<h3>Challenges</h3>\n<p>ISRO faces challenges in terms of increasing competition in the global satellite launch market. The organization must continue to develop and improve its launch vehicles to remain competitive.</p>\n\n<h3>Way Forward</h3>\n<p>ISRO plans to continue developing its launch vehicles, including the LVM-3 rocket, to meet the growing demand for satellite launches. The organization also aims to expand its commercial satellite launch services.</p>\n\n<h3>Prelims Facts</h3>\n<p>LVM-3 rocket, Geosynchronous Satellite Launch Vehicle Mark III (GSLV Mk III), payload capacity of up to 8000 kg to Geosynchronous Transfer Orbit (GTO), heaviest satellite launched by ISRO.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>Science and Technology, Space Technology, Indian Space Research Organisation (ISRO), Satellite Launches.</p>",
    "category": "GS-3"
  },
  {
    "headline": "Budget’s STT hike, lack of positive triggers batter stocks as market slumps 2%",
    "summaryText": "<h3>Why in News</h3>\n<p>The recent budget announcement has led to a hike in Securities Transaction Tax (STT), resulting in a significant slump in the stock market, with a 2% decline in market value.</p>\n\n<h3>Background</h3>\n<p>The Securities Transaction Tax (STT) is a tax levied on the purchase and sale of securities in India. The STT was introduced in 2004 to reduce the burden of taxation on investors and to increase market transparency.</p>\n\n<h3>Key Highlights</h3>\n<p>The budget has proposed an increase in STT on certain transactions, including options and futures contracts. This move is expected to increase revenue for the government but has been met with disappointment from market participants.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The STT is governed by the Securities Contracts (Regulation) Act, 1956, and the Income-tax Act, 1961. The hike in STT is within the purview of the government's power to levy taxes on securities transactions.</p>\n\n<h3>Significance</h3>\n<p>The increase in STT is expected to have a significant impact on the stock market, as it may lead to higher transaction costs for investors and reduce market liquidity. This, in turn, may affect the overall economic growth of the country.</p>\n\n<h3>Challenges</h3>\n<p>The hike in STT poses challenges for market participants, including investors, brokers, and exchanges. It may lead to a decline in trading volumes and a decrease in investor confidence in the market.</p>\n\n<h3>Way Forward</h3>\n<p>To mitigate the impact of the STT hike, the government and regulatory bodies may need to consider measures to increase market liquidity and reduce transaction costs. This could include introducing new trading mechanisms or providing incentives for investors.</p>\n\n<h3>Prelims Facts</h3>\n<p>Securities Transaction Tax (STT) is a tax levied on the purchase and sale of securities in India. The STT was introduced in 2004. The budget has proposed an increase in STT on certain transactions.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic can be categorized under GS Paper 3, which includes topics related to economic development, industrial policy, and stock markets.</p>",
    "category": "GS-1"
  },
  {
    "headline": "The 27th amendment, Pakistan’s democratic dilemma",
    "summaryText": "<h3>Why in News</h3>\n<p>The 27th amendment in Pakistan has been in news due to its potential impact on the country's democratic setup and the ongoing political crisis.</p>\n\n<h3>Background</h3>\n<p>Pakistan has a history of constitutional amendments, with the 27th amendment being the latest in the series. The amendment has been introduced to extend the tenure of the military courts, which has sparked a debate about the balance of power between the military and civilian institutions in the country.</p>\n\n<h3>Key Highlights</h3>\n<p>The 27th amendment aims to extend the tenure of the military courts for another two years, allowing them to try civilians for certain offenses. The amendment has been opposed by several political parties, who argue that it undermines the independence of the judiciary and the democratic process.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The 27th amendment has been introduced under Article 175 of the Pakistani Constitution, which deals with the establishment and jurisdiction of the military courts. The amendment has also been challenged in the Supreme Court, with petitioners arguing that it violates the fundamental rights of citizens.</p>\n\n<h3>Significance</h3>\n<p>The 27th amendment has significant implications for Pakistan's democratic setup and the balance of power between the military and civilian institutions. The amendment could potentially undermine the independence of the judiciary and the democratic process, leading to a further concentration of power in the hands of the military.</p>\n\n<h3>Challenges</h3>\n<p>The 27th amendment poses several challenges for Pakistan's democratic institutions, including the potential for a further erosion of civilian control over the military and the undermining of the independence of the judiciary. The amendment also poses a challenge to the country's human rights record, as the military courts have been criticized for their lack of transparency and accountability.</p>\n\n<h3>Way Forward</h3>\n<p>To address the challenges posed by the 27th amendment, Pakistan needs to strengthen its democratic institutions and ensure that the military is accountable to civilian authorities. The country also needs to improve its human rights record and ensure that the military courts are transparent and accountable.</p>\n\n<h3>Prelims Facts</h3>\n<p>Pakistan's Constitution: Adopted on August 14, 1973, Article 175: Establishment and jurisdiction of military courts.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>GS Paper II: Polity, Governance, and International Relations.</p>",
    "category": "GS-2"
  },
  {
    "headline": "Centre rejects RTI seeking details of pre-legislative consultations on VB-G RAM G Act",
    "summaryText": "<h3>Why in News</h3>\n<p>The Centre has rejected an RTI seeking details of pre-legislative consultations on the Virtual Private Network (VPN) and Virtual Private Server (VPS) based Business to Business (B2B) Voice over Internet Protocol (VoIP) services under the VB-G RAM G Act.</p>\n\n<h3>Background</h3>\n<p>The VB-G RAM G Act is a proposed legislation that aims to regulate the use of VPNs and VPSs in India. The Act is expected to have significant implications for businesses and individuals who use these services.</p>\n\n<h3>Key Highlights</h3>\n<p>The RTI was filed to seek information on the pre-legislative consultations held on the proposed Act. However, the Centre has rejected the RTI citing exemptions under the RTI Act.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The RTI Act, 2005, provides for the right to information to citizens of India. However, the Act also provides for certain exemptions, including those related to national security and commercial confidentiality.</p>\n\n<h3>Significance</h3>\n<p>The rejection of the RTI has significant implications for transparency and accountability in the legislative process. It also raises concerns about the lack of public consultation on important policy issues.</p>\n\n<h3>Challenges</h3>\n<p>The rejection of the RTI highlights the challenges faced by citizens in seeking information from the government. It also underscores the need for greater transparency and accountability in the legislative process.</p>\n\n<h3>Way Forward</h3>\n<p>To address these challenges, the government should consider making the legislative process more transparent and inclusive. This could include providing greater access to information and facilitating public consultation on important policy issues.</p>\n\n<h3>Prelims Facts</h3>\n<p>VB-G RAM G Act: proposed legislation to regulate VPNs and VPSs in India. RTI Act, 2005: provides for the right to information to citizens of India.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>Polity and Governance: transparency and accountability in the legislative process, right to information, exemptions under the RTI Act.</p>",
    "category": "GS-2"
  }
]