[
  {
    "headline": "Vice President Confers Degrees on Over 1.2 Lakh Students at DU’s 102nd Convocation",
    "summaryText": "<p>Vice President's Secretariat</p><p>Vice President Confers Degrees on Over 1.2 Lakh Students at DU’s 102nd Convocation Over 50% Graduates and Over 70% Gold Medallists are Women: Vice-President Applauds Rise of Women’s EducationYouth Key to Realising Viksit Bharat @ 2047: Vice-PresidentNation First 'Rashtra Pratham' Must Guide Young Minds: Vice PresidentDegree Is Not Just a Certificate but a Commitment: Vice-PresidentSay No to Drugs, Use Social Media Responsibly: Vice President to Graduates</p><p>The Vice-President of India and Chancellor of the University of Delhi, Shri C. P. Radhakrishnan, graced as the Chief Guest at the 102nd Convocation of the University of Delhi today and conferred degrees upon over 1.2 lakh graduates.</p><p>The Vice-President of India and Chancellor of the University of Delhi, Shri C. P. Radhakrishnan, graced the 102nd Convocation of the University today as the Chief Guest and conferred degrees upon over 1.2 lakh graduates. He lauded the University’s remarkable 104-year journey and… pic.twitter.com/J6NKWsSDye</p><p>Addressing the gathering, The Vice-President lauded the University’s remarkable 104-year journey and its unwavering commitment to academic excellence and continuity.</p><p>Tracing its historic evolution, he observed that the University began with just three colleges, two faculties, eight departments, a modest library of gifted books, and 750 students. Today, it comprises 16 faculties, 86 departments, 90 colleges, 20 halls and hostels, more than 30 centres and institutes, 34 libraries, and over six lakh students. “Delhi University has indeed come a long way in its historic journey,” he remarked.</p><p>Appreciating the scale of the ceremony, the Vice-President remarked that the total number of graduating students is more than the population of many countries, reflecting the vast academic footprint of the University.</p><p>Describing the University as one of India’s most distinguished institutions of higher learning, the Vice-President said that for over a century it has nurtured minds that have gone on to lead India’s intellectual, political, scientific, and cultural life. He told the graduating students that they now join a remarkable lineage of alumni who have shaped not only India but the world.</p><p>Highlighting the University’s growing academic stature, he expressed satisfaction over its consistently improving national and international rankings. He noted that the University has retained the number one position among Indian universities in the QS World University Rankings for four consecutive years.</p><p>The Vice-President said that Convocation is not merely a ceremonial event; it marks both an ending and a beginning. It celebrates years of study, discipline, friendships, examinations, and self-discovery, while also signalling the graduates’ formal induction into a larger arena, the arena of responsibility.</p><p>He observed that the graduates are stepping into a world undergoing profound transformation. Technology is reshaping industries, artificial intelligence is redefining the nature of work, climate change is challenging models of growth, and democracies across the globe are being tested. In such a world, he said, a degree is not just a certificate but a commitment, a commitment to serve society, to use one’s skills for the greater good, to live not only for oneself but also for the betterment of the nation, and above all, to uphold the principle of “Nation First -Rashtra Pratham.”</p><p>Referring to India’s journey towards Viksit Bharat @ 2047, the Vice-President said that at this crucial juncture, the role of the youth assumes even greater significance. Under the leadership and vision of the Prime Minister, Shri Narendra Modi, he said, India has articulated the aspiration of becoming an Aatmanirbhar Bharat and building a Viksit Bharat ,a developed India by 2047, when the nation will celebrate 100 years of Independence.</p><p>He emphasized that Aatmanirbharta is the capacity to innovate, manufacture, research, and create solutions rooted in Indian realities yet globally competitive. It calls upon universities to become engines of research, entrepreneurship, and indigenous knowledge systems. Viksit Bharat, he added, stands for inclusive growth, technological leadership, social harmony, environmental sustainability, and transparent and accountable institutions. It aims to ensure that development reaches the last citizen and that opportunity becomes a promise to all.</p><p>Addressing the graduates as architects of this vision, the Vice-President said that whether they become scientists, civil servants, entrepreneurs, artists, lawyers, teachers, or innovators, they will shape the India of 2047. The realization of Aatmanirbhar Bharat and Viksit Bharat, he said, will depend on their integrity, competence, compassion, and innovative spirit.</p><p>The Vice-President expressed happiness that over 50 percent of graduates and more than 70 percent of the gold medallists are women. He also noted that the number of women receiving degrees this year exceeds that of men. He described this as a reflection of the phenomenal growth of women’s education in India. He extended his blessings and best wishes to all graduating students for their well-deserved success earned through sustained hard work.</p><p>In his concluding remarks, the Vice-President urged the graduates to carry forward the spirit of inquiry and to remember that learning is a lifelong process. He called upon them to remain grateful for the opportunities they have received and mindful of the responsibilities that accompany them. He also urged them to say “No to Drugs” and to use social media constructively rather than becoming enslaved by it.</p><p>The convocation was attended by the Vice-Chancellor of the University of Delhi, Prof. Yogesh Singh, faculty members, other dignitaries, and students.</p>",
    "category": "Environment",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233839&reg=3&lang=1"
  },
  {
    "headline": "The Evolving Spectrum of Energy Sources",
    "summaryText": "<p>The Evolving Spectrum of Energy Sources</p><p>Every day, as lights turn on across homes, schools, farms, factories, and hospitals, we rarely think about where that energy comes from. The fan that cools a classroom, the pump that waters a field, and the train that carries passengers all depend on a vast and carefully managed energy system working silently in the background.</p><p>Today, that system in India is changing. As the country advances, the focus is on ensuring reliable, affordable, cleaner, and more secure energy for every household and enterprise.</p><p>Improved power availability has been a key outcome of ongoing reforms. The average electricity availability in rural areas has increased from 12.5 hours in 2014 to 22.6 hours, while urban areas now enjoy up to 23.4 hours of power supply, up from 22.1 hours in 2014. These improvements reflect significant progress in the reliability and reach of electricity services across the country.</p><p>Today, India is among the world’s top three energy consumers, and electricity demand continues to grow every year. The total electricity generation increased from 1,739.09 Billion Units (BU) in 2023–24 to 1,829.69 BU in 2024–25, a growth of 5.21%. For 2025–26, the generation target has been set at 2,000.4 BU.</p><p>This shift is being shaped by clear government initiatives, from scaling renewable energy and launching the National Green Hydrogen Mission, to modernising nuclear laws through the Sustainable Harnessing and Advancement of Nuclear Energy for Transforming India (SHANTI) Act, strengthening energy efficiency, reforming power distribution, and building digital energy infrastructure.</p><p>India’s evolving energy spectrum is not about abandoning the old overnight. It is about carefully building the new, step by step, so that the country can power growth, improve livelihoods, and move toward its long-term commitment of achieving Net Zero emissions by 2070.</p><p>Scaling Renewable Energy: From Expansion To Global Leader</p><p>India’s renewable energy expansion reflects a policy-driven transformation that combines scale, speed, manufacturing depth, and global engagement. Meanwhile, according to the International Renewable Energy Agency (IRENA)’s Renewable Energy Statistics 2025, India ranks fourth globally in total installed renewable energy capacity.</p><p>Solar energy, in particular, has seen rapid growth; installed solar capacity rose from 3 GW in 2014 to 140 GW in January 2026. This increase has helped push non-fossil fuel capacity beyond 50 percent of total installed electricity capacity.</p><p>Wind energy also plays a substantial role: India’s cumulative installed wind capacity reached about 54.65 GW by January 2026, contributing significantly to the renewable mix and strengthening grid diversification alongside solar. Together, solar and wind account for a dominant share of India’s clean energy capacity.</p><p>Government programmes have supported this scale-up across households, agriculture, infrastructure, and manufacturing:</p><p>PM Surya Ghar has enabled 23.9 lakh households to install rooftop solar systems, adding 7 GW of distributed clean energy capacity.</p><p>Pradhan Mantri Kisan Urja Suraksha evam Utthaan Mahabhiyaan (PM-KUSUM) promotes solarisation in agriculture, reducing diesel dependence and stabilising farm energy supply. The scheme aims to install 14 lakh standalone pumps (by 31.03.2026), promoting clean rural energy use.</p><p>55 solar parks across 13 states, have been approved, with a sanctioned capacity of nearly 40 GW, accelerating large-scale deployment.</p><p>The Production Linked Incentive (PLI) Scheme, with an outlay of ₹24,000 crore, is strengthening domestic solar manufacturing and reducing import dependence.</p><p>Renewable expansion now spans generation, infrastructure, manufacturing, and global engagement. The focus has shifted from simply adding capacity to building a competitive and self-reliant clean energy ecosystem.</p><p>Green Hydrogen: Building the Next Energy Frontier</p><p>Green hydrogen has emerged as a key pillar of India’s clean energy transition, particularly for sectors where reducing emissions is difficult, such as steel, fertilisers, refining, shipping, and heavy transport.</p><p>Green Hydrogen is Hydrogen produced using renewable energy, such as solar or wind power, instead of fossil fuels. In this process, water is split into hydrogen and oxygen through electrolysis, using electricity from solar panels or wind turbines. According to standards notified by Govt of India, Hydrogen made this way is considered “green” if the total emissions from the process are very low, not more than 2 kg of CO₂ equivalent for every 1 kg of Hydrogen produced, taken as an average over last 12-month period. Green Hydrogen can also be produced by converting biomass (like agricultural waste) into hydrogen, as long as emissions remain below the same limit.</p><p>India has set a target of producing 5 million metric tonnes (MMT) of green hydrogen annually by 2030 under the National Green Hydrogen Mission (NGHM), launched in 2023. The Mission is expected to:</p><p>Attract over ₹8 lakh crore in investments</p><p>Reduce fossil fuel imports by more than ₹1 lakh crore</p><p>Avoid nearly 50 MMT of greenhouse gas emissions annually by 2030</p><p>To support this scale-up, the government has approved an outlay of ₹19,744 crore till FY 2029–30, including ₹17,490 crore under the SIGHT programme, which provides incentives for domestic electrolyser manufacturing and hydrogen production.</p><p>Implementation is already underway:</p><p>India’s first port-based green hydrogen pilot has been commissioned.</p><p>Hydrogen mobility pilots are operational across 10 routes, involving buses and trucks.</p><p>The Green Hydrogen Certification Scheme (2025) ensures that hydrogen produced in India meets defined emission standards, strengthening credibility for domestic and export markets.</p><p>Green hydrogen connects renewable energy expansion with industrial decarbonisation. It is positioned not only as an environmental solution but also as a strategic tool for energy security, manufacturing growth, and global competitiveness. Nuclear, solar, and wind energy, green hydrogen, battery storage, and critical minerals to address both energy security and transition imperatives. Together, these measures position green hydrogen as the next frontier in India’s evolving energy spectrum.</p><p>Nuclear Energy: Legislative Modernisation and Baseload Expansion</p><p>Nuclear energy provides steady, round-the-clock electricity with very low greenhouse gas emissions. As renewable energy expands, nuclear power plays an important role in ensuring grid stability and a reliable baseload supply.</p><p>India’s present nuclear capacity stands at 8.78 GW. With new reactors under development, capacity is projected to rise to 22.38 GW by 2031–32. The Government has further announced a long-term Nuclear Energy Mission with a vision of achieving 100 GW by 2047, aligning nuclear expansion with India’s clean energy and energy security goals.</p><p>A major institutional reform supporting this expansion is the Sustainable Harnessing and Advancement of Nuclear Energy for Transforming India (SHANTI) Act, 2025. The Act consolidates and modernises India’s nuclear legal framework. It:</p><p>Enables limited private sector participation under regulatory oversight</p><p>Grants statutory recognition to the Atomic Energy Regulatory Board (AERB)</p><p>Introduces a graded liability framework</p><p>Strengthens safety, security, and safeguards</p><p>Retains sovereign control over sensitive nuclear fuel-cycle activities</p><p>Complementing large reactors, the Nuclear Energy Mission allocates ₹20,000 crore for the development of Small Modular Reactors (SMRs), targeting at least five indigenously designed SMRs by 2033. These advanced reactors are designed to be more flexible, scalable, and suitable for diverse energy needs.</p><p>Strengthening Energy Efficiency & Carbon Markets</p><p>Energy efficiency is not only about producing clean energy, but it is also about using energy wisely. It means accomplishing the same tasks while consuming less electricity, fuel, or heat. This lowers costs and improves system reliability, while conservation focuses on avoiding waste.</p><p>India has strengthened its efficiency framework through policy reform and market-based mechanisms over the years.</p><p>A major shift has been the transition from the Perform, Achieve and Trade (PAT) scheme to the Carbon Credit Trading Scheme (CCTS). Under CCTS:</p><p>Emission-intensive industries are assigned greenhouse gas intensity targets.</p><p>Entities that perform better than their targets earn tradable carbon credits.</p><p>Credits can be bought and sold, creating a market incentive for efficiency improvements.</p><p>At the household level, energy efficiency programmes are being implemented to promote the adoption of efficient appliances and lighting. The UJALA programme has distributed 36.87 crore LED bulbs, resulting in:</p><p>47,883 million kWh of annual energy savings</p><p>3.88 million tonnes of CO₂ reduction per year</p><p>Do You Know? UJALA’s LED-bulb distribution model is being exported beyond India. The state of Melaka in Malaysia adopted a UJALA-type scheme under an agreement with Energy Efficiency Services Limited (EESL). Earlier, the government had launched UJALA-UK to promote efficient lighting.</p><p>Digital platforms such as the Urja Dakshata Information Tool (UDIT) further improve transparency, monitoring, and compliance across sectors.</p><p>Energy efficiency reduces demand pressure on the grid while complementing renewable expansion. It ensures that growth in electricity access does not automatically lead to proportionate growth in emissions.</p><p>Power Sector Reforms and Distribution Strengthening</p><p>Reliable electricity depends not only on how power is generated, but also on how efficiently it is transmitted, distributed, billed, and managed. Strengthening the distribution system has therefore been a central focus of reform.</p><p>Under Deen Dayal Upadhyaya Gram Jyoti Yojana (DDUGJY), Integrated Power Development Scheme (IPDS), and Pradhan Mantri Sahaj Bijli Har Ghar Yojana (SAUBHAGYA), about ₹1.85 lakh crore was invested to upgrade distribution infrastructure. As a result, 18,374 villages were electrified, and 2.86 crore households gained electricity connections, significantly expanding access across the country.</p><p>The next phase of reform has focused on improving the financial and operational health of DISCOMs. The Revamped Distribution Sector Scheme (RDSS), launched in 2021 with an outlay of ₹3.03 lakh crore, has approved projects worth ₹2.8 lakh crore to modernise infrastructure and implement smart metering.</p><p>As part of this digital transformation, 5.62 crore smart electricity meters have been installed across the country under various schemes. These meters improve billing accuracy, reduce technical and commercial losses, and enable better demand management through near real-time data.</p><p>Legislative reform complements these structural improvements. The proposed draft Electricity (Amendment) Bill, 2026, seeks to strengthen the financial viability of the sector, enhance the competitiveness of the Indian industry, promote optimal utilization of the distribution network, and improve regulatory accountability.</p><p>Draft National Electricity Policy, 2026, lays out strategies for achieving the vision of providing reliable 24x7 quality power through a financially viable and environmentally sustainable power sector, furthering energy security at an affordable price.</p><p>India Energy Stack (IES): From Energy Access to Energy Agency</p><p>IES is a Digital Public Infrastructure (DPI) designed to enable trusted digital interactions across consumers, utilities, regulators, and distributed energy assets. Conceived to address fragmented data systems and costly integrations, IES will provide common digital rails based on open standards and consent-based data sharing, while ensuring that data remains with rightful owners.</p><p>The initiative standardises data exchange to help create an ecosystem that is , interoperable, competitive, and capable of converting participation into economic value .</p><p>IES aims to transform consumers into active energy participants by enabling:</p><p>Portable and simplified onboarding across utilities</p><p>Meaningful consumer choice through consent-based data sharing</p><p>Monetisation of rooftop solar, batteries, EV chargers, and flexible loads at scale</p><p>By embedding “policy as code” and enabling near real-time settlement, IES strengthens transparency, reduces disputes, and enhances grid coordination. By aligning open innovation with system efficiency and livelihood creation, IES strengthens the energy agency, giving consumers the ability to choose and earn from the energy transition at scale.</p><p>Global Leadership and Strategic Partnerships</p><p>As India strengthens its domestic energy transition, it is also shaping global conversations on clean energy, affordability, and sustainability. International partnerships complement national reforms and position India as an active contributor to global energy solutions.</p><p>India plays a leading role in multilateral platforms such as the G20 Energy Transitions Working Group, where it has advanced cooperation on clean fuels and energy security. During its G20 Presidency, India launched the Global Biofuels Alliance (GBA), which now includes 25 countries and 12 international organisations, promoting affordable and low-carbon biofuels worldwide.</p><p>The country has further strengthened cooperation in energy efficiency by joining the International Energy Efficiency Hub (2024), aligning domestic initiatives with global best practices.</p><p>Under the UNFCCC framework, India has committed to achieving Net Zero by 2070, reducing the emissions intensity of GDP by 45% by 2030, reflecting its balanced approach to growth and climate responsibility.</p><p>Together, these engagements position India as a constructive voice of the Global South on affordable clean energy, equitable climate finance, and access to technology.</p><p>India’s global clean energy outreach is anchored in two major initiatives, the International Solar Alliance (ISA) and India Energy Week (IEW), both together advance solar cooperation and broader energy dialogue at the international level.</p><p>International Solar Alliance (ISA): Co-founded by India, ISA brings together over 125 member and signatory countries to mobilise solar finance, promote technology transfer, and expand affordable solar deployment, particularly across developing nations.</p><p>India Energy Week (IEW): Hosted by India, IEW serves as a global platform for governments, industry leaders, investors, and technology providers to engage on energy security, clean fuels, renewables, and transition pathways, strengthening India’s role as a convenor in the global energy landscape.</p><p>India’s energy journey is no longer defined by a single source; it’s now drawing strength from solar parks, rooftop panels, hydrogen pilots, modernised nuclear frameworks, smart meters, and digital platforms.</p><p>Milestones such as expanding renewable capacity, advancing the National Green Hydrogen Mission, strengthening DISCOMs, and building the India Energy Stack reflect a transition that is both structured and forward-looking. This transformation is not sudden. It is planned. It is layered. And it is supported by policy reform, infrastructure investment, technological innovation, and global cooperation.</p><p>As India moves toward its Net Zero 2070 commitment, the evolving spectrum of energy sources shows that growth and sustainability can move together. The power that supports homes, farms, factories, and data centres will come from a system designed to be resilient, inclusive, and prepared for future needs.</p><p>India is not just generating power. It is redesigning how power is produced, delivered, and shared for a future that is secure, sustainable, and self-reliant.</p><p>Ministry of Petroleum & Natural Gas (MoPNG)</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2036867&reg=3&lang=2 https://mopng.gov.in/en/page/68 https://www.pib.gov.in/PressReleasePage.aspx?PRID=1809204</p><p>Ministry of New and Renewable Energy (MNRE)</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2071486 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2183434 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208694 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2144627 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2117501 https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2200441 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2156173 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2110283 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2042069 https://www.pib.gov.in/PressReleasePage.aspx?PRID=1763712 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2183866 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2176518 https://www.pib.gov.in/PressReleasePage.aspx?PRID=1943779 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2041641 https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2111106 https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2004187 https://www.pib.gov.in/PressReleasePage.aspx?PRID=1795071 https://www.pib.gov.in/PressReleasePage.aspx?PRID=1961797</p><p>https://mnre.gov.in/en/physical-progress/ https://mnre.gov.in/en/year-wise-achievement https://mnre.gov.in/en/policies-and-regulations/schemes-and-guidelines/schemes/ https://mnre.gov.in/en/wind-policy-and-guidelines/ https://mnre.gov.in/en/national-green-hydrogen-mission https://pmkusum.mnre.gov.in/#/landing https://pmsuryaghar.gov.in/ https://cdnbbsr.s3waas.gov.in/s3716e1b8c6cd17b771da77391355749f3/uploads/2025/11/202511061627678782.pdf</p><p>https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2166110&reg=3&lang=2</p><p>https://mnre.gov.in/en/national-green-hydrogen-mission/</p><p>https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2165811&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2039091&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2138051&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2023625&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2075049&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2030686&reg=3&lang=2</p><p>https://www.indiaenergyweek.com/</p><p>https://www.pib.gov.in/PressNoteDetails.aspx?id=155063 https://www.pib.gov.in/PressNoteDetails.aspx?id=154717</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2215187&reg=3&lang=2</p><p>Ministry of Home Affairs (MHA)</p><p>https://ndmindia.mha.gov.in/ndmi/leadership-initiatives</p><p>Ministry of Environment, Forest & Climate Change (MoEFCC)</p><p>https://missionlife-moefcc.nic.in/</p><p>https://www.niti.gov.in/sites/default/files/2022-11/Mission_LiFE_Brochure.pdf https://niti.gov.in/key-initiatives/life</p><p>Parliament of India / Sansad</p><p>https://sansad.in/ls/legislation/bills https://sansad.in/getFile/annex/269/AU1111_Djrfhp.pdf?source=pqars https://sansad.in/getFile/loksabhaquestions/annex/185/AU491_lHmqAc.pdf?source=pqars https://sansad.in/getFile/loksabhaquestions/annex/186/AU1638_Yolfxg.pdf?source=pqals https://sansad.in/getFile/loksabhaquestions/annex/186/AU490_gwc1C9.pdf?source=pqals</p><p>https://www.indiabudget.gov.in/economicsurvey/</p><p>https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=1847812&reg=3&lang=2 https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=1837898&reg=3&lang=2</p><p>PIB Archived / Static Document</p><p>https://static.pib.gov.in/WriteReadData/specificdocs/documents/2022/nov/doc2022119122601.pdf</p><p>https://www.pib.gov.in/PressNoteDetails.aspx?id=156593&NoteId=156593&ModuleId=3&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2199729&reg=3&lang=1</p><p>https://www.pib.gov.in/PressNoteDetails.aspx?NoteId=156480&ModuleId=3&reg=3&lang=2#:~:text=Recognising%20their%20importance%2C%20India%20observes,contributions%20towards%20efficient%20energy%20use.</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2219208&reg=3&lang=1</p>",
    "category": "Environment",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003M3DI.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004JL3V.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image006U0AG.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image007AMMP.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image009R7J7.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233832&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister Reaffirms Resolve to Harness Science and Technology for National Development and Global Good on National Science Day",
    "summaryText": "<p>Prime Minister Reaffirms Resolve to Harness Science and Technology for National Development and Global Good on National Science Day</p><p>The Prime Minister highlighted that, on National Science Day, we celebrate the spirit of research, innovation, and scientific curiosity that drives our nation forward.</p><p>PM Modi stated that, “This day commemorates the groundbreaking discovery of the Raman Effect by Sir CV Raman”. The Prime Minister noted that this discovery placed Indian research firmly on the global map.</p><p>The Prime Minister reaffirmed that our resolve to empower our youth, strengthen research ecosystems, and harness science and technology for national development and global good.</p><p>The Prime Minister wrote on X;</p><p>Today, on National Science Day, we celebrate the spirit of research, innovation and scientific curiosity that drives our nation forward.</p><p>This day commemorates the groundbreaking discovery of the Raman Effect by Sir CV Raman. This discovery placed Indian research firmly on the global map.</p><p>We reaffirm our resolve to empower our youth, strengthen research ecosystems and harness science and technology for national development and global good.</p><p>Today, on National Science Day, we celebrate the spirit of research, innovation and scientific curiosity that drives our nation forward.This day commemorates the groundbreaking discovery of the Raman Effect by Sir CV Raman. This discovery placed Indian research firmly on the… pic.twitter.com/YcjOAdPosr</p><p>Read this release in: Urdu , हिन्दी , Assamese , Gujarati , Malayalam</p>",
    "category": "General",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233830&reg=3&lang=1"
  },
  {
    "headline": "MoCA Reviews Aviation Preparedness in View of Emerging Situation in the Middle East",
    "summaryText": "<p>Ministry of Civil Aviation</p><p>MoCA Reviews Aviation Preparedness in View of Emerging Situation in the Middle East</p><p>In view of the evolving situation in the Middle East and its potential impact on international air operations, the Hon’ble Minister of Civil Aviation has undertaken a comprehensive review of preparedness and response measures with all concerned stakeholders.</p><p>A high-level meeting through a video conference was convened with Secretary, Ministry of Civil Aviation and other senior officials of the Ministry, the Airports Authority of India (AAI), the Directorate General of Civil Aviation (DGCA), airline operators, and major airport operators across the country. The review focused on ensuring passenger safety, operational continuity and real-time coordination in light of multiple airspace restrictions and NOTAMs issued in parts of the region.</p><p>Indian carriers operating international services have been advised to continuously monitor airspace advisories, NOTAMs, and route restrictions issued by the concerned authorities. Airlines have been directed to ensure timely rerouting or diversion of flights, wherever required, strictly in accordance with global safety protocols and established contingency planning procedures.</p><p>Airports across the country, particularly major international gateways, have been placed on operational alert to manage potential flight diversions, unscheduled landings and passenger facilitation requirements. The Airports Authority of India and private airport operators have been advised to maintain enhanced coordination with airlines for ground handling, parking bays, passenger amenities, crew logistics and immigration support, as necessary.</p><p>The Directorate General of Civil Aviation has been advised to remain in close coordination with airlines to ensure full compliance with safety regulations, crew duty time limitations, and operational advisories. Further, continuous monitoring mechanisms should be activated to assess the evolving airspace dynamics and mitigate any cascading impact on domestic schedules.</p><p>The Ministry is also in close touch with the Ministry of External Affairs to ensure seamless information flow and appropriate coordination in case of any emergent requirements involving Indian carriers or Indian nationals abroad.</p><p>Passengers are advised to stay in regular contact with their respective airlines for updated travel information and schedule changes. Airlines have been instructed to proactively communicate with passengers regarding delays, rerouting, or diversions to minimize inconvenience.</p><p>The safety of passengers and crew remains paramount. The Ministry of Civil Aviation is closely monitoring the situation to ensure safe, orderly, and efficient air operations.</p><p>The situation is under constant watch. Further updates will follow as necessary.</p>",
    "category": "Infrastructure",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/100031232889DX.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/10003123215IGC.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/1000312317JCSB.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233955&reg=3&lang=1"
  },
  {
    "headline": "Two-day Workshop by DFS on Reservation Policy of Government of India and Accessibility for PwDs concludes today",
    "summaryText": "<p>Two-day Workshop by DFS on Reservation Policy of Government of India and Accessibility for PwDs concludes today Effective implementation of reservation policies and welfare measures across public financial institutions by strengthening institutional capacity key objectives of workshop</p><p>The Department of Financial Services (DFS), Ministry of Finance, Government of India, DFS organised a two-day workshop on 27-28 February 2026 at the Bank of Baroda (BoB) Academy, Ahmedabad. The workshop was on the implementation of the Government of India's Reservation Policy in Public Sector Banks (PSBs), Public Sector Insurance Companies (PSICs), Sectoral Regulators and Public Financial Institutions (PFIs), along with measures to enhance accessibility of financial services for Divyangjans (Persons with Disabilities).</p><p>The workshop was organised with the objective of strengthening institutional capacity to ensure uniform and effective implementation of reservation policies and welfare measures across public financial institutions. It also reaffirmed the Government's commitment in promoting inclusivity and equitable access to financial services.</p><p>The workshop was attended by senior functionaries from the Reserve Bank of India (RBI), Pension Fund Regulatory and Development Authority (PFRDA), Insurance Regulatory and Development Authority of India (IRDAI), representatives from all 12 Public Sector Banks, 7 Public Sector Insurance Companies and 7 Public Sector Financial Institutions.</p><p>Under the Sugamya Bharat initiative, a sensitisation session was conducted on accessibility standards and compliance requirements. This was followed by a roundtable discussion on legal provisions relating to accessibility, with participants deliberating on practical challenges, expectations versus ground realities, and sharing best practices for enhancing accessibility across institutions.</p><p>The workshop concluded with an interactive question-and-answer session, allowing participants to deliberate on operational challenges and actionable measures to further strengthen inclusivity, accessibility and uniform implementation of reservation policies across the financial services ecosystem.</p>",
    "category": "Economy",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image00101E7.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233948&reg=3&lang=1"
  },
  {
    "headline": "Indian Pharmacopoeia Commission (IPC) and Andhra Pradesh MedTech Zone (AMTZ) Organise National Meet on Strengthening Pharmacovigilance and Materiovigilance in India at Visakhapatnam",
    "summaryText": "<p>Ministry of Health and Family Welfare</p><p>Indian Pharmacopoeia Commission (IPC) and Andhra Pradesh MedTech Zone (AMTZ) Organise National Meet on Strengthening Pharmacovigilance and Materiovigilance in India at Visakhapatnam First-Ever National Annual Meet of PvPI and MvPI Regional Centres to Strengthen India’s Drug and Medical Device Safety Framework and Institutional CoordinationADR PvPI 2.0 Mobile Application Launched during the Meet to Enhance Real-Time Adverse Drug Reaction Reporting and Patient Safety Across IndiaFrom Awareness to Action: National Meet Drives Coordinated, Technology-Enabled Transformation of Drug and Medical Device Safety and Patient Protection in India</p><p>The Indian Pharmacopoeia Commission (IPC), Ministry of Health and Family Welfare, Government of India, in collaboration with the Andhra Pradesh MedTech Zone (AMTZ) organised a two-day National Meet on Strengthening Pharmacovigilance and Materiovigilance in India on 27-28 February 2026 at Andhra Pradesh MedTech Zone (AMTZ), Visakhapatnam. In a first-time ever national meet, the 1st Annual Meeting of Regional Centres participating in the Pharmacovigilance Programme of India (PvPI) and the Materiovigilance Programme of India (MvPI) was organised to strengthen India’s drug and medical device safety systems and enhance coordination among regulators, healthcare institutions, ADR Monitoring Centres (AMCs), and Medical Device Monitoring Centres (MDMCs). Senior officials from regulatory authorities, leading medical institutions, and representatives from the WHO Country Office for India participated in the deliberations.</p><p>The inaugural session was presided over by Dr V Kalaiselvan, Secretary-cum-Scientific Director, IPC, who underscored the need to transition from awareness-driven reporting to a performance-oriented pharmacovigilance framework with measurable outcomes. Senior leadership from leading AIIMS institutions, including Prof. Y K Gupta, Prof. Ashok Puranik, along with Dr Jitendra Sharma, Managing Director and Founder CEO, AMTZ, and Dr Kavita Kachroo, CEO, Kalam Institute of Health Technology, participated in the inaugural session and highlighted the importance of institutional collaboration in strengthening pharmacovigilance and materiovigilance systems across the country.</p><p>During the inaugural session, the ADR PvPI 2.0 Mobile Application was launched to facilitate ease of reporting, strengthen real-time data capture, and improve stakeholder engagement in adverse drug reaction monitoring across the country.</p><p>Technical sessions were conducted to review progress under PvPI and MvPI and to deliberate on key challenges including underreporting of adverse drug reactions, documentation gaps, and the need for strengthening medical device safety oversight. Discussions also focused on enhancing the performance of AMCs and MDMCs and promoting a culture of systematic reporting in healthcare institutions.</p><p>The second day of the meet was devoted to structured working group deliberations under the theme “Empowering India’s Pharmacovigilance and Materiovigilance: From Awareness to Action.” Along with the technical sessions, the working groups examined strategies to address underreporting, develop standardised frameworks for documentation and analysis of preventable adverse events, and expand pharmacovigilance and materiovigilance outreach beyond district-level healthcare facilities.</p><p>The recommendations emerging from the deliberations emphasised capacity building, standardisation of reporting practices, improved inter-institutional coordination, and integration of technology-enabled monitoring mechanisms to strengthen patient safety.</p><p>The meet concluded with a reaffirmation of IPC’s commitment to further strengthening India’s pharmacovigilance and materiovigilance ecosystem through coordinated and evidence-based interventions.</p><p>HFW/IPC and AMTZ Host National Meet to Strengthen India’s Pharmacovigilance & Materiovigilance Systems /28th February 2026/2</p>",
    "category": "Health",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0012L5G.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002ENBW.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003QGEF.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004TELK.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233933&reg=3&lang=1"
  },
  {
    "headline": "Hon’ble Minister of Tribal Affairs Addresses Press Briefing on Landmark National Initiatives Celebrating Tribal Art, Culture, Enterprise and Partnerships",
    "summaryText": "<p>Ministry of Tribal Affairs</p><p>Hon’ble Minister of Tribal Affairs Addresses Press Briefing on Landmark National Initiatives Celebrating Tribal Art, Culture, Enterprise and Partnerships “The forthcoming events will showcase pure tribal products and are a reflection of tribal knowledge, wisdom and heritage.”– Shri Jual Oram, Hon’ble Union Minister of Tribal Affairs</p><p>Under the visionary leadership of the Hon’ble Prime Minister, the Ministry of Tribal Affairs is organizing a series of landmark national initiatives in March 2026. These initiatives collectively present an integrated framework to preserve tribal heritage, promote creative excellence, strengthen entrepreneurship, expand market access, and deepen corporate partnerships for sustainable tribal development.</p><p>Addressing the Press Briefing today, the Hon’ble Minister of Tribal Affairs, Shri Jual Oram, detailed the scope and strategic vision of these initiatives. He highlighted how the upcoming programmes are designed to create long-term socio-economic impact by positioning tribal communities at the centre of cultural preservation, enterprise development, and national growth. On this occasion, Hon’ble Union Minister also formally unveiled the logo of Tribes Art Fest, Living Roots Festival – Soundscapes of Tribal India, and Bharat Tribes Fest 2026.</p><p>The Hon’ble Union Minister was joined by Shri Durgadas Uikey, Hon’ble Union Minister of State for Tribal Affairs, Smt. Ranjana Chopra, Secretary, Shri Anant Prakash Pandey, Joint Secretary, Shri M. Raja Murugan, Managing Director, TRIFED, and Shri Dharmendra Tewari, PIB.</p><p>Tribes Art Fest (TAF) 2026 | 02-13 March 2026; Travancore Palace, New Delhi</p><p>The Tribes Art Fest (TAF) 2026 will bring together over 70 eminent tribal artists and showcase nearly 1,000 artworks spanning 30 distinct tribal art forms from across the country. Conceived as a national platform for India’s tribal visual traditions, TAF will feature curated walkthroughs, live painting demonstrations, illustrated talks, mentorship workshops, participatory sessions and panel discussions bringing together artists, curators, designers and collectors. Special highlights include collaborations with contemporary practitioners, women-led live painting demonstrations and structured dialogues on pathways from heritage to market. By connecting tribal artists to national and global platforms through exhibition, market facilitation and capacity building, TAF seeks to enhance visibility, dignity and sustainable livelihood opportunities while positioning tribal art as a vital component of India’s creative economy.</p><p>The exhibition is also facilitating the direct sale of paintings by artists, enabling visitors and collectors to purchase artworks directly from the creators and thereby ensuring fair returns and stronger market linkages for tribal artists.</p><p>Living Roots Festival – The Soundscapes of Tribal India</p><p>13-15 March 2026, Bikaner House & India Gate</p><p>The Living Roots Festival will celebrate India’s living tribal music traditions through a three-day cultural intervention designed to reposition tribal music as a contemporary, respected and economically viable cultural force while remaining rooted in community ownership. The daytime segment at Bikaner House (1:30 PM – 5:00 PM) will feature keynote addresses, immersive showcases, panel discussions on preservation and innovation, and focused sessions on intellectual property rights, ownership and ethical collaboration. The evening cultural programmes at Kartavya Path (5:00 PM – 9:15 PM) will present fifteen curated performances across three days, representing diverse regions and traditions and bringing tribal soundscapes to one of India’s most iconic public spaces. Through performance, dialogue and mentorship, the festival aims to ensure sustained recognition and opportunity for tribal musicians.</p><p>Bharat Tribes Fest (BTF) 2026 | 18-30 March 2026, Sunder Nursery, New Delhi</p><p>Bharat Tribes Fest 2026 will serve as a comprehensive national marketplace and cultural platform, with participation of more than 1,000 tribal artisans, Van Dhan Vikas Kendras (VDVKs), tribal chefs and cultural troupes, showcasing art, craft and cuisine across more than 200 curated stalls. Major highlights include the Signature Pavilion featuring high-end tribal products and the launch of the Ministry’s “RISA” brand aimed at positioning tribal fashion and crafts in premium and global markets. An International Pavilion will host indigenous artisans from countries such as Australia, Fiji and Vietnam, fostering global tribal synergy. The Tribal Food Court, representing 21 states, live demonstrations, and evening cultural performances from multiple states will create immersive experiential zones that strengthen cultural exchange and national integration. The Fest is designed to enable direct market access and improve income realisation for tribal producers.</p><p>Tribal Business Conclave: A key pillar of Bharat Tribes Fest 2026 will be the 14-day National Business Conclave, structured to promote tribal entrepreneurship and integrate tribal enterprises into domestic and global value chains. The Conclave will host focused sessions on forest-based food value chains, sustainable textiles and handicrafts, ethical luxury positioning, innovation and technology integration, skilling and employment pathways, intellectual property protection and ethical commercialization of traditional knowledge, and community-led tourism models. It is expected to facilitate buyer-seller linkages, catalyse partnerships and generate actionable recommendations to strengthen tribal economic ecosystems.</p><p>CSR Summit | 24 March 2026, Sunder Nursery, New Delhi: The Ministry will host a National CSR Summit on 24 March 2026 to bring together corporate leaders, CSR heads, implementation partners and State Tribal Welfare Departments on a common platform. The Summit aims to present priority sectors requiring gap-filling CSR support, recognise corporate partners contributing to tribal development and facilitate structured collaborations aligned with national priorities. Ongoing CSR-funded initiatives include substantial investments by public sector undertakings towards digital education, space laboratories in EMRS, health and hygiene interventions for girl students, and capacity development programmes across multiple states. The Summit will also showcase the craftsmanship and potential of tribal products for corporate engagement and gifting.</p><p>Addressing the media, Hon’ble minister emphasised that these initiatives reflect a holistic approach integrating culture, commerce and corporate partnership. By bringing together art, music, enterprise development and strategic collaboration within one coordinated framework, the Ministry seeks to ensure that tribal communities are empowered participants in India’s cultural and economic transformation. The Hon’ble minister also requested media to help in mainstreaming tribal events and initiatives for a greater awareness among public. Collectively, these programmes reaffirm the Government of India’s commitment to safeguarding tribal identity, strengthening livelihoods, expanding market access and positioning tribal heritage at the centre of India’s inclusive growth narrative.</p><p>Collectively, these five landmark initiatives, Tribes Art Fest 2026, Living Roots Festival, Bharat Tribes Fest 2026, the Tribal Business Conclave and the CSR Summit, form an integrated national architecture for cultural preservation, economic empowerment and strategic partnership. By strengthening creative industries, expanding market access, formalising value chains, enabling entrepreneurship and catalysing corporate collaboration, these initiatives align with the Hon’ble Prime Minister’s vision of Viksit Bharat 2047 and position tribal communities not merely as beneficiaries, but as cultural leaders, economic contributors and equal stakeholders in India’s journey towards inclusive, sustainable and innovation-driven development.</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001TPX3.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002CDAF.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003009U.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004I9ZO.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005CQ9C.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image006BN6F.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image007BD92.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233932&reg=3&lang=1"
  },
  {
    "headline": "Science leaders discuss efficient ways to convert research outcomes to real-world applications",
    "summaryText": "<p>Ministry of Science & Technology</p><p>Science leaders discuss efficient ways to convert research outcomes to real-world applications</p><p>Science–policy convergence is essential to realise the vision of Viksit Bharat, said Principal Scientific Adviser (PSA) to the Government of India, Prof. Ajay K. Sood, while chairing the National Science Day Lectures at the National Science Day Celebration–2026 held at Plenary Hall, Vigyan Bhawan, New Delhi.</p><p>The celebration, organised under the focal theme “Women in Science Catalysing Viksit Bharat,” featured three National Science Day Lectures followed by a panel discussion on Science Policy Interface for Catalysing Viksit Bharat. The event brought together policymakers, scientists, researchers and academicians to deliberate on strengthening India’s scientific ecosystem in alignment with national development priorities.</p><p>In his address, Prof. Ajay K. Sood emphasized that India’s scientific advancement must be closely aligned with policy direction and national missions. He underlined that sectors such as aerospace, defence, critical metals, advanced materials and digital communication require coordinated institutional mechanisms and sustained research investment. He stressed that the science-policy interface plays a decisive role in translating scientific capabilities into national strength.</p><p>The PSA highlighted the need for integrated approaches in emerging and strategic domains, noting that research, innovation and policy frameworks must function in synergy. He underscored that future growth will depend on building indigenous technological capacity, fostering interdisciplinary collaboration and ensuring that research outcomes are effectively deployed for societal benefit. Prof. Sood also emphasized the importance of communicating science in Indian languages to enhance public engagement and inclusive outreach.</p><p>The National Science Day Lectures included presentations on Made in India technologies for Aerospace and Defence, Roadmap and Solutions for Critical Metals and Materials: An Integrated Approach, and Direct to Mobile Broadcasting. The deliberations highlighted the importance of technological self-reliance and long-term strategic planning in critical sectors.</p><p>Prof. Abhay Karandikar, Secretary, Department of Science and Technology (DST), in his address, emphasized that India’s science policy architecture must support both frontier research and translational innovation. He highlighted DST’s commitment to enabling interdisciplinary research, strengthening institutional collaborations and building capacity in emerging technologies. He noted that science-led development must ensure that research outcomes move efficiently from laboratories to real-world applications.</p><p>Prof. Karandikar further stressed that empowering researchers, particularly women in science, and building inclusive research ecosystems are essential for sustained national progress. He underlined that policy instruments must accelerate innovation cycles while ensuring equitable access to scientific advancements across sectors and regions.</p><p>Prof. Shekhar C. Mande, President, Indian National Science Academy (INSA), during the panel discussion, emphasized the importance of sustained dialogue between scientists and policymakers. He highlighted that evidence-based policymaking must be informed by scientific expertise and rigorous research. He noted that strengthening institutional interfaces between academia and government will be critical for catalyzing Viksit Bharat.</p><p>Shri Shashi S. Vempati, Former CEO, Prasar Bharati, delivered a lecture on “Direct to Mobile Broadcasting: India’s Next Digital Leapfrog.” He described Doordarshan’s journey across different information and communication technology phases, leading towards direct-to-mobile broadcasting in collaboration with IIT Kanpur and a startup partner.</p><p>Dr. K. Balasubramanian, Director, Non-Ferrous Technology Development Centre (NFTDC), delivered a lecture titled “Roadmap & Solutions for Critical Metals: An Integrated Approach.” He highlighted India’s strengths in process engineering, information technology, and rapid plant-scale capability. He noted that with access to raw materials, operational capacity can be developed in a short time. He called for a shift from serial lab-to-plant development to a mission-mode, systems-based approach in strategic non-ferrous metals relevant to space, defence, and nuclear sectors.</p><p>Dr. Shubha V. Iyenger, Former Distinguished Scientist, CSIR–National Aerospace Laboratories (CSIR-NAL), delivered a lecture on “Made in India Technologies for Aerospace and Defence,” highlighting “Drishti,” India’s first indigenous runway visibility measuring system. She was conferred the Padma Shri in 2026 for developing Drishti.</p><p>The event concluded with a collective resolve to deepen science–policy integration, strengthen institutional collaboration and enhance public engagement with science as India advances towards its long-term development goals.</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001T55U.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233927&reg=3&lang=1"
  },
  {
    "headline": "Dr Jitendra Singh delivers Padam Vibhushan Parameswaran Memorial Lecture at Thiruvananthapuram, traces India’s journey from civilisational resilience to technology leadership",
    "summaryText": "<p>Ministry of Science & Technology</p><p>Dr Jitendra Singh delivers Padam Vibhushan Parameswaran Memorial Lecture at Thiruvananthapuram, traces India’s journey from civilisational resilience to technology leadership India Will Be Among the Top Three Economies Soon; Viksit Bharat by 2047 Is No Longer a Dream but a Defined Mission: Dr Jitendra Singh at Parameswaran Memorial LectureFrom ‘Fragile Five’ to Global Growth Leader: India’s Decade of Transformation; Rises from 81st to 38th in Global Innovation Index, Says Dr Jitendra SinghIndia Among Top Nations in Scientific Publications and Highly Cited Research; Ocean Mission to Unlock Deep-Sea Resources for Future Growth: Dr Jitendra SinghYouth of Today Will Shape India at 100 Years of Independence, Says Dr Jitendra Singh</p><p>Union Minister of State (Independent Charge) for Science & Technology, Earth Sciences, PMO, Personnel, Public Grievances, Pensions, Atomic Energy and Space, Dr. Jitendra Singh today said that India’s journey from being counted among the “Fragile Five” economies in 2014 to emerging as the world’s fourth largest economy reflects a decisive shift in national confidence, capability, and direction. He said India is now firmly on course to become the third largest economy in the near future and achieve the goal of Viksit Bharat by 2047.</p><p>Delivering the P. Parameswaran Memorial Lecture on the theme “Viksit Bharat @2047: Science, Technology and Future Ready Innovation for National Transformation” at Kowdiar, Thiruvananthapuram, Dr. Jitendra Singh described the occasion as providential, as the lecture coincided with National Science Day. The programme was organised by “Bharatheeya Vichara Kendram” in memory of Shri P. Parameswaran, the renowned thinker, ideologue, and social leader.</p><p>Beginning his address with a reflection on India’s civilizational journey, Dr. Jitendra Singh said that India is an ancient civilization that has survived invasions, colonial rule,and systemic exploitation, yet has emerged stronger with renewed self-belief. He said that the real spirit of democracy has deepened in recent years, empowering even the most underprivileged citizen to aspire without barriers.</p><p>He said democracy becomes meaningful when even a mother in the poorest household can dream that her child can become a scientist, doctor, or civil servant, and believe that the system will allow that dream to be realised.</p><p>In the field of innovation, he said that in 2014 India ranked 81st in the Global Innovation Index and has since climbed to 38th position. The country now has over two lakh startups generating more than 21 lakh jobs. He recalled that when “Start Up India” was announced in 2015, the concept was unfamiliar to many; today it has evolved into a nationwide movement. Nearly half of these startups are emerging from Tier-2 and Tier-3 cities, and a significant share are women-led enterprises.</p><p>He said that the conventional discourse on women empowerment is undergoing a shift, as women scientists and innovators are leading some of the country’s most prestigious national missions in space, science and governance.</p><p>On research output, Dr. Jitendra Singh said India ranks sixth globally in patent filings, with more than 60 percent filed by resident Indians. The country is among the top nations in scientific publications, with a growing number of highly cited research papers. Thousands of Indian scientists feature among the top two percent globally, reflecting the global recognition of Indian scientific talent.</p><p>Speaking about space and nuclear sectors, the Minister said that policy reforms have opened new avenues for private participation, resulting in a sharp expansion of India’s space economy. Indigenous capabilities in defence and advanced technologies have also grown significantly, with rising exports and increasing self-reliance.</p><p>Dr. Jitendra Singh referred to the Ocean Mission and said India is uniquely placed, being the only country with an ocean named after it. He said the exploration of marine resources, deep-sea minerals and biodiversity will play a major role in future value addition to the national economy.</p><p>He also spoke about policy initiatives such as the National Education Policy 2020, Atal Innovation Mission, PM Mudra Yojana, PM Vishwakarma Yojana and PM SVANidhi, which are expanding opportunities beyond conventional government employment. These measures, he said, are encouraging entrepreneurship, supporting traditional artisans, and enabling street vendors and small entrepreneurs to gain dignity and economic stability.</p><p>Calling this “the best time to be in India,” Dr. Jitendra Singh urged young Indians, including those pursuing higher studies abroad, to remain connected with the nation’s growth story. He said that while global exposure is valuable, India today offers unprecedented opportunities in research, innovation,and enterprise.</p><p>Concluding his address, Dr. Jitendra Singh said that Viksit Bharat in 2047 will be shaped by the youth of today. The responsibility of the present generation, he said, is to build capacity, strengthen institutions and create an enabling ecosystem so that when India celebrates 100 years of independence, it stands as a fully developed, innovation-driven and globally respected nation.</p><p>Union Minister Dr. Jitendra Singh delivering Keynote address on the theme “Viksit Bharat 2047” during 5th P. Parameswaran Ji Memorial Lecture organised by Bharatheeya Vichara Kendram(BVK) at Thiruvananthapuram on Saturday.</p>",
    "category": "Environment",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001DPBB.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002NLUN.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003IDJD.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233922&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister Shri Narendra Modi Launches Nationwide HPV Vaccination Drive for 14-Year-Old Girls from Ajmer, Rajasthan",
    "summaryText": "<p>Ministry of Health and Family Welfare</p><p>Prime Minister Shri Narendra Modi Launches Nationwide HPV Vaccination Drive for 14-Year-Old Girls from Ajmer, Rajasthan Major Milestone in India’s Fight Against Cervical CancerVoluntary, Free-of-Cost, Single-Dose HPV Vaccines to be administered after consent at Government Health FacilitiesIf the mother is healthy, the family remains capable of facing every crisis. With this sentiment the government has run many schemes to provide support to women: Prime MinisterClean Fuel, Sanitation and Nutrition Support Mark New Era of Sensitivity in Women’s Health: Prime Minister</p><p>Hon’ble Prime Minister Shri Narendra Modi today launched the nationwide Human Papillomavirus (HPV) Vaccination Campaign for 14-year-old girls from Ajmer, Rajasthan, marking a historic milestone in India’s fight against cervical cancer.</p><p>Union Health Minister Shri Jagat Prakash Nadda joined the event virtually from Kartavya Bhawan in the presence of Smt. Anupriya Patel, Union MoS for Health and Family Welfare; Dr V K Paul, Member (Health), NITI Aayog and senior officials of the Union Health Ministry. Dr M Srinivas, Director, AIIMS New Delhi; Dr Sandeep Bansal, Director, Safdarjung Hospital and senior officials and doctors from AIIMS New Delhi, Safdarjung Hospital, RML Hospital and Lady Hardinge Medical College were also present on the occasion.</p><p>Speaking on the occasion, the Prime Minister described the nationwide HPV vaccination campaign as a pivotal step toward empowering India’s ‘Nari Shakti’ and safeguarding the health of mothers and daughters across the country. “We all know that when a mother falls ill in the family, the house feels scattered. If the mother is healthy, the family remains capable of facing every crisis. With this sentiment the government has run many schemes to provide support to women,” he highlighted.</p><p>अजमेर से HPV vaccination अभियान शुरू हुआ है।ये अभियान देश की नारीशक्ति को सशक्त करने की दिशा में अहम कदम है: PM @narendramodi</p><p>Emphasising the Government’s sensitive and mission-driven approach to women’s health and dignity, the Prime Minister referred to transformative interventions such as large-scale toilet construction under sanitation initiatives, provision of affordable sanitary pads and the Pradhan Mantri Ujjwala Yojana, which has ensured clean cooking fuel for millions of households.</p><p>He also spoke about the safe motherhood scheme under which ₹5,000 is directly transferred into the bank accounts of expectant mothers to support nutritious food during pregnancy. The Prime Minister underlined that these initiatives reflect a shift from a culture of neglect to one rooted in care, dignity and sensitivity towards women’s health and well-being.</p><p>The national launch event in Ajmer witnessed virtual participation from all States and Union Territories. Hon’ble Governors, Hon’ble Chief Ministers, Hon’ble Deputy Chief Ministers, Hon’ble Administrator, Hon’ble State Health Ministers, Hon’ble Education Minister, along with Additional Chief Secretaries, Principal Secretaries, Secretaries and senior health officials joined from their respective State/UT headquarters.</p><p>Cervical cancer remains a significant public health concern globally and in India. It is the second most common cancer among women in India, with over 1 lakh 20 thousand new cases and nearly 80 thousand deaths reported annually as per the WHO GLOBOCAN report 2022. Persistent infection with high-risk Human Papillomavirus (HPV) types, particularly types 16 and 18 – has been established as the primary cause of cervical cancer.</p><p>The nationwide HPV vaccination campaign aims to prevent cervical cancer by protecting girls before potential exposure to HPV infection. The vaccine is safe, effective and provides long-lasting protection against HPV strains responsible for the majority of cervical cancer cases.</p><p>HPV vaccination has been validated and recommended by global and national expert bodies including the World Health Organization (WHO) and India’s National Technical Advisory Group on Immunization (NTAGI).</p><p>Globally 160 out of 194 countries have introduced HPV vaccine under their National Immunization Programmes. 90 countries have adopted a single-dose schedule, including majority of Southeast Asian countries. 80 countries are using Gardasil-4 vaccine in their National Immunization Programme. Out of these, 61 countries are implementing a single-dose schedule of Gardasil-4.</p><p>HPV vaccines are 93–100% effective in preventing cervical cancer caused by vaccine-covered HPV types. Evidence also shows a strong herd effect – high vaccination coverage reduces circulation of HPV strains, thereby providing indirect protection even to unvaccinated individuals.</p><p>India’s national programme uses Gardasil-4 (Quadrivalent: HPV types 6, 11, 16, 18) in a single-dose schedule, aligned with global scientific evidence and WHO recommendations.</p><p>Target Population and Coverage:</p><p>The campaign will cover girls aged 14 years (those who have completed 14 years but have not yet completed 15 years). As per Registrar General of India (RGI) 2021 estimates, the annual cohort of 14-year-old girls is approximately 1.2 crore, who are expected to benefit from this initiative each year.</p><p>Operational Plan of the HPV Vaccination Campaign:</p><p>The introduction of HPV vaccination in India has been meticulously planned with detailed attention to safety, logistics and monitoring.</p><p>Vaccination Duration: 3 months (90 days) in campaign mode.</p><p>After completion of the campaign phase, HPV vaccine will be available on routine immunization session days.</p><p>Session Sites: Only Government Health Facilities like Ayushman Arogya Mandir (AAM) – Primary Health Centres (PHCs), Community Health Centres (CHCs), Sub-District Hospitals (SDHs), District Hospitals (DHs), Government Medical Colleges and Hospitals (GMCHs)</p><p>Dose & Administration: Single dose (0.5 ml) Intramuscular (IM) injection in the left upper arm</p><p>Vaccination is voluntary, free of cost and will be administered only after parental/guardian consent.</p><p>Beneficiaries may pre-register and schedule appointments on the U-WIN digital platform, or opt for walk-in vaccination at designated government health facilities. Parental/guardian consent is mandatory and will be recorded digitally on U-WIN. In areas without internet connectivity, consent may be obtained in hard copy as per prescribed format.</p><p>The U-WIN platform will be used for session planning, registration, recording and reporting, while the e-VIN portal will manage vaccine stocks and logistics.</p><p>Extensive preparatory activities, including nationwide capacity-building exercises covering all technical and operational aspects, have been undertaken. Detailed guidelines have been shared with all States and Union Territories to ensure seamless implementation.</p><p>The programme follows strict medical guidelines. Vaccination will be deferred or avoided in the following cases:</p><p>Girls with moderate or severe illness until recovery</p><p>Girls with a history of severe allergic reaction to previous vaccination</p><p>Girls known to be allergic to yeast</p><p>Girls outside the target age group</p><p>For girls who have already received any HPV vaccine (Gardasil, Gardasil-9, Cervarix, or Cervavac), their vaccination status will be updated on the U-WIN portal.</p><p>All vaccination sessions are conducted under supervision of trained Medical Officers, with functional Cold Chain Points (CCPs) and linkage to 24×7 government health facilities for management of any rare Adverse Events Following Immunization (AEFI).</p><p>Following the Prime Minister’s national launch, HPV vaccination campaign launches were held across all States and Union Territories through local events.</p><p>The nationwide HPV vaccination campaign represents a transformative step in India’s preventive healthcare strategy and reflects delivery-oriented governance rooted in scientific evidence and implementation readiness.</p><p>The Union Ministry of Health and Family Welfare urges parents and guardians to ensure that their 14-year-old daughters receive the HPV vaccine during the campaign period. HPV vaccination is a powerful preventive intervention that can save lives and secure a healthier, cancer-free future for India’s daughters.</p><p>Dr. Sanjay Roy/Anand Chaturvedi</p><p>HFW/PM Launch of HPV Vaccination/28th February 2026/1</p><p>Read this release in: Kannada , Marathi , Tamil</p>",
    "category": "Health",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001PG4D.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0029VJE.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003MCPG.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image00406PE.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0058N5K.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233906&reg=3&lang=1"
  },
  {
    "headline": "Ministry of Minority Affairs holds 2nd Meeting of Jiyo Parsi Advisory Committee today in Mumbai",
    "summaryText": "<p>Ministry of Minority Affairs</p><p>Ministry of Minority Affairs holds 2nd Meeting of Jiyo Parsi Advisory Committee today in Mumbai Focus on Population Stabilisation and Community Support Measures</p><p>The 2nd meeting of the Jiyo Parsi Advisory Committee was held today in Mumbai under the chairmanship of Dr. Chandra Shekhar Kumar, Secretary, Ministry of Minority Affairs.</p><p>The meeting was attended by senior officials of the Ministry, representatives from the Minority Welfare Departments of Maharashtra and Gujarat, members of the Bombay and Gujarat Parsi Panchayats, and representatives of the National Minorities Development & Finance Corporation (NMDFC).</p><p>During the meeting, detailed deliberations were held on the factors contributing to the decline in the Parsi population, including demographic trends, delayed marriages, socio-economic challenges, and changing social patterns. Stakeholders shared suggestions to address these issues through coordinated policy support and community participation.</p><p>The Committee also discussed ways and means to promote timely and early marriages within the Parsi community. These included strengthening awareness initiatives, expanding counselling and matchmaking support systems, encouraging community-level engagement through Panchayats and institutions, and enhancing outreach efforts among Parsi youth and families.</p><p>The Secretary highlighted the importance of economic empowerment in ensuring long-term community sustainability. He encouraged members of the Parsi community, especially youth and women to avail concessional loans and entrepreneurship support provided by NMDFC for startups, self-employment, and skill-based enterprises.</p><p>The meeting also reviewed the progress of the Jiyo Parsi Scheme, a unique Central Sector Scheme aimed at reversing the declining population trend of the Parsi community. The scheme provides financial assistance for medical support related to fertility treatments, childcare assistance, advocacy and awareness programmes, and community outreach initiatives designed to encourage family formation and population stabilisation.</p><p>The discussions reaffirmed the Government of India’s continued commitment to preserving and strengthening the rich heritage, demographic vitality, and socio-economic well-being of the Parsi community through focused interventions and sustained collaboration with stakeholders.</p><p>Read this release in: हिन्दी , Marathi , Gujarati , Tamil</p>",
    "category": "Economy",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001B3ET.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002O1RG.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003GLFY.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233899&reg=3&lang=1"
  },
  {
    "headline": "Union Environment Minister Shri Bhupender Yadav welcomes 9 Cheetahs from Botswana, at Kuno National Park",
    "summaryText": "<p>Ministry of Environment, Forest and Climate Change</p><p>Union Environment Minister Shri Bhupender Yadav welcomes 9 Cheetahs from Botswana, at Kuno National Park India's thriving Cheetah population reaches 48, including 28 India-born cubs</p><p>On February 28, 2026, Union Minister for Environment, Forest and Climate Change, Shri Bhupender Yadav, released nine cheetahs received from Botswana into quarantine enclosures at Kuno National Park in Madhya Pradesh. The animals will undergo an acclimatisation and health monitoring phase before their gradual release into the larger landscape.</p><p>In a social media post on ‘X’, Shri Yadav announced the arrival of nine cheetahs from Botswana — 6 females and 3 males — at Madhya Pradesh's Kuno National Park.</p><p>Adding to the purrs in Kuno!After eight cheetahs from Namibia were first reintroduced to India on September 17, 2022, and 12 were brought from South Africa in February 2023, I am thrilled to announce the arrival of nine cheetahs from Botswana — 6 females and 3 males — at Madhya… pic.twitter.com/RPXknl3yWF</p><p>The Minister informed that under the environmentally-conscious leadership of Prime Minister Shri Narendra Modi, Project Cheetah has been a great success. India now has a thriving population of 48 cheetahs, including 28 India-born cubs.</p><p>In December 2024, the Government of India initiated formal discussions with the Government of the Republic of Botswana for sourcing cheetahs, to further strengthen Project Cheetah, India’s flagship wildlife restoration programme. The proposal was formally advanced by Shri Bhupender Yadav, in consultation with Mr. Boipuso Wynter Mmolotsi, Minister of Environment and Tourism, Republic of Botswana.</p><p>Botswana agreed to partner with India, considering India’s comprehensive Action Plan for Cheetah Reintroduction. The collaboration underscores a shared commitment to strengthening global cheetah conservation efforts and creating an additional secure population of the species outside its traditional African range, increasing their long-term resilience.</p><p>To operationalise the partnership, an Indian delegation visited Botswana in September 2025. The visit focused on mapping out the operational modalities, transport logistics, and regulatory clearances in line with international wildlife translocation standards. Following due scientific assessment, eight cheetahs were identified and captured from the Ghanzi region of Botswana. The cheetahs were subsequently transported approximately 700 kilometres by road to Gaborone under continuous veterinary supervision.</p><p>In November 2025, during the visit of President of India, Smt. Droupadi Murmu, to Botswana, the eight cheetahs were formally handed over to the Government of India. They were released into quarantine enclosures at Mokolodi Nature Reserve.</p><p>An Indian delegation visited Botswana later in November 2025 to review quarantine arrangements, assess enclosure conditions, and ensure readiness for international transfer. In December 2025, a Botswana delegation visited India to review final logistical preparations and to observe ongoing cheetah conservation efforts at Kuno National Park, Madhya Pradesh.</p><p>On February 27, 2026, the cheetahs were transported from Mokolodi Nature Reserve to Gaborone Airport. With the support of the Indian Air Force, the animals were airlifted to Gwalior, India, in a controlled and monitored environment to ensure their safety and well-being throughout the journey. Upon arrival in India, the cheetahs were transferred by helicopter to Kuno National Park.</p><p>In another social media post, Shri Yadav extended his appreciation to the Indian Air Force for the seamless coordination, precision flying, and unwavering commitment displayed by the IAF ensured the safe journey of these animals to India.</p><p>India’s sky high efforts for cheetahs 🐆 🇮🇳! The cheetahs from Botswana were extended a smooth air ride to India by IAF’s C17 Globemaster from 81 squadron (the Skylords), and further to Kuno by IAF’s helicopters. The seamless coordination, precision flying, and unwavering… pic.twitter.com/WKFpsfLmgS</p><p>Project Cheetah continues to progress with strengthened global partnerships and robust scientific oversight. The successful arrival of the Botswana cheetahs reinforces India’s resolve to create a sustainable, free-ranging cheetah population and to contribute meaningfully to global conservation efforts.</p><p>Read this release in: Urdu , हिन्दी , Gujarati , Tamil , Kannada</p>",
    "category": "Environment",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233898&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister Shri Narendra Modi launches Nationwide HPV Vaccination Campaign and Development Projects Worth ₹17,000 Crore in Ajmer, Rajasthan",
    "summaryText": "<p>Prime Minister Shri Narendra Modi launches Nationwide HPV Vaccination Campaign and Development Projects Worth ₹17,000 Crore in Ajmer, Rajasthan Our government is committed to all-round development: PMToday, I had the privilege of launching the nationwide HPV vaccination campaign from Ajmer, along with the inauguration and foundation stone laying of several projects and the distribution of appointment letters to the youth: PMThe HPV vaccination campaign has commenced from Ajmer, this campaign is a significant step towards empowering the Nari Shakti of the country: PMThe double-engine government is moving forward by taking both Rajasthan’s heritage and development together: PMThe campaign to link rivers started by our government will significantly benefit Rajasthan: PMThere is no shortage of sunlight in Rajasthan, this very sunshine is becoming a source of savings and income for the common man: PMA very significant role is being played by the PM Surya Ghar Free Electricity Scheme, this scheme has the power to change Rajasthan's destiny: PM</p><p>The Prime Minister, Shri Narendra Modi, addressed a public gathering in Ajmer today, marking a significant milestone in Rajasthan’s development journey. The Prime Minister paid homage to the cultural and heroic legacy of the region, including the Tejaji Dham of Sursura and the bravery of Major Dalpat Singh, whose role in liberating Haifa is still honored in Israel.” The Prime Minister expressed satisfaction that the \"double-engine government\" in Rajasthan has completed two years of rapid progress. “The government is fulfilling the promises of development with which it came to serve the people. And today is a day to further accelerate this campaign of development.” emphasised Shri Modi. The Prime Minister further highlighted that today’s event saw the inauguration and foundation stone laying of projects worth approximately ₹17,000 crore across sectors including roads, electricity, water, health, and education, which are set to increase the convenience of the people of Rajasthan and create immense employment opportunities for the youth.</p><p>Shri Modi noted a new era for the state’s youth as appointment letters were handed over to more than 21,000 new recruits today. Furthermore, the Prime Minister launched the nationwide HPV vaccination campaign from Ajmer, describing it as a pivotal step toward empowering India’s ‘Nari Shakti’ (women power) and ensuring the health of mothers and daughters. “We all know that when a mother falls ill in the family, the house feels scattered. If the mother is healthy, the family remains capable of facing every crisis. With this sentiment the government has run many schemes to provide support to women.” Shri Modi highlighted.</p><p>The Prime Minister detailed the government’s sensitive approach to women’s health and dignity, citing the successful implementation of \"mission mode\" solutions for toilets, sanitary pads, and the Ujjwala Gas Scheme. He also mentioned the safe motherhood scheme that deposits ₹5,000 into the accounts of sisters to ensure nutritious food during pregnancy, moving away from a culture of neglect to one of sensitivity.</p><p>Focusing on infrastructure, the Prime Minister stated that modern connectivity through roads, rail, and air is changing the destiny of Rajasthan. He highlighted how improved travel facilitates tourism in places like Ajmer-Pushkar, directly supporting local businesses, artisans, and taxi drivers. “The infrastructure being built around the Delhi-Mumbai Industrial Corridor is turning Rajasthan into a \"land of opportunities\" for global investment, \" Shri Modi said. Reflecting on India's rising global stature, Shri Modi spoke about the world's largest AI Summit held in Delhi, recently and his visit to Israel, where India’s progress and valor were praised. Shri Modi said, “Prime ministers and presidents of many countries of the world came to it; the heads of big companies came; everyone praised India with an open mind”. Highlighting the success of India' s Armed forces In the last 11 years, Shri Modi said, “ the Indian Army has dealt a heavy blow to terrorists and the enemies of the country on every front. Our army has been victorious in every mission, on every front. From surgical strikes to Operation Sindoor, they proved their mettle”.</p><p>Addressing long-standing farmer grievances, the Prime Minister noted the current government is committed to bringing the ERCP project to life. He emphasized that the campaign to interlink rivers,including the modified ‘Parvati-Kalisindh-Chambal’ and ‘Yamuna-Rajasthan’ link projects,will provide certain and significant benefits to the farmers of Jhalawar, Baran, Kota, and Bundi.</p><p>The Prime Minister highlighted Rajasthan’s potential to earn prosperity from the sun. Under the PM Surya Ghar Free Electricity Scheme, the government provides ₹78,000 in assistance for installing rooftop solar panels. With over 1.25 lakh families already joined in Rajasthan, many households are seeing their electricity bills drop to nearly zero. Shri Modi concluded by reiterating the mantra of \"Developed India from Developed Rajasthan,\" envisioning a prosperous life for every family in the state.</p><p>हमारी सरकार सर्वांगीण विकास के लिए संकल्पबद्ध है। इसी कड़ी में आज अजमेर से राष्ट्रव्यापी एचपीवी टीकाकरण अभियान की शुरुआत के साथ कई परियोजनाओं के उद्घाटन-शिलान्यास और युवाओं को नियुक्ति पत्रों के वितरण का सौभाग्य मिला है। https://t.co/sEmzvIlWid</p><p>अजमेर से HPV vaccination अभियान शुरू हुआ है।ये अभियान देश की नारीशक्ति को सशक्त करने की दिशा में अहम कदम है: PM @narendramodi</p><p>डबल इंजन सरकार राजस्थान की विरासत और विकास दोनों को साथ लेकर चल रही है: PM @narendramodi in Ajmer</p><p>हमारी सरकार ने नदियों को जोड़ने का जो अभियान शुरु किया है... उसका बहुत अधिक फायदा राजस्थान को मिलना तय है: PM @narendramodi</p><p>राजस्थान में धूप की कोई कमी नहीं। अब यही धूप सामान्य मानवी के घर की बचत और कमाई का साधन बन रही है।और इसमें बहुत बड़ी भूमिका है... प्रधानमंत्री सूर्यघर मुफ्त बिजली योजना की।इस योजना में राजस्थान का भाग्य बदलने की ताकत है: PM @narendramodi</p><p>Read this release in: Urdu , Marathi , हिन्दी , Assamese , Gujarati , Tamil , Kannada , Malayalam</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233887&reg=3&lang=1"
  },
  {
    "headline": "English rendering of PM’s address during launch of development works, nationwide campaign for HPV vaccination from Ajmer",
    "summaryText": "<p>English rendering of PM’s address during launch of development works, nationwide campaign for HPV vaccination from Ajmer</p><p>On this sacred land of Tirthraj Pushkar and Mother Savitri, today I have had the opportunity to come among you, to receive your blessings. From this stage, I bow to the Tejaji Dham of Surasura and to the land of Prithviraj, Ajmer.</p><p>Brave Tejaji Maharaj ki Jai</p><p>Varun Avatar Lord Jhulelal Ji ki Jai</p><p>On the dais are the Hon’ble Governor of Rajasthan, Shri Haribhau Bagde Ji; the popular Chief Minister of the State, Shri Bhajanlal Sharma Ji; former Chief Minister, sister Vasundhara Ji; my colleague in the Union Council of Ministers, Shri Bhagirath Choudhary Ji; Deputy Chief Ministers Shri Premchand Bairwa Ji and Smt. Diya Kumari Ji; my colleagues in Parliament; the State President of the BJP, Shri Madan Rathore Ji; other esteemed Ministers; distinguished dignitaries; and my beloved brothers and sisters of Rajasthan. I am deeply grateful to the revered saints, who have graced this occasion in such large numbers to bless us with their presence.</p><p>Ajmer is the land of faith and valor. Here there are sacred pilgrimages, and also the footprints of revolutionaries. Only yesterday I returned to India after completing my visit to Israel. The people of Israel still proudly remember the valor of Rajasthan’s son, Major Dalpat Singh. I too had the privilege in Israel’s Parliament to pay homage to Major Dalpat Singh Ji’s bravery. I had the honor of recounting the glory of Rajasthan’s brave warriors who played a role in liberating the city of Haifa in Israel.</p><p>Just some time ago, the BJP’s double-engine government in Rajasthan completed two years. I am satisfied that today Rajasthan is advancing on a new path of development. The promises of progress with which the BJP government came to serve you are being fulfilled rapidly. And today is a day to accelerate this campaign of development. A short while ago, projects worth nearly 17 thousand crore rupees connected to Rajasthan’s development were inaugurated and dedicated. In every sector-roads, electricity, water, health, education-new strength is being added. All these projects will enhance the convenience of the people of Rajasthan and will also create employment opportunities for the youth of Rajasthan.</p><p>The BJP’s double-engine government is continuously empowering the youth. Two years ago, Rajasthan was in the news only for corruption in recruitments and paper leaks. Now, paper leaks have been curbed, strict action is being taken against the guilty. Today, from this very stage, appointment letters have been handed over to more than 21 thousand youth of Rajasthan. This is a huge transformation. For this change, for the new jobs, for all the works of development, I extend my heartfelt congratulations to all of you people of Rajasthan.</p><p>Today, from this land of brave women, I have had the opportunity to launch an important campaign for the daughters of the country. From here in Ajmer, the HPV vaccination campaign has been started. This campaign is a significant step in the direction of empowering the women power of the nation.</p><p>We all know that when a mother falls ill, the household feels shattered. But if the mother is healthy, the family can face any crisis with strength. With this sentiment, the BJP government has launched numerous schemes to empower women.</p><p>We have witnessed the time before 2014, when the absence of toilets caused immense suffering and humiliation for our sisters and daughters. Girls would drop out of school because there were no separate toilet facilities. Poor daughters could not afford sanitary pads. For those who were in power earlier, these were trivial matters, not even worth discussing. But for us, these were sensitive issues that harmed the health and dignity of our sisters and daughters. That is why we resolved them in mission mode.</p><p>During pregnancy, malnutrition posed a grave threat to mothers’ lives. We introduced schemes for safe motherhood, ensuring mothers received nutritious food, with ₹5,000 deposited directly into their accounts. Mothers used to cough in smoke but never complained. We said this cannot continue. That is why we launched the Ujjwala Gas Scheme. All this became possible because the BJP government works not with a sense of power, but with sensitivity.</p><p>A quarter of the 21st century has already passed. This is a crucial time for Rajasthan’s development. The BJP’s double-engine government is carrying forward both Rajasthan’s heritage and progress together. We all know that good roads, railways, and air connectivity don’t just make travel easier-they change the destiny of entire regions. When roads reach every village, farmers can sell their crops at fair prices. Traders can easily send their goods outside. And who doesn’t know the tourism strength of Ajmer-Pushkar? Improved connectivity has the greatest impact on tourism. When travel becomes easier, more people come to visit.</p><p>When tourists arrive, naturally hotels thrive, roadside eateries do well, kachoris and dal baati sell more, Rajasthan’s artisans find buyers for their crafts, taxis run, and guides get work. In other words, one tourist becomes the livelihood for many families. With this vision, our government is strongly focusing on modern connectivity in Rajasthan.</p><p>As connectivity expands in Rajasthan, opportunities for investment are also steadily increasing. Around the Delhi-Mumbai Industrial Corridor, a world-class infrastructure is being developed for industries. In other words, to make Rajasthan a land of opportunities, the double-engine government is working tirelessly in multiple ways.</p><p>Mothers of Rajasthan instill the values of patriotism in their children while raising them. This land of Rajasthan knows what respect for the nation means, and that is why today, on this soil of Rajasthan, I have come to share one more thought with you.</p><p>Recently, in Delhi, the world’s largest AI conference was held. Prime Ministers, Presidents, and Ministers from many countries attended the event. Leaders of the world’s biggest companies also gathered under one roof. Everyone openly praised India. I want to ask my brothers and sisters of Rajasthan-when so many people from around the world praise India, don’t you feel proud? Don’t you feel honored? Doesn’t your head rise high? Doesn’t your chest swell with pride?</p><p>You felt proud, but you also saw what the Congress, sunk in despair and exhaustion from continuous defeats, did. In front of guests from all over the world, Congress tried to defame the nation. They staged a whole drama to disgrace the country before foreign visitors.</p><p>Congress is losing across the nation, and in anger, they are taking revenge by tarnishing India’s image. Once Congress was the INC-the Indian National Congress. But today, it is no longer INC. Instead of INC, it has become MMC. MMC means Muslim League Maoist Congress.</p><p>My brave people of Rajasthan,</p><p>History bears witness that the Muslim League hated India, and that is why it partitioned the country. Today Congress is doing the same. Maoists too hate India’s prosperity, our Constitution, and our successful democracy. They attack from ambush. Congress also sneaks in anywhere to defame the nation. The country will never forgive such misdeeds of Congress.</p><p>Defaming the nation and weakening our armed forces has been Congress’s old habit. Remember, this is the same Congress that left our soldiers longing even for weapons and uniforms. This is the same Congress that deprived military families of One Rank One Pension for years. This is the same Congress under whose rule massive scams took place in defense deals with foreign countries.</p><p>In the past 11 years, India’s army has struck hard against terrorists and enemies on every front. Our army has been victorious in every mission, every battle. From surgical strikes to Operation Sindoor, they proved their valor. Yet Congress leaders chose to amplify the lies of our enemies. Whatever is good for the nation, whatever benefits the people, Congress opposes it all. That is why today the country is teaching Congress a lesson.</p><p>In Rajasthan, you have experienced Congress’s misrule closely. During its tenure here, Congress was entangled only in corruption and internal conflicts. Congress has always betrayed our farmers. Remember how Congress kept irrigation projects hanging for decades, causing immense loss to Rajasthan’s farmers. The ERCP project was trapped only in files and announcements by Congress governments. As soon as our government came, we worked to bring this scheme out of files and onto the ground.</p><p>The campaign to link rivers that our government has started will greatly benefit Rajasthan. Be it the revised Parvati-Kalisindh-Chambal link project or the Yamuna-Rajasthan link project, the double-engine government is committed to delivering the benefits of such irrigation projects to farmers. Even today, numerous water projects have begun for Jhalawar, Baran, Kota, and Bundi districts. Our effort is also to raise the groundwater level in Rajasthan.</p><p>The BJP government, understanding Rajasthan’s potential, is designing and implementing schemes. I am happy that Rajasthan has now become a land that earns prosperity from the power of the sun. We all know that Rajasthan has no shortage of sunlight. Now this sunlight is becoming a source of savings and income for ordinary households. And in this, the Pradhan Mantri Surya Ghar Free Electricity Scheme plays a major role. This scheme has the power to change Rajasthan’s destiny. Under this scheme, the BJP government provides ₹78,000 in assistance for installing solar panels on rooftops. The government transfers the money directly into your bank account. Look at all the budgets and schemes since independence-you will not find a scheme that benefits the middle class so much. Today, families are receiving ₹78,000 directly from the government to install solar panels. The middle class is benefiting the most. This creates a small power plant at home. During the day, electricity is generated from sunlight, which is used in the household, and the surplus electricity goes to the grid. The household that generates electricity also gains from it.</p><p>Today, more than 125,000 families in Rajasthan have joined this scheme. And because of this scheme, many households are seeing their electricity bills drop to nearly zero. That means expenses have reduced, and savings have increased.</p><p>We are continuously working on the mantra of “Developed Rajasthan for a Developed India.” The projects that have begun today will further strengthen the foundation of a developed Rajasthan. When Rajasthan develops, every family here will live a prosperous life. Once again, I extend my heartfelt congratulations to you all for these development projects. Say with me-</p><p>The nation is celebrating 150 years of Vande Mataram. Say with me-</p><p>Read this release in: Urdu , हिन्दी , Assamese , Gujarati</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233884&reg=3&lang=1"
  },
  {
    "headline": "“Convocation is not an end, but the beginning of the nation-building process”: Shri Shivraj Singh Chouhan",
    "summaryText": "<p>Ministry of Agriculture & Farmers Welfare</p><p>“Convocation is not an end, but the beginning of the nation-building process”: Shri Shivraj Singh Chouhan 365 students conferred degrees, 15 awarded gold medals at the Third Convocation of Rani Lakshmi Bai Central Agricultural University, Jhansi“Bundelkhand’s soil can become the centre of a pulses revolution”: Union Minister Shri Shivraj Singh Chouhan“The goal of making India a ‘Food Basket’ will be achieved only when scientists carry knowledge from the laboratory to the field”: Shri Shivraj Singh Chouhan</p><p>The Rani Lakshmi Bai Central Agricultural University, Jhansi, organised its Third Convocation Ceremony with historic dignity and enthusiasm. Union Minister for Agriculture and Farmers’ Welfare, and Rural Development, Shri Shivraj Singh Chouhan, opened his address as the Chief Guest by raising the slogans “Bharat Mata Ki Jai” and “Jhansi Ki Rani Lakshmi Bai Ki Jai.” He personally conferred degrees on 365 students and honoured 15 meritorious students by awarding them gold medals.</p><p>Addressing the gathering, Shri Shivraj Chouhan said, “A convocation ceremony is not the end of life, but the beginning of a new chapter of nation-building.” Calling upon the students, he said that under the leadership of Prime Minister Shri Narendra Modi, India is earning global respect, and it is now the responsibility of the youth to bring honour to the nation and their institution through their knowledge, skills and values.</p><p>Referring to Guru Dronacharya and the guru-shishya tradition, the Union Minister conveyed a message of integrity and dedication. Quoting inspiring thoughts, he said that students possess limitless potential; what is needed is the determination to set a goal and move forward with firm resolve.</p><p>Union Minister Shri Shivraj Chouhan highlighted the country’s food security and said that today India is not dependent on any country for food grains. He attributed this achievement to agricultural scientists and hardworking farmers. Emphasising the concept of a ‘Nutritious India’, he said that along with production, quality and nutrition are equally important.</p><p>He informed that the government is working towards making fertiliser subsidy transparent by transferring it directly into farmers’ accounts through Direct Benefit Transfer (DBT). So far, Farmer IDs have been created for 8.5 crore farmers, with a target of reaching 12 crore. Through the ‘Bharat Extension Platform’, farmers are being provided complete crop-related information on their mobile phones.</p><p>Shri Chouhan said that the soil of Bundelkhand has the potential to become the centre of a pulses revolution. He reiterated that the goal of making India a global ‘Food Basket’ will be achieved only when scientists ensure that knowledge travels from laboratories to farmers’ fields. Referring to his personal commitment, he said that he plants one sapling every day and appealed to everyone to plant at least one sapling on their birthday.</p><p>The Guest of Honour, Dr. M.L. Jat, Director General of the Indian Council of Agricultural Research and Secretary, DARE, described the university as an institution of national importance that is setting new benchmarks every day. He said that Jhansi is the land of revolution, and now it will become the birthplace of a new agricultural revolution in oilseeds and pulses.</p><p>Dr. Jat highlighted the role of intellectual property, innovation and scientific research in building a developed India. He said the university is not merely conferring degrees, but is building human resources that will determine the direction of the agricultural sector in the years to come.</p><p>He urged scientists to ensure that the benefits of research reach the last farmer in the queue. Research focused on climate change, natural resource management and value addition must be prioritised. He appealed to students to view agriculture as entrepreneurship and start-up opportunities and to play a leading role in building an ‘Atmanirbhar Bharat’ (Self-Reliant India).</p><p>Vice-Chancellor Dr. Ashok Kumar Singh welcomed the dignitaries and presented a detailed report on the university’s progress. He stated that the university, which began in 2014 with just five students, has today grown to 1,100 students and continues to progress steadily. He noted that the number of girl students is the highest. He added that, along with imparting education, the university has become a centre for technical advisory services, training and innovation for farmers.</p><p>In addition to the Jhansi campus, a College of Fisheries and a College of Veterinary and Animal Sciences have commenced in Datia, and studies at the College of Horticulture in Morena (Madhya Pradesh) will begin soon.</p><p>The Vice-Chancellor informed that the university has established several innovations, including a polyhouse, a high-tech nursery, an integrated farming system model, demonstration fields of durum wheat, mustard and gram, and a crop cafeteria.</p><p>He read out a pledge for daily plantation and presented it to the Union Agriculture Minister, reaffirming the university’s commitment to developing a ‘Green Campus’.</p><p>15 Gold Medals, 365 Degrees Conferred</p><p>At the ceremony, degrees were conferred upon a total of 365 students, including 235 undergraduates, 127 postgraduates and 3 Ph.D. scholars. Gold medals were awarded to 8 undergraduate, 7 postgraduate and 3 Ph.D. students for their outstanding academic achievements.</p><p>The programme began with the singing of Vande Mataram. The Chief Guest planted a sapling in the university campus and was accorded a Guard of Honour by NCC cadets. Several new buildings, including the Krishi Vigyan Mandap, were also inaugurated.</p><p>The Union Agriculture Minister interacted with farmers through a Kisan Chaupal organised in the university fields. He also visited the demonstration plots of mustard and gram cultivation and toured the integrated farming system model.</p><p>Read this release in: Urdu , Gujarati , Kannada , हिन्दी , Tamil</p>",
    "category": "Agriculture",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233880&reg=3&lang=1"
  },
  {
    "headline": "Union Home Minister and Minister of Cooperation Shri Amit Shah extends greetings to all our scientists, researchers on National Science Day",
    "summaryText": "<p>Union Home Minister and Minister of Cooperation Shri Amit Shah extends greetings to all our scientists, researchers on National Science Day Your quest lights our path shaping solutions for a better futureMay this day renew our zest and resolve to innovate, build and craft destiny of our choice</p><p>Union Home Minister and Minister of Cooperation Shri Amit Shah has extended greetings to all our scientists, researchers on National Science Day.</p><p>In a post on X platform, Union Home Minister and Minister of Cooperation Shri Amit Shah said “Greetings to all our scientists, researchers on National Science Day. Your quest lights our path shaping solutions for a better future. May this day renew our zest and resolve to innovate, build and craft destiny of our choice.”</p><p>Greetings to all our scientists, researchers on #NationalScienceDay. Your quest lights our path shaping solutions for a better future. May this day renew our zest and resolve to innovate, build and craft destiny of our choice.</p><p>Read this release in: Urdu , हिन्दी , Marathi , Bengali , Gujarati , Tamil , Kannada , Malayalam</p>",
    "category": "General",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233876&reg=3&lang=1"
  },
  {
    "headline": "APEDA Organises Sikkim Organic Conclave-cum-International Buyer Seller Meet in Gangtok",
    "summaryText": "<p>Ministry of Commerce & Industry</p><p>APEDA Organises Sikkim Organic Conclave-cum-International Buyer Seller Meet in Gangtok Knowledge Report on Supply Chain and Export Readiness of Sikkim’s Organic Produce Released at Conclave</p><p>The Agricultural and Processed Food Products Export Development Authority (APEDA), under the Ministry of Commerce & Industry, Government of India, in collaboration with the Government of Sikkim and in association with IFOAM-Asia, organised the Sikkim Organic Conclave-cum-International Buyer Seller Meet (IBSM) in Gangtok, Sikkim.</p><p>During the Conclave, a Knowledge Report titled “Study on Supply Chain & Export Readiness for Organic Farm Products in Sikkim” was released. Prepared by NICDC Logistics Data Services Ltd. (NLDSL), the report outlines a roadmap to strengthen Sikkim’s organic export ecosystem through improved infrastructure, streamlined processes, enhanced aggregation, transparent price discovery and strategic market positioning. It identifies measures to improve export competitiveness while ensuring sustainability, traceability and farmer-centric growth.</p><p>The event witnessed significant international participation, with around 40 buyers from 17 countries including South Korea, UAE, Mongolia, Saudi Arabia, Oman, Singapore, Norway, Kuwait and the United Kingdom, among other key markets. About 20 leading Indian exporters, including NCEL, Basillia Organics, Flex Foods and Nexton, participated in a structured Buyer–Seller Meet with approximately 100 Farmer Producer Organisations (FPOs/FPCs) from Sikkim. The interaction was coordinated by the Department of Agriculture & Horticulture, Government of Sikkim, and the Sikkim Organic Farming Development Agency (SOFDA).</p><p>The inaugural session was graced by Minister for Agriculture, Government of Sikkim, Shri Puran Kumar Gurung; Chairman, APEDA, Shri Abhishek Dev; Commissioner & Secretary, Department of Agriculture and Horticulture, Government of Sikkim, Shri Jigmee Dorjee Bhutia; Executive Director, IFOAM Organics Asia, Ms. Jennifer H. Chang; along with other senior dignitaries and officials from APEDA, the Government of Sikkim and stakeholders from the organic and export sector.</p><p>An exhibition featuring around 12 exhibitors showcased Sikkim’s certified organic products, including Large Cardamom, GI-tagged Dalle Khursani, Sikkim Mandarin, Buckwheat, Turmeric and Orchids. The exhibition highlighted the State’s diverse and export-ready organic produce and attracted interest from international buyers.</p><p>Sikkim became India’s first fully organic state in 2016, enabling its produce to gain recognition under APEDA’s export certification system. The State was conferred the Future Policy Gold Award by the United Nations Food and Agriculture Organization in 2018 in recognition of its leadership in organic agriculture.</p><p>A technical session was also conducted to sensitise stakeholders on the 8th Edition of the National Programme for Organic Production (NPOP), covering updated regulations and labelling requirements. The session aimed to enhance awareness among exporters, FPOs and certification bodies regarding compliance standards, traceability norms and international equivalence requirements, thereby reinforcing India’s credibility in global organic trade.</p><p>The second phase of the event includes field visits by international buyers and exporters to high-potential organic production clusters in Sikkim. The visits are intended to provide first-hand exposure to certified organic farming practices, traceability systems, post-harvest handling and value addition processes. Interactions with farmers and FPOs are expected to strengthen farm-to-market linkages and enhance buyer confidence in Sikkim’s quality standards and export readiness.</p><p>Through initiatives such as the Organic Conclave-cum-IBSM, APEDA continues to promote organic exports, expand market access, build capacity among FPOs and exporters and position Sikkim as an important contributor to India’s growing organic export sector.</p><p>Abhishek Dayal/Shabbir Azad/Anushka Pandey</p><p>Read this release in: Urdu , हिन्दी , Tamil</p>",
    "category": "Agriculture",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233856&reg=3&lang=1"
  },
  {
    "headline": "NITI Aayog Convenes Frontier 50 Workshop: Advancing Intelligent Governance in Aspirational Blocks",
    "summaryText": "<p>NITI Aayog Convenes Frontier 50 Workshop: Advancing Intelligent Governance in Aspirational Blocks</p><p>NITI Aayog convened the Frontier 50 Workshop on 27th February 2026, under the Aspirational Districts and Blocks Programme (ADP/ABP), marking a strategic shift from digital governance to intelligent AI-enabled governance in public policy. The workshop was graced by Ms Nidhi Chhibber, CEO NITI Aayog, Prof Abhay Karandikar, Secretary Department of Science and Technology and Ms Debjani Ghosh, Distinguished Fellow and Chief Architect NITI Frontier Technology and Shri Rohit Kumar, Additional Secretary and Mission Director, Aspirational Districts and Blocks Programme, NITI Aayog, in the presence of senior Officers from the Central Government, State Governments and District Magistrates. Deliberations focused on operationalising Frontier Technologies across 50 Aspirational Blocks as real-world impact sandboxes. The ADP/ABP newsletter Aspirational Times was released during the Workshop.</p><p>The Inaugural Session underscored that India’s growth happens District by District. Technology was positioned as a strategic enabler of Viksit Bharat, moving governance from service digitisation toward adaptive intelligence and institutional reinvention. Speakers emphasised that Frontier Technology can unlock a national tech dividend, accelerate economic growth and social development and strengthen strategic autonomy. Core principles included focusing on real governance problems, enabling data-driven decision making, building institutional capacity, breaking silos and anchoring technology in leadership and trust.</p><p>Thematic Sessions on Frontier Technology</p><p>Eight Ministries had the platform to showcase the avenues of Digital Integration in decision-making at the District level. The National Quality Assurance Standards framework has certified public health facilities through the SaQsham platform across 29 States and UTs. Under POSHAN 2.0, the POSHAN Tracker monitors over 14 lakh Anganwadi Centres in near real time, transforming nutrition delivery into a measurable governance system. Under Jal Jeevan Mission, rural tap water coverage has expanded with geo-tagged assets and pipeline mapping on PM Gati Shakti, with emphasis on District Collectors, VWSC-led ownership and water quality testing. Digital livestock governance through Pashu Aadhar enables real-time vaccination tracking and AI-ready datasets for disease surveillance. The Digital Agriculture Mission is building interoperable digital public infrastructure through AgriStack and Bharat Vistaar integrating farmer registries, geo-referenced maps and multilingual advisories. In banking and financial services, AI supports credit scoring fraud detection AML and KYC automation and monitoring of financial inclusion indicators. Discussions also highlighted need assessments in borewell-dependent areas API integration improved POSHAN validation and AR-based training for frontline workers.</p><p>Group Discussion and Way Forward</p><p>Frontier Technology demonstrations included India AI sovereign stack applications presented by Shri Abhishek Singh MeitY, the NITI Frontier Tech Repository showcased by Ms Sachi Chopra, AI-enabled soil diagnostics, Sindhudurg as India’s first fully AI-enabled district under a state-owned SPV model and PadhaiWithAI in Tonk district improving Class 10 Mathematics outcomes. Under Frontier 50, AI Digital Intelligence and Telecom infrastructure are integrated through a phygital model with Samriddhi Kendras as assisted digital access points. This was also an opportunity for Districts to present their technology-driven interventions in addressing thematic challenges in their Districts and Blocks.</p><p>Towards the conclusion, NITI Aayog emphasised micro-localisation, interoperable district data stacks, measurable outcomes and accountable leadership.</p><p>Read this release in: Urdu , हिन्दी , Gujarati , Tamil</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Nitipic128022026TPWZ.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Nitipic228022026JYH0.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233851&reg=3&lang=1"
  },
  {
    "headline": "Valedictory Ceremony Instrument Rating & Examiners' Course",
    "summaryText": "<p>Valedictory Ceremony Instrument Rating & Examiners' Course Aircrew Examining Board (AEB) of Indian Air Force marks a milestone with successful completion of 23rd Combined Instrument Rating Instructor and Examiner (CIRIE) course at Air Force Station Hindan.</p><p>Aircrew Examining Board (AEB), which is entrusted to uphold highest standards of flying in IAF, hosted valedictory function for its 23rd CIRIE Course on 27 Feb 2026 at AFS Hindan. The prestigious six-week program of this CIRIE course underscores IAF's unwavering commitment to excellence in aviation.</p><p>The ceremony was reviewed by Air Marshal Tejbir Singh, AVSM, VM, Director General (Inspection & Safety), whose vast operational experience added value to the occasion. Wg Cdr Deepak Awasthi, Wg Cdr Vishal Joshi & Wg Cdr Rohit Tiwari were felicitated by the reviewing officer for standing first in order of merit amongst aircrew from fighter, transport and helicopter fleets.</p><p>The course, spanning six intensive weeks, comprised four weeks of ground training and two weeks of flying training. This blended approach ensured officers master the complexities of evaluating instrument flying, critical for modern air operations in adverse weather and tactical scenarios.</p><p>A diverse cohort of 40 officers graduated from this elite program. Participants included 32 officers from IAF, two officers from IA, two officers from IN and four officers from friendly foreign countries, namely Kenya, Uganda and Madagascar. The exclusive course highlights increasing tri-service synergy and IAF's role as a global knowledge hub in the field of aviation.</p><p>Read this release in: Urdu , हिन्दी , Tamil</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/PIC(12)JF4S.jpeg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233845&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister shares glimpses of his address during Inauguration of Micron Technology’s Semiconductor Assembly, Test and Packaging (ATMP) facility in Sanand,Gujarat",
    "summaryText": "<p>Prime Minister shares glimpses of his address during Inauguration of Micron Technology’s Semiconductor Assembly, Test and Packaging (ATMP) facility in Sanand,Gujarat</p><p>The Prime Minister, Shri Narendra Modi has shared glimpses of his address during Inauguration of Micron Technology’s Semiconductor Assembly, Test and Packaging (ATMP) facility in Sanand,Gujarat</p><p>In a series of X posts, Prime Minister Modi said; “The inauguration of Micron’s semiconductor facility marks a milestone in India’s journey towards technology leadership.”</p><p>The inauguration of Micron’s semiconductor facility marks a milestone in India’s journey towards technology leadership. https://t.co/6b9FBoBK8k</p><p>“With the commencement of commercial production at Micron’s ATMP Facility in Sanand, India will become an integral part of the global semiconductor value chain and our role in this sector will also grow stronger.”</p><p>With the commencement of commercial production at Micron’s ATMP Facility in Sanand, India will become an integral part of the global semiconductor value chain and our role in this sector will also grow stronger. pic.twitter.com/kpJ7PYOxGR</p><p>“The way India is moving forward today is clearly reflected in Micron’s facility in Sanand”</p><p>The way India is moving forward today is clearly reflected in Micron’s facility in Sanand. pic.twitter.com/tVahvVMKcR</p><p>“India is ready.India is reliable.India delivers.”</p><p>India is ready.India is reliable.India delivers. pic.twitter.com/bS2iMCgwLX</p><p>“In this year’s Budget, we announced India Semiconductor Mission 2.0, which will significantly boost demand for materials, components and services within India itself.”</p><p>In this year’s Budget, we announced India Semiconductor Mission 2.0, which will significantly boost demand for materials, components and services within India itself. pic.twitter.com/iLc0KIuemm</p><p>“I assure India’s partners and global investors…”</p><p>I assure India’s partners and global investors… pic.twitter.com/UNxyhny7vv</p><p>\"A proud day for India! Micron Technology’s Semiconductor ATMP facility was inaugurated in Sanand earlier today. Here are some glimpses from the occasion…\"</p><p>A proud day for India! Micron Technology’s Semiconductor ATMP facility was inaugurated in Sanand earlier today. Here are some glimpses from the occasion…@MicronTech @MicronCEO pic.twitter.com/y4vrYEMhdy</p>",
    "category": "Economy",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234094&reg=3&lang=1"
  },
  {
    "headline": "Dr. Sukanta Majumdar presides over football distribution programme in West Bengal; Football for Schools (F4S) programme completed in 33 States/UTs",
    "summaryText": "<p>Dr. Sukanta Majumdar presides over football distribution programme in West Bengal; Football for Schools (F4S) programme completed in 33 States/UTs Over 87,000 footballs being distributed across West BengalMore than 7 lakh footballs distributed nationwide across 625 districts</p><p>Union Minister of State for Education & Development of North Eastern Region, Dr. Sukanta Majumdar, presided over the football distribution programme held today at PM SHRI Kendriya Vidyalaya, Dakshin Dinajpur, West Bengal, as part of the Football for Schools (F4S) initiative.</p><p>The event was organised by the Ministry of Education in collaboration with the All India Football Federation (AIFF) and the Fédération Internationale de Football Association (FIFA).</p><p>Under the programme, nearly 1,700 FIFA footballs have been distributed across Dakshin Dinajpur district, covering approximately 250 schools. Statewide, over 87,000 footballs are being distributed across West Bengal, benefiting lakhs of students.</p><p>The Football for Schools Programme has now been successfully implemented across 33 States and Union Territories, achieving nationwide coverage. Under the initiative, approximately 9.80 lakh FIFA footballs are being distributed across the country, benefiting over 1.5 lakh schools, including PM SHRI Schools, Kasturba Gandhi Balika Vidyalayas and Eklavya Model Residential Schools.</p><p>More than 7 lakh footballs are being distributed across nearly 625 districts through designated nodal institutions, Navodaya Vidyalaya Samiti and Kendriya Vidyalaya Sangathan. In addition to distribution, structured capacity-building programmes was conducted for Physical Education teachers to ensure effective and sustainable integration of football into regular school activities.</p><p>The programme places strong emphasis on inclusion, promoting participation of girls and children from rural and aspirational districts to ensure equitable access to sporting opportunities. By integrating football into the school ecosystem, the initiative aims to foster a culture of sportsmanship, teamwork and physical fitness among students, nurturing a strong sporting spirit across the country.</p>",
    "category": "Environment",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001CCN5.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0027L98.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003I5PK.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004S5QI.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234056&reg=3&lang=1"
  },
  {
    "headline": "CONFERENCE ON EFFICIENT AND EFFECTIVE MANAGEMENT OF LITIGATION BY GOVERNMENT OF INDIA",
    "summaryText": "<p>Ministry of Law and Justice</p><p>CONFERENCE ON EFFICIENT AND EFFECTIVE MANAGEMENT OF LITIGATION BY GOVERNMENT OF INDIA Theme of the conference is “Strengthening Institutional Litigation Governance for Viksit Bharat @2047”</p><p>The National Conference of Union Secretaries and Ld. Law Officers on “Efficient and Effective Management of Government Litigation” was held on 28 February 2026 at Bharat Mandapam, New Delhi, bringing together Secretaries, senior Government officials, Ld. Law Officers, and representatives from various departments to deliberate on strengthening litigation practices and enhancing institutional efficiency.</p><p>The event witnessed the gracious presence of Shri Arjun Ram Meghwal, Hon’ble Union Minister of State (I/C), Ministry of Law and Justice; Dr. T.V. Somanathan, Cabinet Secretary; Shri R. Venkataramani, Attorney General for India; Shri Tushar Mehta, Ld. Solicitor General of India, Dr. Niraj Verma, Secretary, Department of Justice; and Dr. Rajiv Mani, Secretary, Department of Legal Affairs.</p><p>The Conference deliberated on litigation scenario across four major themes: service, pension and employment matters; infrastructure, compensation and contractual disputes; fiscal, taxation and revenue cases; and regulatory, enforcement and compliance-driven litigation. Participants noted key challenges such as repetitive service litigation due to non-uniform implementation of legal position, lack of due consultation before filing counter affidavits, divergent positions taken by different ministries, lack of coordination between Departments and Panel Counsels, and a tendency to file appeals as a default reaction rather than as a considered policy decision.</p><p>In infrastructure and compensation matters, concerns were raised about escalating land compensation litigation and mounting interest liabilities, routine challenges to arbitral awards, technical complexity in infrastructure contracts leading to inadequate legal vetting, fragmented coordination between technical divisions and legal teams, and under‑utilisation of ADR and pre‑litigation mediation.</p><p>A central emphasis of the deliberations was on reducing avoidable litigation and delays in litigation filing through robust filtering, better coordination and early dispute resolution. The Conference recommended clear appeal‑filtering criteria in service and other matters, nomination of a designated officer in each department for coordinated handling of litigation, and mechanisms for time‑bound implementation of court judgments so that repetitive and contempt litigation is minimised. Close and structured coordination with the Department of Legal Affairs and Ld. Law Officers was emphasised for important and policy‑sensitive cases so that a consistent legal position is taken across ministries.</p><p>For infrastructure, compensation and contractual litigation, the Conference endorsed institutionalising structured pre‑litigation ADR, especially for land and infrastructure disputes, and structured settlements in compensation matters to avoid protracted court battles. Also, financial exposure thresholds be explored and examined before challenging arbitral awards, with consultations through committees, so that challenges are filed only in cases with substantial legal or financial implications. Early and mandatory legal vetting of termination, debarment and other high‑value contract decisions, as well as stronger in‑house mechanisms for quick and fair dispute resolution, were identified as critical steps to reduce fresh litigation. The deliberations on fiscal, taxation, revenue, and regulatory/enforcement litigation highlighted the need to streamline enforcement strategies and compliance mechanisms so that disputes are resolved at earlier stages and unnecessary matters are not carried to higher forums.</p><p>Overall, the Conference reaffirmed the Government of India’s commitment to responsible and disciplined litigation, with a focus on reducing avoidable cases, ensuring timely filing and implementation, and strengthening alternative dispute resolution to enhance ease of doing business and citizen trust in government processes for achieving the goals of Viksit Bharat@2047.</p>",
    "category": "Infrastructure",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234052&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister shares glimpses of his address during launch of Nationwide HPV Vaccination Campaign and Development Projects Worth ₹17,000 Crore in Ajmer, Rajasthan",
    "summaryText": "<p>Prime Minister shares glimpses of his address during launch of Nationwide HPV Vaccination Campaign and Development Projects Worth ₹17,000 Crore in Ajmer, Rajasthan</p><p>The Prime Minister, Shri Narendra Modi has shared glimpses of his address during launch of Nationwide HPV Vaccination Campaign and Development Projects Worth ₹17,000 Crore in Ajmer, Rajasthan. In a series of X posts, Prime Minister Modi said; “हमारी सरकार सर्वांगीण विकास के लिए संकल्पबद्ध है। इसी कड़ी में आज अजमेर से राष्ट्रव्यापी एचपीवी टीकाकरण अभियान की शुरुआत के साथ कई परियोजनाओं के उद्घाटन-शिलान्यास और युवाओं को नियुक्ति पत्रों के वितरण का सौभाग्य मिला है।”</p><p>हमारी सरकार सर्वांगीण विकास के लिए संकल्पबद्ध है। इसी कड़ी में आज अजमेर से राष्ट्रव्यापी एचपीवी टीकाकरण अभियान की शुरुआत के साथ कई परियोजनाओं के उद्घाटन-शिलान्यास और युवाओं को नियुक्ति पत्रों के वितरण का सौभाग्य मिला है। https://t.co/sEmzvIlWid</p><p>भाजपा की डबल इंजन सरकार युवाशक्ति को सशक्त करने के लिए प्रतिबद्ध है। अजमेर में अपने युवा साथियों को नियुक्ति पत्र सौंपकर बहुत प्रसन्नता हुई है। pic.twitter.com/Mh3sGC4xhh</p><p>“अजमेर के कार्यक्रम में भारी संख्या में आए राजस्थान के अपने परिवारजनों का जोश बताता है कि डबल इंजन सरकार के चौतरफा विकास कार्यों से वे कितने उत्साहित हैं।”</p><p>अजमेर के कार्यक्रम में भारी संख्या में आए राजस्थान के अपने परिवारजनों का जोश बताता है कि डबल इंजन सरकार के चौतरफा विकास कार्यों से वे कितने उत्साहित हैं। pic.twitter.com/CpQ3LnJmWM</p><p>“वीरांगनाओं की धरती राजस्थान के अजमेर से देशभर की बेटियों के लिए HPV वैक्सीनेशन अभियान का शुभारंभ कर बहुत खुशी हुई है। देश की मातृशक्ति को स्वस्थ और सशक्त बनाने की दिशा में यह एक अहम कदम है।”</p><p>वीरांगनाओं की धरती राजस्थान के अजमेर से देशभर की बेटियों के लिए HPV वैक्सीनेशन अभियान का शुभारंभ कर बहुत खुशी हुई है। देश की मातृशक्ति को स्वस्थ और सशक्त बनाने की दिशा में यह एक अहम कदम है। pic.twitter.com/z30IB01tgb</p><p>“कांग्रेस पूरे देश में लगातार हार रही है और गुस्से में वो इसका बदला भारत को बदनाम करके ले रही है। Global AI Summit में विदेशी मेहमानों के सामने भारत को शर्मसार करने का उसका प्रयास भी यही बताता है।”</p><p>कांग्रेस पूरे देश में लगातार हार रही है और गुस्से में वो इसका बदला भारत को बदनाम करके ले रही है। Global AI Summit में विदेशी मेहमानों के सामने भारत को शर्मसार करने का उसका प्रयास भी यही बताता है। pic.twitter.com/VG5JhINPnl</p><p>“डबल इंजन सरकार के प्रयासों से राजस्थान के हमारे किसान भाई-बहनों को सिंचाई परियोजनाओं का बहुत लाभ हो रहा है। इससे कांग्रेस के कुशासन और भाजपा के सुशासन का फर्क साफ नजर आता है।”</p><p>डबल इंजन सरकार के प्रयासों से राजस्थान के हमारे किसान भाई-बहनों को सिंचाई परियोजनाओं का बहुत लाभ हो रहा है। इससे कांग्रेस के कुशासन और भाजपा के सुशासन का फर्क साफ नजर आता है। pic.twitter.com/I121HrqFcb</p><p>“From Ajmer today, the national HPV Vaccination Campaign Against Cervical Cancer has been launched. Manisha Rawat from Ajmer became the first person to be vaccinated as a part of this campaign. This is a major initiative to improve women’s health.”</p><p>From Ajmer today, the national HPV Vaccination Campaign Against Cervical Cancer has been launched. Manisha Rawat from Ajmer became the first person to be vaccinated as a part of this campaign. This is a major initiative to improve women’s health. pic.twitter.com/hkEdHIeMqX</p><p>After the launch of the HPV Vaccination Campaign Against Cervical Cancer, spoke with my young friends who have been vaccinated today. This is a decisive step towards protecting the health of our daughters and mothers. pic.twitter.com/HZ9T5mIyV5</p><p>Read this release in: हिन्दी , Marathi , Gujarati</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234051&reg=3&lang=1"
  },
  {
    "headline": "Union Environment Minister Shri Bhupender Yadav chairs 89th Meeting of Standing Committee of National Board for Wildlife, in Bhopal",
    "summaryText": "<p>Ministry of Environment, Forest and Climate Change</p><p>Union Environment Minister Shri Bhupender Yadav chairs 89th Meeting of Standing Committee of National Board for Wildlife, in Bhopal Meeting focused on Key Policy Issues on Wildlife Conservation</p><p>Union Minister for Environment, Forest and Climate Change, Shri Bhupender Yadav, today chaired the 89th meeting of the Standing Committee of the National Board for Wildlife (SC-NBWL), in Bhopal.</p><p>During the meeting, the Standing Committee considered proposals relating to wildlife conservation and development projects located in and around Protected Areas, Wildlife Sanctuaries, Tiger Reserves and Eco-Sensitive Zones in accordance with the provisions of the Wildlife (Protection) Act, 1972. The proposals were examined keeping in view ecological sensitivity, statutory requirements and prescribed mitigation measures.</p><p>A total of 58 fresh proposals across sectors such as communication infrastructure, optical fibre cables, power transmission lines, road projects, drinking water supply, thermal power, defence, irrigation and other infrastructure were considered by the Committee.</p><p>The Committee also deliberated on important policy matters including ecological importance of maintaining environmental flows (e-flows) in the Chambal River for conservation of aquatic fauna like dolphins, gharials, etc; status of social, economic and ecological aspects of villages inside the Tiger Reserves; importance of grasslands for wildlife management; and strategies to manage current challenges of the human–leopard interface.</p><p>The meeting also emphasised involvement of scientific and technical institutions, including the Wildlife Institute of India, the Indian Council of Forestry Research and Education, and the Central Water Commission, to ensure that conservation policies are supported by robust research and inter-sectoral coordination.</p><p>The Standing Committee of the National Board for Wildlife is a statutory body constituted under the Wildlife (Protection) Act, 1972 and is mandated to advise the Government on matters relating to conservation and protection of wildlife and forests, while ensuring that development activities in and around Protected Areas are undertaken in a sustainable and balanced manner.</p>",
    "category": "Environment",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001ZGAQ.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234050&reg=3&lang=1"
  },
  {
    "headline": "Farewell ceremony held for Union Agriculture Secretary Dr. Devesh Chaturvedi",
    "summaryText": "<p>Ministry of Agriculture & Farmers Welfare</p><p>Farewell ceremony held for Union Agriculture Secretary Dr. Devesh Chaturvedi Union Minister Shri Shivraj Singh Chouhan honours Dr. Devesh Chaturvedi, extends best wishes to newly appointed secretary Atish ChandraUnion Minister Shri Shivraj Singh says Dr. Chaturvedi’s tenure was exemplary</p><p>The Union Ministry of Agriculture and Farmers’ Welfare organised a dignified farewell ceremony on Saturday to mark the retirement of Dr. Devesh Chaturvedi, Secretary, Union Ministry of Agriculture and Farmers’ Welfare. On this occasion, Union Minister for Agriculture and Farmers’ Welfare, and Rural Development, Shri Shivraj Singh Chouhan honoured Dr. Chaturvedi and also formally welcomed the newly appointed Agriculture Secretary, Shri Atish Chandra.</p><p>In his address, Union Minister Shri Shivraj Singh Chouhan appreciated Dr. Chaturvedi’s long, dedicated and impactful administrative tenure. He said that even in challenging circumstances, Dr. Chaturvedi adopted a balanced approach and provided new direction and momentum to the Ministry. Shri Shivraj Singh stated that Dr. Chaturvedi’s leadership qualities, problem-solving ability and strong sense of teamwork enhanced transparency and efficiency in the functioning of the Ministry.</p><p>Describing his tenure as exemplary, the Union Minister noted that Dr. Chaturvedi consistently worked with commitment and foresight, ensuring that the Ministry’s initiatives were implemented effectively and in a time-bound manner. He emphasised that Dr. Chaturvedi’s administrative experience and clarity of vision significantly strengthened policy implementation and coordination within the Department of Agriculture and Farmers’ Welfare.</p><p>In an emotional moment during the ceremony, Shri Chouhan presented Dr. Chaturvedi with a memento and a bouquet as a mark of respect and extended his best wishes for the future. The gathering acknowledged Dr. Chaturvedi’s contributions with appreciation and gratitude for his years of service to the agricultural sector and to farmers across the country. On the same occasion, Union Minister Shri Shivraj Singh welcomed the newly appointed Agriculture Secretary, Shri Atish Chandra, and expressed confidence that under his leadership, the Ministry would achieve even more effective results in advancing farmers’ interests. He conveyed his hope that Shri Chandra would continue to build upon the foundation laid by his predecessor and further strengthen the Ministry’s efforts toward agricultural growth and rural development.</p><p>The programme was attended by Secretary, Ministry of Rural Development, Shri Shailesh Kumar Singh, Director General of the Indian Council of Agricultural Research (ICAR), Dr. M.L. Jat, along with senior officers and staff members of the Ministry.</p><p>Read this release in: हिन्दी</p>",
    "category": "Agriculture",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/WhatsAppImage2026-02-28at6.30.46PMOB9D.jpeg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/WhatsAppImage2026-02-28at6.30.47PM0Q6Z.jpeg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/WhatsAppImage2026-02-28at6.30.47PM(1)WV75.jpeg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/WhatsAppImage2026-02-28at6.30.47PM(2)2TA8.jpeg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234042&reg=3&lang=1"
  },
  {
    "headline": "Union Environment Minister chairs High Powered Steering Committee Meeting under NIRANTAR",
    "summaryText": "<p>Ministry of Environment, Forest and Climate Change</p><p>Union Environment Minister chairs High Powered Steering Committee Meeting under NIRANTAR NIRANTAR a Collaborative Mechanism to enhance Institutional Synergies, promote Demand-driven Research and build Professional Capacity in the Forestry and Environmental Sectors: Shri Bhupender Yadav</p><p>The meeting of the High Powered Steering Committee under the NIRANTAR Platform (Vertical III – Capacity Development Support) was held today under the Chairmanship of the Union Minister of Environment, Forest and Climate Change, Shri Bhupender Yadav, at Bhopal. Senior officials of the Ministry and representatives of all NIRANTAR institutions participated in the meeting.</p><p>The Indian Institute of Forest Management (IIFM), Bhopal, as the lead institution for the Capacity Development Vertical, made a detailed presentation on capacity building initiatives undertaken and the way forward under the NIRANTAR platform.</p><p>The presentation outlined short-term and medium-term action plans, scientist development programmes, joint training modules and collaborative initiatives among participating institutions. Emphasis was laid on strengthening coordinated training efforts, developing composite training plans and promoting knowledge exchange across institutions.</p><p>In his address, the Minister emphasized that NIRANTAR was conceived as a collaborative mechanism to enhance institutional synergies, promote demand-driven research and build professional capacity in the forestry and environmental sectors.</p><p>Shri Yadav underscored the need for integrated planning, innovation and alignment of institutional efforts with national priorities including sustainable forest management and climate resilience. He urged all institutions to work in a coordinated manner to ensure effective implementation of the platform’s objectives.</p>",
    "category": "Environment",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001BXHV.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234037&reg=3&lang=1"
  },
  {
    "headline": "Union Environment Minister Shri Bhupender Yadav chairs 44th Meeting of Central Zoo Authority at Bhopal",
    "summaryText": "<p>Ministry of Environment, Forest and Climate Change</p><p>Union Environment Minister Shri Bhupender Yadav chairs 44th Meeting of Central Zoo Authority at Bhopal</p><p>Union Minister for Environment, Forest and Climate Change, Shri Bhupender Yadav, on Saturday chaired the 44th Meeting of the Central Zoo Authority (CZA) held at the Indian Institute of Forest Management, Bhopal.</p><p>Key achievements of the CZA during the current financial year 2025-26 and strategic priorities for the year 2026-27 were presented before the governing body of Central Zoo Authority. Also, a status report was presented before the Central Zoo Authority regarding the establishment of the NRC-W in Junagadh and its regional centers.</p><p>Further, the annual calendar for observance of important days was presented aimed to inspire amongst zoo visitors’ empathy for wild animals, an understanding and awareness about the need for conservation of natural resources and for maintaining the ecological balance.</p><p>Subsequently, agenda items placed for consideration were deliberated. On the occasion, significant decisions taken in the meeting were as mentioned below:</p><p>Target has been set to conduct the second cycle of Management Effectiveness Evaluation (MEE) of large and medium category zoos by the end of May 2026. This exercise is an evidence based, comprehensive, holistic and independent exercise encouraging maintenance of highest standards in zoos across the country.</p><p>Scope of the Committee constituted to examine and report on potential of CSR contribution for zoos has been expanded and sought recommendations regarding identification of prominent personalities who can be connected with promotion of zoos, ex-situ conservation and conservation education to the youth and self-sustainability of zoos.</p><p>Collaboration with the ZSI and institutions in the NIRANTAR vertical that includes CZA, to be explored to promote zoos, ex-situ conservation and conservation education.</p><p>To solicit suggestions from Members of Parliament with a recognized zoo located in the respective Parliament constituency with respect to strengthening of the zoo to achieve various objectives envisaged in the National Zoo Policy.</p><p>Schools that have organized visits to zoos by their students to be identified and to request management of such schools to organize a class exclusively to seek collective suggestions for strengthening zoos.</p><p>Read this release in: हिन्दी</p>",
    "category": "Environment",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001AFSP.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234036&reg=3&lang=1"
  },
  {
    "headline": "Union Environment Minister Shri Bhupender Yadav Emphasizes Balanced Use of Natural Resources",
    "summaryText": "<p>Ministry of Environment, Forest and Climate Change</p><p>Union Environment Minister Shri Bhupender Yadav Emphasizes Balanced Use of Natural Resources Shri Yadav Appreciates the Functioning of Indian Institute of Forest Management, Bhopal; Awards Medals to Meritorious Students</p><p>Union Minister for Environment, Forest and Climate Change, Shri Bhupender Yadav, today presided over various meetings at the Indian Institute of Forest Management (IIFM) in Bhopal. On the occasion, he also presented medals to meritorious alumni during a ceremony held in the institute’s auditorium.</p><p>Addressing the students, Shri Yadav stressed the importance of the balanced and sustainable use of natural resources. He noted that ancient Indian traditions have long guided society towards harmony with nature. He cautioned that uncontrolled exploitation of natural resources could lead to a serious imbalance in the ecological system. Shri Yadav further stated that India has consistently raised this issue at the global level and continues to play a proactive role in advancing environmental responsibility.</p><p>The Minister observed that over the past few years, the Indian Institute of Forest Management has demonstrated outstanding performance, and its students have been securing excellent placement opportunities. He extended his best wishes to all students for their future endeavors.</p><p>Shri Bhupender Yadav also presented Gold and Silver Medals to meritorious students from previous batches. During his visit, he chaired the annual general meeting of the IIFM Society, besides other meetings at the institute campus.</p><p>Read this release in: Hindi_MP</p>",
    "category": "Environment",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/IMG-20260228-WA0015MJQK.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/IMG-20260228-WA0017KXRP.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234026&reg=3&lang=1"
  },
  {
    "headline": "MSME-DFO Okhla Hosts Three-Day PM Vishwakarma Exhibition-cum-Fair in New Delhi",
    "summaryText": "<p>Ministry of Micro,Small & Medium Enterprises</p><p>MSME-DFO Okhla Hosts Three-Day PM Vishwakarma Exhibition-cum-Fair in New Delhi Over 50 Artisans Showcase Craft and Enterprise at the Fair in C.R. Park</p><p>MSME-DFO, Okhla, New Delhi organized a three-day PM Vishwakarma Exhibition-cum-Fair from 27th February 2026 to 1st March 2026 at Bangia Samaj Bhavan, C.R. Park, New Delhi. The programme aimed to provide a dedicated platform to PM Vishwakarma artisans to showcase their products, demonstrate their craftsmanship, and explore enhanced marketing linkages.</p><p>The exhibition was inaugurated by Shri Danish Ashraf, Joint Development Commissioner, Office of Development Commissioner (MSME), New Delhi.</p><p>More than 50 PM Vishwakarma artisans representing diverse traditional trades participated in the exhibition, displaying a wide range of handcrafted products. The event witnessed encouraging footfall from buyers, local residents, and stakeholders, offering artisans direct interaction with customers and potential business opportunities.</p><p>In addition to product display and sales, a series of technical sessions were conducted during the exhibition. Experts delivered presentations on Government e-Marketplace (GeM) onboarding, barcode registration, trademark filing, and the use of e-marketing platforms to expand business reach. These sessions were designed to equip artisans with practical knowledge for formalization, branding, and digital marketing.</p><p>The three-day fair served as an effective convergence platform, reinforcing the Government’s commitment to promoting traditional skills under the PM Vishwakarma scheme and enhancing sustainable livelihood opportunities for artisans.</p><p>Email - hipessi[at]gmail[dot]com</p><p>Read this release in: हिन्दी</p>",
    "category": "General",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0012TQX.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002WRLY.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0034FH3.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004PM77.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234014&reg=3&lang=1"
  },
  {
    "headline": "Cervical Cancer Vaccination Campaign Launched",
    "summaryText": "<p>Cervical Cancer Vaccination Campaign Launched</p><p>India launches free nationwide HPV vaccination for 1.15 crore girls aged 14, aiming to prevent cervical cancer, the second most common cancer among women in the country.</p><p>A single dose of Gardasil-4 provides 93–100% effectiveness against the HPV types responsible for cervical cancer.</p><p>With this launch, India joins over 160 countries with HPV vaccination in their national immunisation schedules, advancing the global goal of cervical cancer elimination.</p><p>Prime Minister Narendra Modi launched a nationwide HPV Vaccination Programme on February 28, 2026, at Ajmer, Rajasthan for the prevention of cervical cancer among women. Following the national launch, States and Union Territories simultaneously conducted their own HPV vaccination launch events on the same day. Vaccines will be available free-of-cost at government facilities to approximately 1.15 crore girls aged 14 years across all States and UTs.</p><p>Girls who turn 15 within 90 days of the launch will also be eligible under the intensive three-month campaign. The 90-day vaccination drive will run daily to ensure maximum coverage. Thereafter, the vaccine will continue to be available on routine immunisation days.</p><p>Cervical cancer is the fourth most common cancer in women globally, with around 660,000 new cases and around 350,000 deaths in 2022. Cervical cancer is caused by persistent infection with the Human Papillomavirus. Cervical cancer disproportionately affects younger women — 20% of children who lose their mother to cancer do so due to cervical cancer.[1]</p><p>In India specifically, it is the second most common cancer among women, with over 1,20,000 new cases and nearly 80,000 deaths annually as per GLOBOCAN 2022 data.[2]</p><p>India accounts for 25% of global cervical cancer deaths. One in every five women globally who suffers from cervical cancer is from India. India ranks fourth globally in cervical cancer-related morbidity.[3] [4]</p><p>Cervical cancer is caused by Human Papillomavirus (HPV) — the only cancer preventable by a vaccine, if administered timely. Scientific evidence establishes that almost all cases are caused by persistent infection with high-risk HPV types, particularly types 16 and 18, which account for more than 80% of cervical cancer cases in India.[5]</p><p>India's national programme is using Gardasil, a quadrivalent HPV vaccine that protects against HPV types 16 and 18 (which cause cervical cancer), as well as types 6 and 11. The vaccine is approved by India's drug regulator and meets stringent quality and cold-chain standards. To ensure uninterrupted supply and uncompromised quality, the vaccine is being procured through a transparent mechanism in partnership with GAVI, the Vaccine Alliance. The vaccination is given to young girls at the age of 14, before they become sexually active.</p><p>In February 2023, GAVI, the Vaccine Alliance and the Government of India established a three-year partnership aimed at reaching millions of children in the country with life-saving vaccines. Through the strategic partnership, GAVI provided US$250 million in funding to identify and vaccinate children who had not received a single routine vaccine, strengthen existing health systems, and help India introduce the Human Papillomavirus (HPV) vaccine and Typhoid Conjugate Vaccine (TCV) into the national routine immunisation schedule.</p><p>GAVI, the Vaccine Alliance is a public-private partnership bringing together governments, WHO, UNICEF, the World Bank, the vaccine industry, civil society, and the Gates Foundation to vaccinate children against the world's deadliest diseases.</p><p>Vaccination Sites and Safety</p><p>Vaccination is available only at Government Health Facilities with a functional Cold Chain Point (CCP), a dedicated medical officer for Adverse Events Following Immunisation (AEFI) management, and internet connectivity.</p><p>Session timings are generally 9:00 AM to 2:00 PM and may be held on public holidays and weekends. All sites are linked to the nearest 24×7 government health facility for immediate medical support. Girls should not be on an empty stomach before vaccination. They must be kept under observation for 30 minutes post-vaccination.</p><p>Registration, Recording & Reporting</p><p>Beneficiaries may self-register on the U-WIN digital platform, get pre-registered with the help of a health worker, or walk in for on-site registration.</p><p>All vaccine stocks and logistics are managed and monitored through eVIN.</p><p>Vaccination certificates are downloadable from the U-WIN portal, including the nearest 24×7 AEFI facility address and helpline number. Hard copies are available on request.</p><p>The left index finger of each recipient is marked following vaccination during the three-month campaign.</p><p>Girls Excluded from Vaccination</p><p>Those with moderate or severe illness (wait until complete recovery)</p><p>Known allergy to yeast or prior allergic reaction to any vaccination</p><p>Girls outside the 14-year target age group</p><p>Girls previously vaccinated with any HPV vaccine (Gardasil, Gardasil-9, Cervarix, or Cervavac)</p><p>HPV vaccines are among the most extensively studied vaccines globally, with more than 500 million doses administered worldwide since 2006. The vaccine is 93–100% effective in preventing cervical cancer caused by the HPV types it covers.</p><p>With this launch, India joins over 160 countries that have introduced HPV vaccination into their national immunisation schedules. More than 90 countries are implementing single-dose HPV vaccination schedules, improving coverage, affordability, and programme efficiency. Modelling estimates that achieving the elimination goal could avert 74 million new cases of cervical cancer and prevent 62 million deaths by 2120 worldwide.</p><p>The programme fulfils the Government's commitment to advancing the vision of \"Swasth Nari Sashakt Parivar\" — ensuring prevention, protection and equity at the core of women's healthcare to help build healthy families.</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2233632&reg=3&lang=1#:~:text=Cervical%20cancer%20remains%20the%20second,per%20the%20GLOBOCAN%202022%20data</p><p>https://www.who.int/news-room/fact-sheets/detail/cervical-cancer</p><p>https://pmc.ncbi.nlm.nih.gov/articles/PMC12702179/</p><p>https://www.cdc.gov/cancer/hpv/basic-information.html</p><p>https://www.gavi.org/news/media-room/gavi-and-government-india-establish-new-partnership-protect-millions-children-2026</p><p>Read this release in: Bengali</p>",
    "category": "Health",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003GDZW.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004CWJQ.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005B4PR.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234009&reg=3&lang=1"
  },
  {
    "headline": "Department of School Education and Literacy organised National Conference on UDISE+ from 27th February to 28th February, 2026 in Bhubaneswar, Odisha",
    "summaryText": "<p>Department of School Education and Literacy organised National Conference on UDISE+ from 27th February to 28th February, 2026 in Bhubaneswar, Odisha</p><p>Department of School Education & Literacy (DoSEL), Ministry of Education (MoE) along with the Department of School and Mass Education, Government of Odisha co-hosted a two days’ workshop on Unified District Information System for Education Plus (UDISE+) in Bhubaneswar, Odisha which commenced on 27th February 2026, bringing together senior officials from DoSEL, Education Boards across India and key education departments and organisations to deliberate on strengthening data-driven educational governance.</p><p>Inaugurating the conference, Shri Dheeraj Sahu, Additional Secretary, Ministry of Education, Government of India, emphasized the critical role of reliable and timely educational data in ensuring transparency and accountability. He deliberated on widening the horizon of UDISE+ by tracking the learning outcome of the students as well as dropped out students through APAAR id. He also urged the States/districts to analyse the reasons of dropping out of students from School ecosystem.</p><p>In his Welcome Address, Dr. Pankaj K.P. Shreyaskar, Deputy Director General, DoSEL, highlighted the strategic importance of UDISE+ in supporting national initiatives including National Education Policy (NEP) 2020. Dr. Shreyaskar emphasised on data harmonisation, quality and Security of data and integration of various portals with UDISE + through API to ease the burden of reporting by the schools.</p><p>The conference was attended by Shri Vikas Gupta, Commissioner, Kendriya Vidyalaya Sangathan (KVS); Ms. A. Srija, Economic Advisor (EA), DoSEL; and Ms. Ananya Das, State Project Director (SPD), OSEPA, Government of Odisha, Bhubaneswar.</p><p>During the panel discussion, the panelists from Kendriya Vidyalaya Sangathan (KVS), Navodaya Vidyalaya Samiti (NVS), Indian Air Force (AIF), Navy Educational Society (NES), and National Institute of Open School (NIOS), the significance of UDISE + data base and its benefits, as also their expectation beyond what are being offered by UDISE+ were deliberated upon. The School Education Departments of Government of Odisha, Government of Haryana and Government of Andhra Pradesh demonstrated their best practices adopted to strengthen the school data ecosystem for better evidence-based decision making.</p><p>During the second day of workshop i.e. on 28th February 2026, School Education Departments of Government of Uttar Pradesh (UP), Kerala, Karnataka, Manipur, Telangana and Maharashtra shared their best practices by demonstrating their dashboards and highlighting their initiatives to ensure the data accuracy and widen the coverage of UDISE +. The following sessions with panelists from Central Board of Secondary Education (CBSE), National Institute of Open Schooling (NIOS), Board of Secondary & Higher Secondary Education, Goa and Odisha wherein the need for integration of various datasets relating to school education, including of the Boards, ensuring the sanctity of data sets.</p><p>DoSEL highlighted salient features in UDISE+, recent upgradations in UDISE+, scope for areas to be explored for use of Artificial Intelligence in UDISE+ ecosystem using tools like automated data flagging, smart verification queues, AI helpdesk for data entry & automated school report card etc.</p><p>In the closing remarks, Dr. N. Thirumala Naik, Secretary, Department of School and Mass Education, Government of Odisha impressed upon the significance of UDISE + data base in making policy interventions, and the need for its further enrichment.</p><p>The workshop was woven around technical sessions, panel discussions and open houses. Through this workshop, Educational Institutions, Examination Boards and State Governments shared their insights and articulated their expectations from the Unified District Information System for Education Plus (UDISE+) database. This forum also welcomed the sharing of innovative technological initiatives and best practices adopted by States to strengthen data management, integration, validation, and utilisation within the UDISE+ framework.</p><p>The important takeaways of the two-day workshop on UDISE + and related areas may be summarised as under:</p><p>Strengthen Data Integrity to streamline the data collection process, ensuring that the information recorded on school infrastructure, student enrolment, and teacher profiles is credible and real-time.</p><p>Collaborative Resolution to address the specific implementation challenges faced at the State and UT levels, fostering a shared understanding of the latest UDISE+ Modules and validation protocols. Further, to bring the school examination boards into the fulcrum of UDISE + in the near future.</p><p>Evolve a shared vision for Strategic Expansion of UDISE+ to make it to a new age AI compliant decision support system.</p><p>The workshop concluded by extending the vote of thanks to all.</p><p>Read this release in: Urdu , हिन्दी</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0018TOD.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234004&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister Shri Narendra Modi inaugurates Micron Technology’s Semiconductor Assembly, Test and Packaging (ATMP) facility in Sanand,Gujarat",
    "summaryText": "<p>Prime Minister Shri Narendra Modi inaugurates Micron Technology’s Semiconductor Assembly, Test and Packaging (ATMP) facility in Sanand,Gujarat The inauguration of Micron’s semiconductor facility marks a milestone in India’s journey towards technology leadership: PMIndia, long known for its software strength, is now firmly establishing its identity in the hardware sector as well: PMToday, India is rapidly becoming an integral part of the global semiconductor value chain: PMThis century belongs to the AI revolution: PMIf oil was the regulator of the last century, microchips will be the regulator of this century: PMIndia has just one message for investors around the world, India is ready, India is Reliable, India Delivers: PMThe message has reached the world loud and clear: India is Capable, India is Competitive,India is Committed: PM</p><p>Prime Minister Shri Narendra Modi, today inaugurated the Micron ATMP (Assembly, Test, Marking, and Packaging) facility in Sanand, Gujarat. This landmark event, marking the commencement of commercial production, signifies a historic milestone in India's journey toward global technology leadership. The Prime Minister noted that after the world's largest and most successful AI Summit, today we are witnessing another historic milestone. “While the AI Summit introduced the world to India's AI prowess, today is a testament to India’s commitment to technology leadership”, Shri Modi remarked.</p><p>The Prime Minister noted that while India was once primarily known for software and IT services, it is now rapidly strengthening its identity in the hardware sector. “Today, in Sanand, we see the dawn of a new future. The commencement of commercial production at Micron's ATMP Facility is set to bolster India's role in the global technology value chain”, Shri Modi emphasised.</p><p>The Prime Minister highlighted the \"New India\" mindset, where the transition from policy to production is happening at unprecedented speed. The Prime Minister emphasised the project’s rapid progression, noting that the Memorandum of Understanding was signed in June 2023, followed by the groundbreaking in Sanand in September 2023. “By February 2024, machine installation in the pilot facility had begun, leading to the commencement of commercial production in February 2026”, Shri Modi added.</p><p>Shri Modi stated that India has significantly streamlined complex regulatory processes, successfully clearing Advanced Pricing Agreements (APAs) in just a few months. He noted that this same procedure typically takes between three and five years to complete, even in developed nations.</p><p>\"When the intent is clear and the dedication is toward the nation's rapid development, policies become transparent and decisions gain momentum,\" the Prime Minister remarked.</p><p>The Prime Minister emphasized that this facility is a testament to the robust partnership between India and the USA, particularly in AI and chip technology. He mentioned that two of the world’s largest democracies, India and the USA are working continuously to secure the global supply chain, citing the Pax Silica agreement signed during the AI Summit as a key effort to make the supply chain for critical minerals more reliable.</p><p>Noting this century as the century of the AI Revolution, the Prime Minister called semiconductors a bridge to this change. Comparing historical shifts, Shri Modi stated that if oil was the regulator of the 20th century, the micro-chip is the regulator of the 21st century. A tiny chip is the medium connecting the Industrial Revolution to the AI Revolution. “With this vision, India decided to move forward aggressively in the semiconductor sector. Recall that when the world was struggling with the havoc of Covid, India announced its Semiconductor Mission. During the pandemic, when everything felt like it was falling apart, the seeds we planted with conviction are now growing and bearing fruit.” Shri Modi highlighted.</p><p>The Prime Minister reiterated India’s commitment to the semiconductor sector, noting that while 10 projects have been approved under the Semicon India program, three more are set to begin production soon across various states, including Uttar Pradesh, Assam, Odisha, and Punjab. “This ecosystem we are building is not limited to one region; it is Pan-India. New tech hubs for a 'Viksit Bharat' are being developed in every corner of the country. “ Shri. Modi stated. The Prime Minister noted that a semiconductor ecosystem is far more than just a factory; it is a multi-layered system comprising machine manufacturers, design engineers, research institutions, logistics networks, and skilled technicians. A chip is produced through the seamless coordination of all these elements. \"India is focusing on the entire value chain. In this year’s budget, we announced the 'India Semiconductor Mission 2.0' for this very purpose,\" the PM stated. Highlighting the scale of the growth, PM Modi added, “As production increases, the demand for materials, components, and services within India will also grow. This is the greatest opportunity.”</p><p>Shri Modi highlighted, “ A massive portion of India’s population is becoming first-time gadget users. Whether it is electronics, automobiles, or other technologies, demand is constantly rising. \"Make in India\" is now in full swing.” Stating the manifold growth in the production and exports of the electronics sector in the last 11 years, Shri Modi pointed out that, “ For investors, both the domestic market and global opportunities stand ready.”</p><p>Drawing parallels to Sanand’s transformation into an automobile hub, the Prime Minister expressed confidence that the Micron facility would anchor a new semiconductor ecosystem. The plant will produce D-RAM and NAND solutions to power global data centers, AI applications, and mobile devices. He also lauded the facility for housing one of the world’s largest ATMP cleanrooms and its focus on environmental sustainability through minimized water consumption. Praising the policies of the Gujarat government, Shri Modi noted that the policies created for the semiconductor sector are now yielding results on the ground. The Prime Minister highlighted that Gujarat is advancing rapidly in technology. “Simplifying processes like approvals, land allotment, and utilities has strengthened investor confidence. Dholera and Sanand are developing as the semiconductor clusters of Western India”, noted Shri Modi. The Prime Minister further stated that industries related to the inputs required for the semiconductor sector,such as chemicals and petrochemicals,along with skill centers and training initiatives, are being developed simultaneously.</p><p>The Prime Minister concluded with a powerful message to global investors, asserting, “India is ready. India is reliable. India delivers.” He assured global partners and investors of unwavering support from both the Central and State governments, marking this decade as a historic turning point for India’s technological trajectory. His address resonated globally with a clear, firm commitment: “India is Capable. India is Competitive. India is Committed.”</p><p>The inauguration of Micron’s semiconductor facility marks a milestone in India’s journey towards technology leadership. https://t.co/6b9FBoBK8k</p><p>India, long known for its software strength, is now firmly establishing its identity in the hardware sector as well. pic.twitter.com/hvZxNFA3Da</p><p>Today, India is rapidly becoming an integral part of the global semiconductor value chain. pic.twitter.com/DAZafT4c3A</p><p>This century belongs to the AI revolution. pic.twitter.com/zt7Yksw7x4</p><p>If oil was the regulator of the last century, microchips will be the regulator of this century. pic.twitter.com/wU0PZTPk1v</p><p>India has just one message for investors around the world... pic.twitter.com/fkiHA5HjCd</p><p>The message has reached the world loud and clear:India is Capable.India is Competitive.India is Committed. pic.twitter.com/e3f9o3mvzc</p><p>Read this release in: Urdu , Marathi , हिन्दी , Gujarati , Odia , Telugu</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233998&reg=3&lang=1"
  },
  {
    "headline": "‘Double Engine’ Momentum Can Fast-Track Kerala’s Progress; State’s Next Decade Crucial to India’s Development Vision: Dr Jitendra Singh",
    "summaryText": "<p>Ministry of Science & Technology</p><p>‘Double Engine’ Momentum Can Fast-Track Kerala’s Progress; State’s Next Decade Crucial to India’s Development Vision: Dr Jitendra Singh From ‘Kerala’ to ‘Keralam’, Modi Government Signals Commitment; Coordinated Governance Essential for Development, says Dr Jitendra Singh in ThiruvananthapuramCoastal Infrastructure, Fisheries Support and Accountable Governance Key to Strengthening Kerala’s Economy: Dr Jitendra Singh</p><p>Union Minister of State (Independent Charge) for Science & Technology, Earth Sciences, and MoS PMO, Personnel, Public Grievances, Pensions, Atomic Energy and Space, Dr Jitendra Singh addressed a programme organised by the Institute of Engineers along with several NGOs under the leadership of former Union Minister Shri Muralidharan. The programme deliberated on preparing a roadmap for Kerala’s development over the next decade up to 2036 and aligning it with the broader Vision Bharat goals.</p><p>Dr Jitendra Singh said Kerala stands at a decisive moment where its strengths in education, scientific aptitude, coastal resources, and skilled human capital can be effectively harnessed for accelerated and inclusive growth. He said the coming decade presents an opportunity to integrate Kerala’s development priorities with national missions in science, technology, and the blue economy.</p><p>Referring to the Centre’s commitment towards Keralam, the Minister said that in the very first Cabinet meeting held at the newly developed Seva Teerth, the Modi Government took the decision to officially adopt the name “Keralam” in place of “Kerala”, reflecting respect for the State’s cultural and linguistic identity. He said the decision symbolised sensitivity towards Kerala’s heritage and aspirations.</p><p>He further said that successive Union Budgets have made specific provisions for strengthening coastal infrastructure, promoting the fisheries sector, and expanding livelihood opportunities in maritime States like Keralam. Dedicated allocations for coastal area development, marine resources, and blue economy initiatives, including the Deep Ocean Mission, are expected to unlock new growth avenues for Kerala’s long coastline and fishing communities.</p><p>The Minister said that coastal States like Keralam are uniquely positioned to benefit from science-led marine exploration and sustainable ocean resource management. He added that effective coordination between the Centre and the State can significantly enhance the pace of development, ensuring that policies and programmes move forward with greater momentum and efficiency.</p><p>Dr Jitendra Singh said that while several Central schemes are designed to benefit citizens across sectors, their full impact depends on seamless implementation and constructive cooperation across levels of governance. He said that when development priorities of the State move in harmony with the national vision, progress can gather “double engine” momentum, ultimately benefiting the common citizen.</p><p>Former Union Minister Shri Muralidharan, in his remarks, said that successive governments in the State have not adequately prioritised the basic needs of common citizens. Referring to concerns in sectors such as healthcare, he said services, particularly for economically weaker sections, require greater accountability and responsiveness. He said the time has come to create awareness among citizens about governance models that ensure responsibility and closer alignment with the Government of India for the State’s long-term benefit.</p><p>Dr Jitendra Singh expressed confidence that with a clear roadmap, accountable governance and coordinated efforts, Kerala can move ahead at an accelerated pace and contribute significantly to India’s journey towards becoming a developed nation.</p><p>Read this release in: हिन्दी</p>",
    "category": "Infrastructure",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/TH004GA23.JPG",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/TH0329Q4.JPG",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/TH020AVJ.JPG",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/TH013UYW.JPG"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234002&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister congratulates Jammu and Kashmir team on their first-ever Ranji Trophy victory",
    "summaryText": "<p>Prime Minister congratulates Jammu and Kashmir team on their first-ever Ranji Trophy victory</p><p>The Prime Minister has congratulated the Jammu and Kashmir team for their first-ever Ranji Trophy win.</p><p>The Prime Minister stated that this historic triumph reflects the remarkable grit, discipline, and passion of the team. Highlighting that it is a proud moment for the people of Jammu and Kashmir, he noted that the victory underscores the growing sporting passion and talent in the region.</p><p>The Prime Minister expressed hope that this feat will inspire many young athletes to dream big and play more.</p><p>The Prime Minister shared on X post;</p><p>\"Congratulations to the Jammu and Kashmir team for their first ever Ranji Trophy win! This historic triumph reflects remarkable grit, discipline and passion of the team. It is a proud moment for the people of Jammu and Kashmir and it highlights the growing sporting passion and talent there. May this feat inspire many young athletes to dream big and play more.\"</p><p>Congratulations to the Jammu and Kashmir team for their first ever Ranji Trophy win! This historic triumph reflects remarkable grit, discipline and passion of the team. It is a proud moment for the people of Jammu and Kashmir and it highlights the growing sporting passion and… pic.twitter.com/3fJO89Z5F8</p><p>Read this release in: Urdu , Marathi , हिन्दी , Assamese , Gujarati , Tamil , Telugu , Malayalam</p>",
    "category": "General",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233994&reg=3&lang=1"
  },
  {
    "headline": "PM expresses grief over loss of lives in factory explosion in Kakinada, Andhra Pradesh",
    "summaryText": "<p>PM expresses grief over loss of lives in factory explosion in Kakinada, Andhra Pradesh PM Announces ex-gratia from PMNRF</p><p>The Prime Minister has expressed pain over the loss of lives caused by an explosion at a factory in Kakinada district, Andhra Pradesh.</p><p>Extending his heartfelt condolences to the families who lost their loved ones in the tragic incident, the Prime Minister also prayed for the swift recovery of those injured.</p><p>The Prime Minister has announced an ex-gratia of Rs. 2 lakh from the Prime Minister’s National Relief Fund (PMNRF) for the next of kin of each deceased individual. Furthermore, those who sustained injuries in the explosion will be provided with Rs. 50,000.</p><p>The Prime Minister Shared on X;</p><p>\"Pained by the loss of lives in the explosion at a factory in Kakinada district of Andhra Pradesh. I extend my condolences to those who lost their loved ones. May the injured recover soon.</p><p>An ex-gratia of Rs. 2 lakh from PMNRF would be given to the next of kin of each deceased. The injured would be given Rs. 50,000\"</p><p>\"ఆంధ్రప్రదేశ్‌, కాకినాడ జిల్లాలోని కర్మాగారంలో ప్రమాదవశాత్తు జరిగిన పేలుడులో ప్రాణనష్టం సంభవించడం చాలా బాధాకరం. ఈ క్లిష్ట సమయంలో బాధిత ప్రజలు మరియు వారి కుటుంబాలకు నా ప్రగాఢ సానుభూతిని తెలియజేస్తూ, గాయపడినవారు త్వరగా కోలుకోవాలని ప్రార్థిస్తున్నాను.</p><p>ప్రమాదంలో మరణించిన వారి కుటుంబాలకు రూ. 2 లక్షలు, గాయపడిన వారికి రూ. 50,000 ఎక్స్ గ్రేషియా పిఎంఎన్ఆర్ఎఫ్ నుండి ఇవ్వబడుతుంది\"</p><p>Pained by the loss of lives in the explosion at a factory in Kakinada district of Andhra Pradesh. I extend my condolences to those who lost their loved ones. May the injured recover soon.An ex-gratia of Rs. 2 lakh from PMNRF would be given to the next of kin of each deceased.…</p><p>ఆంధ్రప్రదేశ్‌, కాకినాడ జిల్లాలోని కర్మాగారంలో ప్రమాదవశాత్తు జరిగిన పేలుడులో ప్రాణనష్టం సంభవించడం చాలా బాధాకరం. ఈ క్లిష్ట సమయంలో బాధిత ప్రజలు మరియు వారి కుటుంబాలకు నా ప్రగాఢ సానుభూతిని తెలియజేస్తూ, గాయపడినవారు త్వరగా కోలుకోవాలని ప్రార్థిస్తున్నాను.ప్రమాదంలో మరణించిన వారి…</p><p>Read this release in: Urdu , Marathi , हिन्दी , Assamese , Gujarati , Tamil , Telugu , Kannada , Malayalam</p>",
    "category": "Health",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233990&reg=3&lang=1"
  },
  {
    "headline": "English rendering of PM’s address during inauguration of Micron Semiconductor Technology India Pvt Ltd’s facility in Gujarat",
    "summaryText": "<p>English rendering of PM’s address during inauguration of Micron Semiconductor Technology India Pvt Ltd’s facility in Gujarat</p><p>Popular Chief Minister of Gujarat Shri Bhupendra Bhai Patel, my colleague in the Center Ashwini Vaishnaw, CEO of Micron Technology Sanjay Mehrotra ji, US Ambassador to India Sergio Gor, Deputy Chief Minister Harsh Sanghavi ji, other dignitaries, ladies and gentlemen.</p><p>​After the world's largest and most successful AI Summit, today we are witnessing another historical milestone here. While the AI Summit introduced the world to India's AI potential, today is another proof of India's commitment regarding technology leadership.</p><p>​It is not a matter of a long time ago; until 10-11 years ago, discussions about data and chips in India used to happen only in very closed circles. When it came to technology, our discussion often remained largely around IT services. And look today, India, known for software, is now strengthening its identity in the field of hardware as well. Today in Sanand, we are seeing the rise of a new future. The start of commercial production in this ATMP Facility of Micron is going to strengthen India's role in the global technology value chain.</p><p>​Today, India is very rapidly becoming a part of the global semiconductor value chain. I extend many congratulations to the entire team of Micron, to the Gujarat government under the leadership of Bhupendra Bhai, and to all the Engineers, Technicians, and Workers.</p><p>​This facility of Micron is also a magnificent example of India’s new mood. The approach with which today's India is moving forward, from policy to production, is visible here. You remember, June 2023, the MoU was signed for this facility. After that, September 2023, the groundbreaking of this facility took place in Sanand. Then February 2024, machines started being installed in the pilot facility here. And today in February 2026, commercial production has also started in this facility.</p><p>​Whoever looks at or understands this sector can know the meaning of this speed. Even in the developed countries of the world, tax agreements like Advanced Pricing Agreements take 3 to 5 years. This is a very complicated process. But India cleared it in just a few months. When the intent is clear and the dedication is toward the rapid development of the country, then the policy also becomes clear and speed inevitably comes into decisions as well.</p><p>​I also express my gratitude to the leadership of Micron; however much I congratulate my friend Sanjay, it is not enough. Today Sanjay surprised me, because when Sanjay meets, he speaks very little; after hearing the speech today, I got introduced to another Sanjay. He maintains continuous trust in India. I will specially praise brother Sanjay ji; I remember that in past years whenever we met, he has been very enthusiastic regarding India's semiconductor ecosystem. Today his leadership, his trust in India, seems to be reaching a new height. After his appointment in India, Ambassador Gor has also perhaps come to Gujarat for the first time. And after he formally became the Ambassador, today is my first meeting with him, and that too is happening in my Karmabhoomi (place of work). I am confident that you will fully enjoy our hospitality.</p><p>​This facility of Micron, today's program, is also evidence of the strong cooperation and partnership between India and America. Especially in fields of technology like AI and chips, the partnership between India and America is very important. Today the whole world wants to secure the supply chain of these two technologies linked to a better future for humanity. And two big democracies of the world, India and America, are continuously making efforts for this. During the AI Summit, the agreement related to Pax Silica between India and America is another effort made in this direction. Our shared efforts will make the global supply chain of critical minerals more secure and more reliable.</p><p>​Until the 20th century, the world saw the era of the Industrial Revolution. At that time, the countries that were ahead in factories, machines, and mass production made progress rapidly. But this century is the century of the AI Revolution. Semiconductor is the big bridge of this change. A small chip is the medium connecting both the Industrial Revolution and the AI Revolution. If the regulator of the last century was oil, then the regulator of this century is going to be the micro-chip.</p><p>​With this thinking, India decided to move forward rapidly in the semiconductor sector. You remember, when the world was struggling with the havoc of Covid, then India announced the Semiconductor Mission. During that time, many colleagues sitting here, different teams, were conducting meetings one after another. During the pandemic, everything felt like it was falling apart. But the seeds we planted with conviction are now growing and bearing fruit.</p><p>​So far, under the Semicon India program, a total of 10 projects have been approved. Out of these, besides Micron, three more projects are also going to start production very soon. And the semiconductor ecosystem we are building is not limited to one region; it is Pan-India. That is, new tech hubs of Developed India are being developed in every part of the country. Apart from Sanand here, work is going on at a very large scale in Dholera as well. Just a few days ago, work started on a new facility in Noida, Uttar Pradesh as well. Work is also going on semiconductor units in Assam, Odisha, and Punjab.</p><p>​Today there is only one message for investors all over the world from India: India is ready. India is reliable and India delivers.</p><p>​You know that a semiconductor ecosystem does not mean just one factory. This ecosystem is made of many layers like machine makers, design engineers, research institutions, logistics networks, and skilled technicians. A chip is prepared with everyone’s coordination. India, too, is focusing on the entire value chain of the semiconductor ecosystem. In this year's budget, we have announced the India Semiconductor Mission 2.0. This is also the purpose of it. As production increases, the demand for materials, components, and services will increase within India itself. This is the biggest opportunity.</p><p>​Another big advantage of India is our manufacturing ambitions. India has a very large population which is becoming first-time users of gadgets. Whether it is electronics, automobiles, or other technology, demand in India is continuously increasing. That is, Make in India is now moving forward in full swing. Look at our electronics sector itself; in the past 11 years, electronics production and exports have increased many times. Now India is engaged in making everything from components to finished products within the country. As the scope of electronics component manufacturing increases, the domestic demand for semiconductors will also increase accordingly. That is, for those investing in India, both the domestic market and global opportunities are standing in front of them.</p><p>​I have had a special attachment to this entire area of Sanand. Sanand is that land which turns even soil into gold. I am telling you this from my experience. If a few people from Sanand are sitting here - there was a time when I used to come here by bus and keep roaming in the lanes here on a bicycle; it was a small town, I used to go up from here taking a bicycle, meaning in a way this has been my field of work for a long time. And I have seen Sanand changing before my eyes. A small town of some era is converting into a very big city today. And where did it start—a one-rupee SMS, of one rupee. I had sent one SMS to Ratan Tata ji: Welcome, Swagatam, I had written Swagatam. An investment of one rupee - see what this Gujju can do.</p><p>​I have seen Sanand turning from one car factory into a big automobile hub of the country with my own eyes. And I remember, when a big automobile company came here, the entire ecosystem developed with it. With the arrival of one company, so many ancillary units came here. A supplier network was established, local industry became strong, and both employment and investment increased. And I, to the colleagues coming from the country and the world to work here - it is true that a small town has suddenly made its place on the global map. Development and facilities that are needed, perhaps even today it remains in your mind that if this happened it would be good, if that happened it would be good.</p><p>​The lifestyle you want, the social life you want, the way you want to live life - this is Gujarat, it will provide that too. We will not let you feel any lack. Now in the same way, this pioneer facility of Micron is also going to expand a new ecosystem. I am fully confident that in the coming time, Sanand will write a new chapter of its success in the semiconductor sector as well.</p><p>​Micron's D-RAM and NAND solutions power data centers, AI applications, mobile devices, and advanced computing systems across the world. Now these will be made right here, on this land of Sanand. Here, advanced wafers will be converted into high-quality memory and storage products. Hundreds of people have received employment in this plant currently. In the coming time, there will be more expansion in this.</p><p>​The cleanroom space you are building here is going to be one of the largest A.T.M.P. cleanrooms in the world. This plant is also a best example of the coordination between progress and nature. The arrangements you have made so that minimum water is consumed are also commendable.</p><p>​I will also praise the policies of the Gujarat government. The policies Gujarat had made for the Semiconductor Sector, their benefit is now visible on the ground. Due to the proactive approach of Bhupendra Bhai’s government, Gujarat is also moving forward rapidly in the field of technology. Whether it is approvals, the matter of land allotment, or making processes like utilities simple, this has strengthened the trust of investors in Gujarat. Dholera and Sanand today are developing as semiconductor clusters of Western India. Not only this, the industries related to the inputs needed for the semiconductor sector have also been developed in Gujarat. Such as chemical and petrochemical industry, skill centers and training initiatives - work is happening on all these simultaneously in Gujarat.</p><p>​This is opening a new gate of opportunities for the youth of India. Today we have taken the first step. As India’s 10 semiconductor industry projects come into production, this multiplier effect will reach MSMEs, startups, and the entire value chain of the electronics industry. The message has reached the world that India is Capable, India is Competitive, India is Committed. I assure India's partners and global investors that whether it is the Government of India or the state governments, we all are with you.</p><p>​When future generations look back at this decade, they will say with pride how high a leap India took in this decade. This will be the decade that will prove to be the turning point for India's tech future. Once again, I give many, many congratulations to the entire team of Micron, the Gujarat government, and all of you. Thank you!</p><p>Read this release in: Urdu , हिन्दी</p>",
    "category": "Environment",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233987&reg=3&lang=1"
  },
  {
    "headline": "Union Home Minister and Minister of Cooperation Shri Amit Shah congratulates J&K for winning Ranji Trophy for the first time ever",
    "summaryText": "<p>Union Home Minister and Minister of Cooperation Shri Amit Shah congratulates J&K for winning Ranji Trophy for the first time ever I extend my heartfelt congratulations to every youth of the region and especially to Team J&K that scripted this historyIt is a moment that fills every citizen with immense prideIt mirrors the reality that the new changes that have swept Jammu and Kashmir are the new identity of its youthThe mantras of peace, progress, and prosperity are the driving force of the New Jammu and Kashmir</p><p>Union Home Minister and Minister of Cooperation Shri Amit Shah congratulated Jammu & Kashmir for winning Ranji Trophy for the first time ever.</p><p>In a post on ‘X’, Shri Amit Shah said, “On Jammu and Kashmir winning the Ranji Trophy for the first time ever, I extend my heartfelt congratulations to every youth of the region and especially to Team J&K that scripted this history. It is a moment that fills every citizen with immense pride and mirrors the reality that the new changes that have swept Jammu and Kashmir are the new identity of its youth. The mantras of peace, progress, and prosperity are the driving force of the New Jammu and Kashmir.”</p><p>On Jammu and Kashmir winning the Ranji Trophy for the first time ever, I extend my heartfelt congratulations to every youth of the region and especially to Team J&K that scripted this history.It is a moment that fills every citizen with immense pride and mirrors the reality… pic.twitter.com/HZ2ly9sYJG</p><p>Read this release in: Urdu , हिन्दी , Marathi , Assamese , Gujarati , Tamil , Telugu , Kannada</p>",
    "category": "General",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233978&reg=3&lang=1"
  },
  {
    "headline": "Vice-President graces Valedictory Function of Centenary Celebrations of St. Berchmans College, Changanassery",
    "summaryText": "<p>Vice President's Secretariat</p><p>Vice-President graces Valedictory Function of Centenary Celebrations of St. Berchmans College, Changanassery 100 Years of St. Berchmans College a Saga of Nation-Building and Character Formation: Vice President“Kerala Has Become Keralam”: Vice-President Calls Third Visit Special“Education Builds Character; Educated Citizens Shape the Nation”: Vice PresidentEra of Adopting Technology Over; India Must Become Creator Nation: Vice President</p><p>The Vice-President of India, Shri C. P. Radhakrishnan, graced the Valedictory Function of the Centenary Celebrations of St. Berchmans College in Changanassery, Kerala, today.</p><p>Vice-President Shri C. P. Radhakrishnan graced the Valedictory Function of the Centenary Celebrations of St. Berchmans College in Changanassery, Kerala today.Describing it as his third visit to the State after assuming office, he termed it a special occasion, noting that… pic.twitter.com/3ZBESd4FTK</p><p>The Vice-President said that this was his third visit to Kerala after assuming office and described it as a special one, noting that “Kerala has become Keralam,” reflecting the deep cultural identity and pride of the State.</p><p>Describing a 100-year-old college as “not just a campus of classrooms and corridors,” the Vice-President said that for a century, the institution has silently yet steadily contributed to nation-building. He noted that when the country was under colonial rule, the historic college served as a centre of intellectual awakening.Founded in 1922, he said, the college has stood as a guiding light of knowledge and character, shaping minds and the nation alike.</p><p>Reflecting on its legacy, the Vice-President said that countless alumni have carried the light of the institution across the country and the world. He particularly mentioned that the great actor Prem Nazir and former Chief Ministers Shri Vasudevan Nair and Shri Oommen Chandy were alumni of the college. He remarked that producing two Chief Ministers is among the institution’s greatest contributions to the development of the State.</p><p>Emphasising the importance of mutual respect, the Vice-President said that respecting the sentiments of others is essential to ensure respect for our own sentiments.</p><p>He observed that learning never ends, irrespective of one’s social or economic status, and stressed the importance of maintaining an open mind throughout life.</p><p>Shri C.P.Radhakrishnan noted that he attends many education-related functions and reiterated that education is the most powerful tool for transformation. “Education builds character,” he said, adding that an educated citizen shapes society and the nation.</p><p>Highlighting the importance of research and technological development for national growth, he said that the era of education merely producing clerks for colonial rule is long over. India, he stated, is changing rapidly. “The time of merely adopting technologies is over. We must become creators of technology so that the world adopts what we produce,” he said.</p><p>Expressing confidence in the country’s future, he added that this transformation is possible because India is changing and is powered by its dynamic youth.</p><p>He added that as India moves towards the vision of Viksit Bharat under the leadership of Prime Minister Shri Narendra Modi, institutions like St. Berchmans College will play a crucial role in shaping responsible citizens, innovators and leaders.</p><p>Referring to the college motto, Caritas Vera Nobilitas (Charity is True Nobility), the Vice-President underlined that true nobility lies not in birth or wealth, but in the spirit of giving. He remarked that charity is not limited to money; it can be a kind word, emotional support, time, effort, knowledge or guidance. “Living for oneself is not bad, but living only for oneself is bad,” he said, urging students to give back to society and keep the college’s motto in mind wherever they go.</p><p>Addressing the students, he said, “You are the second century of this college. The next hundred years will be written by your ideas, your courage and your commitment. Dream big. Work hard. Stay rooted in values.”</p><p>Concluding his address, the Vice-President expressed confidence that the centenary marks not the end of a hundred years but the beginning of a new era of greater glory. “Let the next century shine brighter than the last,” he said.</p><p>On the occasion, the Vice-President also inaugurated the Berchmans Centre for Emerging Technologies and the Dr. K. M. Abraham Centre for Energy and Environment during the centenary celebrations.</p><p>The Governor of Kerala, Shri Rajendra Vishwanath Arlekar; Union Minister of State for Petroleum and Natural Gas & Tourism, Shri Suresh Gopi; Kerala Minister for Cooperation, Ports and Devaswom, Shri V. N. Vasavan; Member of Parliament Shri Kodikunnil Suresh; MLA Shri Job Michael; Archbishop of Changanassery Mar Thomas Tharayil; Principal of St. Berchmans College, Dr. Teddy Kanjooparampil; Manager of St. Berchmans College, Mr. Antony Ethackad; and other dignitaries were present on the occasion.</p><p>Read this release in: Urdu , हिन्दी , Malayalam</p>",
    "category": "History",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233963&reg=3&lang=1"
  },
  {
    "headline": "New Four-Lane Bridge at Farakka Set to Transform Connectivity in West Bengal",
    "summaryText": "<p>Ministry of Road Transport & Highways</p><p>New Four-Lane Bridge at Farakka Set to Transform Connectivity in West Bengal</p><p>For decades, movement across the ageing Farakka Barrage in West Bengal has been a daily test of patience. Built in the 1960s, the nearly 70-year-old structure today struggles to handle the immense flow of vehicles connecting Malda, Murshidabad, and the North Bengal region. College faculty members like Arunmoy Das, working at Prof. Syed Nurul Hasan College and commuting from Malda to Farakka every day, speak of losing one to two hours daily in traffic congestion before even reaching work. Students at the college, like Rana Haldar, describe leaving home at dawn, uncertain if they will reach class on time, especially during examination seasons. The new Farakka Bridge, among India’s longest bridges over the Ganga, is nearing completion and is expected to significantly improve connectivity, restore valuable time to thousands of citizens, and mark a significant milestone in strengthening West Bengal’s road infrastructure.</p><p>The upcoming new four-lane bridge, stretching 5.468 km across the Ganga near the ageing Farakka Barrage, is expected to transform the economic, tourism, and social landscape of the region. Built at a cost of ₹622.04 crore and now 96% complete, the project is expected to be ready soon, bringing long-awaited relief to thousands who have endured daily congestion for decades. The project is expected to substantially reduce chronic congestion, and there will be smooth movement of goods and agricultural products from North Bengal to South Bengal, apart from the seamless transportation of aggregates from Jharkhand and back. The famed mangoes and litchis of Malda and Murshidabad will gain improved access to wider markets across India and beyond, ensuring that produce reaches consumers fresh and on time.</p><p>Beyond concrete and steel, the bridge represents restored hours with family, timely access to education and healthcare, and livelihood opportunities. Nafisa, a resident of Farakka, speaks about the impact the new Farakka Bridge will have on everyday life. She says, “We are going to benefit in so many ways. My house is right beside the main road, and Nurul Hasan College and a high school are located very close to us. During exams, the traffic congestion becomes extremely stressful for students. Many worry about reaching their centres on time. Once the new bridge is operational, this daily anxiety will reduce significantly. It will also make a huge difference during medical emergencies. Right now, traffic often delays vehicles carrying patients. With smoother and faster movement, lives can be saved.”</p><p>Asif Hussain, running a logistics business from Farakka, shares his optimism and sees the upcoming bridge as more than infrastructure. It is renewed momentum for the region’s business community. “Constant traffic jams and delays have made transportation extremely challenging for us,” he says. “A large part of our working day is lost in congestion at Farakka. This new bridge will truly be a blessing. For business owners, especially those operating vehicles, it will make a tremendous difference. With smoother movement, we will be able to increase trip rotations, improve efficiency, and strengthen profitability.”</p><p>The bridge is set to transform tourism connectivity, opening faster and more seamless access to North Bengal’s most treasured destinations. It will provide improved access to destinations such as Kulik Bird Sanctuary, Gour Malda, Adina Mosque, as well as the hill destinations of Darjeeling, Kurseong, Kalimpong, and the state of Sikkim, unlocking greater opportunities for tourism-led growth across North Bengal.</p><p>Project Highlights • Total length: 5.468 km • Project cost: ₹622.04 crore • Physical progress: 96% complete • Designed to ease congestion on the Farakka Barrage • Strengthens connectivity between North and South Bengal • Facilitates inter-state movement with Jharkhand</p><p>For the people of Farakka, the new bridge is not just a crossing over the Ganga. It is a crossing into a more certain, connected, and hopeful future. As the final stages of construction draw to a close, the new Farakka Bridge stands as a symbol of time regained and possibilities restored. For students who once left home before sunrise, for teachers who lost precious hours in traffic, and for families anxiously waiting during medical emergencies, this bridge promises relief that is both practical and deeply personal.</p><p>Read this release in: Urdu , हिन्दी</p>",
    "category": "Health",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001I7U6.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0024WH9.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0039QXT.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233962&reg=3&lang=1"
  }
]