[
  {
    "headline": "Privacy and transparency: On the RTI Act amendment, petitions",
    "summaryText": "<h3>Why in News</h3>\n<p>The RTI Act amendment has been in news due to petitions filed against it, raising concerns about privacy and transparency.</p>\n\n<h3>Background</h3>\n<p>The Right to Information (RTI) Act was enacted in 2005 to promote transparency and accountability in government institutions. However, recent amendments to the Act have sparked controversy and debate.</p>\n\n<h3>Key Highlights</h3>\n<p>The amendments include changes to the tenure and salaries of information commissioners, which have been challenged in court. The petitions argue that these changes undermine the independence of information commissions and compromise the effectiveness of the RTI Act.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The RTI Act is a constitutional right, enshrined in Article 19(1)(a) of the Indian Constitution, which guarantees the freedom of speech and expression. The Act also provides for the establishment of information commissions to oversee its implementation.</p>\n\n<h3>Significance</h3>\n<p>The RTI Act has been instrumental in promoting transparency and accountability in government institutions. It has enabled citizens to access information about government policies, programs, and decisions, thereby facilitating informed participation in the democratic process.</p>\n\n<h3>Challenges</h3>\n<p>Despite its significance, the RTI Act faces challenges, including resistance from government institutions, lack of awareness among citizens, and inadequate infrastructure for implementing the Act.</p>\n\n<h3>Way Forward</h3>\n<p>To address these challenges, it is essential to strengthen the RTI Act and its implementation. This can be achieved by ensuring the independence of information commissions, providing adequate resources and infrastructure, and promoting awareness and education about the Act among citizens.</p>\n\n<h3>Prelims Facts</h3>\n<p>The RTI Act was enacted in 2005, and it applies to all public authorities, including government institutions, public sector undertakings, and non-governmental organizations receiving government funding.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic is relevant to GS Paper II (Polity and Governance) and GS Paper IV (Ethics, Integrity, and Aptitude).</p>",
    "category": "GS-2"
  },
  {
    "headline": "Monetary Policy Meet: Repo rate steady at 5.25%; FY26 GDP, inflation projections raised",
    "summaryText": "<h3>Why in News</h3>\n<p>The Monetary Policy Committee (MPC) of the Reserve Bank of India (RBI) has decided to keep the repo rate steady at 5.25% in its recent meeting, while raising the FY26 GDP and inflation projections.</p>\n\n<h3>Background</h3>\n<p>The RBI's Monetary Policy Committee (MPC) is responsible for setting the monetary policy of the country, including the repo rate, which is the rate at which the RBI lends money to commercial banks. The MPC meets regularly to review the economic situation and adjust the monetary policy accordingly.</p>\n\n<h3>Key Highlights</h3>\n<p>The key highlights of the recent monetary policy meeting include: \n- The repo rate has been kept steady at 5.25%.\n- The FY26 GDP projection has been raised.\n- The inflation projection for FY26 has also been raised.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The RBI is governed by the Reserve Bank of India Act, 1934, which gives the central bank the power to regulate the monetary policy of the country. The MPC is constituted under Section 45ZB of the RBI Act.</p>\n\n<h3>Significance</h3>\n<p>The decision to keep the repo rate steady is significant as it indicates that the RBI is trying to balance the need to control inflation with the need to support economic growth. The raise in FY26 GDP and inflation projections also indicates the RBI's expectations for the economy.</p>\n\n<h3>Challenges</h3>\n<p>The RBI faces several challenges in setting the monetary policy, including controlling inflation, supporting economic growth, and managing the exchange rate. The current economic situation, including the global economic slowdown and the impact of the COVID-19 pandemic, also poses challenges for the RBI.</p>\n\n<h3>Way Forward</h3>\n<p>The way forward for the RBI will depend on the evolving economic situation, both domestically and globally. The RBI will need to carefully monitor the economy and adjust the monetary policy accordingly to achieve its goals of price stability and economic growth.</p>\n\n<h3>Prelims Facts</h3>\n<p>Key facts to remember for the prelims exam include: \n- The repo rate is the rate at which the RBI lends money to commercial banks.\n- The RBI's Monetary Policy Committee (MPC) is responsible for setting the monetary policy.\n- The RBI is governed by the Reserve Bank of India Act, 1934.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic can be categorized under the Indian Economy section of the GS Paper III, which includes topics related to the economy, including monetary policy, fiscal policy, and economic growth.</p>",
    "category": "GS-3"
  },
  {
    "headline": "NBEMS Achieves Historic Milestone with Official GUINNESS WORLD RECORDS™ Recognition for “Most viewers of an Artificial Intelligence in Healthcare lesson live stream on YouTube”",
    "summaryText": "<h3>Why in News</h3>\n<p>NBEMS has achieved a historic milestone with official GUINNESS WORLD RECORDS recognition for \"Most viewers of an Artificial Intelligence in Healthcare lesson live stream on YouTube\".</p>\n\n<h3>Background</h3>\n<p>NBEMS is a prominent organization that has been working towards promoting the use of Artificial Intelligence in Healthcare. The organization has been conducting various initiatives to raise awareness about the benefits of AI in healthcare and has been providing training to healthcare professionals.</p>\n\n<h3>Key Highlights</h3>\n<p>The record-breaking live stream on YouTube was viewed by a large number of people, showcasing the growing interest in AI in healthcare. The live stream covered various topics related to AI in healthcare, including its applications, benefits, and future prospects.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>There are no specific constitutional or legal provisions that directly relate to this achievement. However, the use of AI in healthcare is governed by various laws and regulations, including the National Medical Commission Act, 2019, and the Digital Information Security in Healthcare Act (DISHA), 2018.</p>\n\n<h3>Significance</h3>\n<p>The recognition by GUINNESS WORLD RECORDS is a significant achievement for NBEMS, as it highlights the organization's efforts to promote AI in healthcare. The achievement also underscores the growing importance of AI in healthcare and the need for more awareness and training in this area.</p>\n\n<h3>Challenges</h3>\n<p>Despite the growing interest in AI in healthcare, there are several challenges that need to be addressed, including the need for more data, the development of more accurate algorithms, and the addressing of ethical concerns related to the use of AI in healthcare.</p>\n\n<h3>Way Forward</h3>\n<p>The way forward for NBEMS and other organizations working in this area is to continue to promote awareness and training in AI in healthcare. This can be achieved through conducting more live streams, webinars, and workshops, as well as developing more online courses and training programs.</p>\n\n<h3>Prelims Facts</h3>\n<p>NBEMS: National Board of Examinations in Medical Sciences, GUINNESS WORLD RECORDS: a global authority on record-breaking achievements.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>Science and Technology, Health</p>",
    "category": "GS-2"
  },
  {
    "headline": "Daily Quiz: On Artificial Intelligence",
    "summaryText": "<h3>Why in News</h3>\n<p>The topic of Artificial Intelligence (AI) has been in the news due to its increasing applications and implications on various aspects of life, making it a significant area of focus for the UPSC exams.</p>\n\n<h3>Background</h3>\n<p>Artificial Intelligence refers to the development of computer systems that can perform tasks that typically require human intelligence, such as visual perception, speech recognition, and decision-making. The field of AI has been rapidly advancing, with significant investments and research in recent years.</p>\n\n<h3>Key Highlights</h3>\n<p>Key highlights in the field of AI include the development of machine learning algorithms, natural language processing, and computer vision. Additionally, AI has been applied in various sectors such as healthcare, finance, and transportation, leading to improved efficiency and accuracy.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>There are no specific constitutional provisions related to AI in India. However, the government has established the National Strategy for Artificial Intelligence, which aims to guide the development and use of AI in the country.</p>\n\n<h3>Significance</h3>\n<p>The significance of AI lies in its potential to transform various sectors and improve the quality of life. AI can help in solving complex problems, improving decision-making, and enhancing productivity. Additionally, AI can also contribute to the country's economic growth and development.</p>\n\n<h3>Challenges</h3>\n<p>Despite the potential benefits of AI, there are several challenges associated with its development and use, including job displacement, bias in decision-making, and cybersecurity threats. Moreover, the lack of regulations and standards for AI development and deployment can also pose significant risks.</p>\n\n<h3>Way Forward</h3>\n<p>To address the challenges associated with AI, it is essential to develop a comprehensive framework for its development and use. This includes establishing regulations and standards, investing in education and training, and promoting research and development in the field of AI.</p>\n\n<h3>Prelims Facts</h3>\n<p>Some key facts related to AI that are relevant for the UPSC prelims exam include the definition of AI, its applications, and the initiatives taken by the government to promote AI development in India.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>The topic of AI can be categorized under the General Studies Paper-3, which covers topics related to science and technology, and the General Studies Paper-2, which covers topics related to governance and policy.</p>",
    "category": "GS-2"
  },
  {
    "headline": "Those supporting terrorism will meet fate of Afzal Guru: Amit Shah",
    "summaryText": "<h3>Why in News</h3>\n<p>Union Home Minister Amit Shah recently stated that those supporting terrorism will meet the fate of Afzal Guru, emphasizing the government's commitment to combating terrorism.</p>\n\n<h3>Background</h3>\n<p>Afzal Guru was a key conspirator in the 2001 Indian Parliament attack, and his execution in 2013 marked a significant milestone in India's fight against terrorism. The statement by Amit Shah comes amidst ongoing efforts to curb terrorist activities and support for such groups.</p>\n\n<h3>Key Highlights</h3>\n<p>The statement highlights the government's resolve to take strong action against those involved in or supporting terrorism. It also underscores the importance of remembering and learning from past incidents, such as the Parliament attack, to inform current counter-terrorism strategies.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The statement is in line with the provisions of the Indian Penal Code and the Unlawful Activities (Prevention) Act, which provide the legal framework for dealing with terrorism and related activities. The government's actions are guided by these laws, which aim to protect national security and maintain public order.</p>\n\n<h3>Significance</h3>\n<p>The statement has significant implications for national security and the government's approach to dealing with terrorism. It sends a strong message to those involved in or supporting terrorist activities, warning them of the consequences of their actions. This approach is crucial in maintaining public confidence in the government's ability to ensure safety and security.</p>\n\n<h3>Challenges</h3>\n<p>Despite the government's resolve, combating terrorism remains a complex and challenging task. It requires coordinated efforts from law enforcement agencies, intelligence services, and other stakeholders. The government must also balance the need to take strong action against terrorism with the need to protect human rights and prevent unnecessary harm to innocent individuals.</p>\n\n<h3>Way Forward</h3>\n<p>To effectively combat terrorism, the government must continue to strengthen its counter-terrorism strategies, including intelligence gathering, surveillance, and cooperation with international partners. It must also address the root causes of terrorism, such as poverty, unemployment, and social inequality, to prevent the spread of extremist ideologies.</p>\n\n<h3>Prelims Facts</h3>\n<p>Afzal Guru was executed on February 9, 2013, for his role in the 2001 Indian Parliament attack. The attack, which occurred on December 13, 2001, resulted in the deaths of 14 people, including 5 terrorists. The incident led to a significant escalation of tensions between India and Pakistan.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>Internal Security, Polity, and Governance. This topic is relevant to the UPSC syllabus, particularly in the context of internal security, counter-terrorism, and the role of the government in maintaining national security.</p>",
    "category": "GS-2"
  },
  {
    "headline": "At Delhi AI Impact Summit 2026, PM Modi unveils ‘MANAV’ vision for artificial intelligence",
    "summaryText": "<h3>Why in News</h3>\n<p>Prime Minister Narendra Modi has unveiled the ‘MANAV’ vision for artificial intelligence at the Delhi AI Impact Summit 2026, emphasizing the need for responsible AI development and its applications for human benefit.</p>\n\n<h3>Background</h3>\n<p>The Delhi AI Impact Summit 2026 is a significant event that brings together experts, policymakers, and industry leaders to discuss the impact of artificial intelligence on society and the economy. The summit aims to explore ways to harness the potential of AI for the betterment of humanity.</p>\n\n<h3>Key Highlights</h3>\n<p>The ‘MANAV’ vision for artificial intelligence focuses on making AI more accessible, transparent, and accountable. It emphasizes the need for AI systems that are fair, reliable, and secure. The vision also highlights the importance of human-centered AI development, where AI is designed to augment human capabilities and improve the quality of life.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The Indian government has been actively promoting the development and use of artificial intelligence in various sectors. The National Strategy for Artificial Intelligence, released in 2018, outlines the government's vision for AI development and its applications. The strategy emphasizes the need for responsible AI development, data protection, and privacy.</p>\n\n<h3>Significance</h3>\n<p>The ‘MANAV’ vision for artificial intelligence has significant implications for India's economic and social development. By promoting responsible AI development, the government aims to create new opportunities for economic growth, improve the delivery of public services, and enhance the quality of life for citizens.</p>\n\n<h3>Challenges</h3>\n<p>Despite the potential benefits of AI, there are several challenges that need to be addressed. These include concerns around data privacy, job displacement, and the potential for AI systems to perpetuate biases and discrimination. The government will need to work with industry leaders, experts, and civil society organizations to address these challenges and ensure that AI development is aligned with human values.</p>\n\n<h3>Way Forward</h3>\n<p>To realize the ‘MANAV’ vision for artificial intelligence, the government will need to invest in AI research and development, promote AI education and skills training, and create a regulatory framework that supports responsible AI development. The government will also need to work with international partners to develop global standards and norms for AI development and deployment.</p>\n\n<h3>Prelims Facts</h3>\n<p>Delhi AI Impact Summit 2026, ‘MANAV’ vision for artificial intelligence, National Strategy for Artificial Intelligence, AI development, AI applications, data protection, privacy.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>Science and Technology, Governance, Economic Development, Social Justice.</p>",
    "category": "GS-2"
  },
  {
    "headline": "Why the new Digital Personal Data Protection Act faces a constitutional challenge in the Supreme Court",
    "summaryText": "<h3>Why in News</h3>\n<p>The Digital Personal Data Protection Act has been challenged in the Supreme Court, citing concerns over its constitutionality and potential impact on individual privacy.</p>\n\n<h3>Background</h3>\n<p>The Digital Personal Data Protection Act aims to regulate the collection, storage, and processing of personal data in India, providing a framework for data protection and privacy.</p>\n\n<h3>Key Highlights</h3>\n<p>The Act establishes a Data Protection Board to oversee compliance, imposes penalties for non-compliance, and provides individuals with certain rights over their personal data, such as the right to erasure and correction.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The challenge in the Supreme Court argues that the Act violates the right to privacy, as guaranteed under Article 21 of the Indian Constitution, and that certain provisions of the Act are arbitrary and unreasonable.</p>\n\n<h3>Significance</h3>\n<p>The outcome of the challenge will have significant implications for data protection and privacy in India, and may impact the way businesses and organizations handle personal data.</p>\n\n<h3>Challenges</h3>\n<p>The Act faces challenges in balancing individual privacy with the need for data-driven innovation and economic growth, as well as ensuring effective enforcement and compliance.</p>\n\n<h3>Way Forward</h3>\n<p>The Supreme Court's decision will provide clarity on the constitutionality of the Act, and may lead to amendments or revisions to ensure that the legislation is consistent with the principles of privacy and data protection.</p>\n\n<h3>Prelims Facts</h3>\n<p>The Digital Personal Data Protection Act was introduced to replace the Information Technology (Reasonable Security Practices and Procedures and Sensitive Personal Data or Information) Rules, 2011.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>Polity and Governance, Science and Technology</p>",
    "category": "GS-2"
  },
  {
    "headline": "Congress slams Economic Survey’s RTI review call, but UPA ministers once raised similar concerns",
    "summaryText": "<h3>Why in News</h3>\n<p>The Congress has slammed the Economic Survey's call for a review of the Right to Information (RTI) Act, but it has been revealed that UPA ministers had once raised similar concerns.</p>\n\n<h3>Background</h3>\n<p>The RTI Act was enacted in 2005 to promote transparency and accountability in the government. However, there have been concerns about the Act's implementation and its impact on the functioning of the government.</p>\n\n<h3>Key Highlights</h3>\n<p>The Economic Survey has suggested that the RTI Act needs to be reviewed to balance the right to information with the need to protect sensitive information. The Survey has also pointed out that the Act has led to an increase in frivolous requests and has imposed a significant burden on the government.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The RTI Act is a constitutional right, enshrined in Article 19(1)(a) of the Constitution, which guarantees the freedom of speech and expression. The Act also provides for the establishment of the Central Information Commission and the State Information Commissions to oversee its implementation.</p>\n\n<h3>Significance</h3>\n<p>The RTI Act has been instrumental in promoting transparency and accountability in the government. It has enabled citizens to access information about the government's functioning and has helped to expose corruption and wrongdoing.</p>\n\n<h3>Challenges</h3>\n<p>Despite its significance, the RTI Act faces several challenges, including the lack of awareness about the Act, the high cost of accessing information, and the resistance from government officials to provide information.</p>\n\n<h3>Way Forward</h3>\n<p>To address these challenges, the government needs to take steps to increase awareness about the RTI Act, simplify the process of accessing information, and ensure that government officials are held accountable for providing information.</p>\n\n<h3>Prelims Facts</h3>\n<p>The RTI Act was enacted in 2005. The Act applies to all public authorities, including the government, public sector undertakings, and non-governmental organizations that receive government funding.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>Polity and Governance, Social Justice</p>",
    "category": "GS-2"
  },
  {
    "headline": "Corporate investment push strengthens, Rs 4.35 lakh crore lined up in FY26: RBI article",
    "summaryText": "<h3>Why in News</h3>\n<p>The Reserve Bank of India (RBI) has reported that corporate investment is expected to strengthen, with Rs 4.35 lakh crore lined up in FY26.</p>\n\n<h3>Background</h3>\n<p>The Indian economy has been experiencing a slowdown in recent years, and the government has been taking measures to boost investment and growth. The RBI's report suggests that the efforts are yielding results, with a significant increase in corporate investment planned for the upcoming fiscal year.</p>\n\n<h3>Key Highlights</h3>\n<p>The key highlights of the RBI's report include: \n- Rs 4.35 lakh crore of corporate investment lined up in FY26\n- Increase in investment across various sectors, including infrastructure, manufacturing, and services\n- Improvement in business sentiment and confidence among investors</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The government has implemented various policies and schemes to promote investment, including the Make in India initiative, the National Investment Promotion and Facilitation Agency, and the Ease of Doing Business initiative. These efforts aim to create a favorable business environment and attract domestic and foreign investment.</p>\n\n<h3>Significance</h3>\n<p>The increase in corporate investment is significant, as it can lead to job creation, economic growth, and increased competitiveness. It can also help to bridge the infrastructure gap and improve the overall business environment in the country.</p>\n\n<h3>Challenges</h3>\n<p>Despite the positive outlook, there are challenges that need to be addressed, including: \n- Regulatory and bureaucratic hurdles\n- Infrastructure constraints\n- Global economic uncertainty</p>\n\n<h3>Way Forward</h3>\n<p>To sustain the momentum, the government and regulatory bodies need to continue to work together to address the challenges and create a favorable business environment. This includes simplifying regulations, improving infrastructure, and promoting investment through various schemes and initiatives.</p>\n\n<h3>Prelims Facts</h3>\n<p>Key facts for prelims include: \n- RBI report on corporate investment\n- Rs 4.35 lakh crore of investment lined up in FY26\n- Sectors that are expected to see an increase in investment, including infrastructure, manufacturing, and services</p>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic can be categorized under the Indian Economy section of the GS paper, specifically under the sub-topic of Investment and Growth.</p>",
    "category": "GS-2"
  },
  {
    "headline": "President of Switzerland on India’s AI summit: Can we make Artificial Intelligence more equal, together?",
    "summaryText": "<h3>Why in News</h3>\n<p>The President of Switzerland has recently attended India's AI summit, emphasizing the need for collaboration to make Artificial Intelligence more equal and accessible to all.</p>\n\n<h3>Background</h3>\n<p>Artificial Intelligence has been rapidly advancing and transforming various sectors, including healthcare, finance, and education. However, concerns have been raised about the potential risks and biases associated with AI, particularly in terms of unequal access and distribution of benefits.</p>\n\n<h3>Key Highlights</h3>\n<p>The President of Switzerland highlighted the importance of international cooperation to address the challenges posed by AI and ensure that its benefits are shared equitably. The summit also discussed the need for responsible AI development, deployment, and regulation.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>There are currently no specific constitutional or legal provisions in India that directly address the development and use of AI. However, the government has established a National AI Strategy and has been working on developing regulations and guidelines for the responsible use of AI.</p>\n\n<h3>Significance</h3>\n<p>The collaboration between India and Switzerland on AI has significant implications for promoting equitable access to AI and addressing the challenges associated with its development and deployment. This partnership can also facilitate the sharing of best practices and expertise in AI research and development.</p>\n\n<h3>Challenges</h3>\n<p>One of the major challenges in making AI more equal is addressing the existing biases and disparities in access to AI technologies. Additionally, there are concerns about job displacement, privacy, and security risks associated with AI.</p>\n\n<h3>Way Forward</h3>\n<p>To make AI more equal, it is essential to prioritize responsible AI development, deployment, and regulation. This can be achieved through international cooperation, investment in AI research and development, and the establishment of robust regulatory frameworks.</p>\n\n<h3>Prelims Facts</h3>\n<p>India has launched the National AI Strategy, which aims to promote the development and use of AI in various sectors. Switzerland has also been actively engaged in AI research and development, with a focus on promoting responsible AI innovation.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic can be categorized under GS Paper II (International Relations) and GS Paper III (Science and Technology).</p>",
    "category": "GS-2"
  },
  {
    "headline": "IIM Lucknow announces 3 new programmes on Artificial Intelligence, one UG course require JEE score",
    "summaryText": "<h3>Why in News</h3>\n<p>IIM Lucknow has announced the launch of three new programmes focused on Artificial Intelligence, aiming to cater to the growing demand for AI expertise in the industry.</p>\n\n<h3>Background</h3>\n<p>Indian Institute of Management (IIM) Lucknow has been at the forefront of management education in India, and the introduction of AI-focused programmes is a significant step towards addressing the emerging needs of the business world.</p>\n\n<h3>Key Highlights</h3>\n<p>The three new programmes include a postgraduate programme, an executive programme, and an undergraduate programme, with the latter requiring a JEE score for admission. These programmes are designed to provide students with a comprehensive understanding of AI concepts, tools, and applications.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The introduction of these programmes is in line with the National Education Policy (NEP) 2020, which emphasizes the importance of emerging technologies like AI in the education sector. The programmes are also aligned with the government's initiatives to promote AI adoption and development in the country.</p>\n\n<h3>Significance</h3>\n<p>The launch of these programmes is significant as it will help bridge the gap between the industry's demand for AI talent and the availability of skilled professionals. It will also provide students with a unique opportunity to acquire skills in AI and pursue a career in this rapidly growing field.</p>\n\n<h3>Challenges</h3>\n<p>One of the challenges in implementing these programmes is the need for specialized faculty and infrastructure. Additionally, the programmes will require continuous updates to keep pace with the rapidly evolving AI landscape.</p>\n\n<h3>Way Forward</h3>\n<p>To ensure the success of these programmes, IIM Lucknow will need to establish partnerships with industry leaders and academia to provide students with hands-on experience and exposure to real-world AI applications. The institute will also need to invest in faculty development and infrastructure to support the growth of these programmes.</p>\n\n<h3>Prelims Facts</h3>\n<p>IIM Lucknow has launched three new programmes on Artificial Intelligence. The undergraduate programme requires a JEE score for admission. The programmes are designed to provide students with a comprehensive understanding of AI concepts, tools, and applications.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic can be categorized under GS Paper 2 (Polity and Governance) and GS Paper 3 (Technology, Economic Development, and Environment).\n\n</p>",
    "category": "GS-2"
  },
  {
    "headline": "India and Nepal sign MoU to strengthen cooperation in Forests, Wildlife, Environment, Biodiversity Conservation and Climate Change",
    "summaryText": "<h3>Why in News</h3>\n<p>India and Nepal have signed a Memorandum of Understanding (MoU) to strengthen cooperation in the areas of forests, wildlife, environment, biodiversity conservation, and climate change.</p>\n\n<h3>Background</h3>\n<p>The MoU aims to promote cooperation between the two countries in the conservation and management of forests, wildlife, and biodiversity, as well as in addressing the challenges of climate change.</p>\n\n<h3>Key Highlights</h3>\n<p>The key highlights of the MoU include collaboration in forest management, wildlife conservation, environmental protection, biodiversity conservation, and climate change mitigation and adaptation.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The MoU is in line with the provisions of the Indian Forest Act, 1927, the Wildlife Protection Act, 1972, and the Environment Protection Act, 1986, as well as Nepal's Forest Act, 1993, and the National Parks and Wildlife Conservation Act, 1973.</p>\n\n<h3>Significance</h3>\n<p>The MoU is significant as it will help to strengthen the cooperation between India and Nepal in the areas of forests, wildlife, environment, biodiversity conservation, and climate change, and will contribute to the achievement of the Sustainable Development Goals (SDGs).</p>\n\n<h3>Challenges</h3>\n<p>The challenges in the implementation of the MoU include the need for effective coordination and cooperation between the two countries, as well as the need for adequate funding and resources to support the conservation and management of forests, wildlife, and biodiversity.</p>\n\n<h3>Way Forward</h3>\n<p>The way forward includes the establishment of a joint committee to oversee the implementation of the MoU, as well as the development of a detailed action plan to achieve the objectives of the MoU.</p>\n\n<h3>Prelims Facts</h3>\n<p>India and Nepal share a long border and have a strong cultural and economic relationship. The MoU is an important step in strengthening the cooperation between the two countries in the areas of forests, wildlife, environment, biodiversity conservation, and climate change.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>The topic is relevant to GS Paper II (International Relations) and GS Paper III (Environment and Ecology).</p>",
    "category": "GS-3"
  },
  {
    "headline": "RBI doubles collateral-free loans to MSMEs to Rs 20 lakh",
    "summaryText": "<h3>Why in News</h3>\n<p>The Reserve Bank of India (RBI) has doubled the limit of collateral-free loans to Micro, Small and Medium Enterprises (MSMEs) to Rs 20 lakh, in a bid to support the sector.</p>\n\n<h3>Background</h3>\n<p>The RBI had earlier increased the limit to Rs 10 lakh in 2018, with the aim of providing easier access to credit for MSMEs. The move is expected to benefit micro and small enterprises, and help them meet their working capital requirements.</p>\n\n<h3>Key Highlights</h3>\n<p>The key highlights of the RBI's decision include: doubling of the limit of collateral-free loans to MSMEs to Rs 20 lakh, and the move is expected to benefit over 80 lakh MSMEs in the country.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The RBI's decision is based on the provisions of the Micro, Small and Medium Enterprises Development (MSMED) Act, 2006, which defines MSMEs and provides for their development and promotion.</p>\n\n<h3>Significance</h3>\n<p>The move is significant as it will provide easier access to credit for MSMEs, which are a crucial sector of the Indian economy. The decision is also expected to boost employment and economic growth.</p>\n\n<h3>Challenges</h3>\n<p>Despite the RBI's decision, MSMEs continue to face challenges in accessing credit, including lack of collateral, high interest rates, and complex procedures. The government and the RBI need to address these challenges to ensure that the benefits of the decision reach the intended beneficiaries.</p>\n\n<h3>Way Forward</h3>\n<p>The way forward includes: simplifying the procedures for accessing credit, increasing awareness about the RBI's decision, and providing support to MSMEs to help them meet their working capital requirements.</p>\n\n<h3>Prelims Facts</h3>\n<p>The RBI's decision to double the limit of collateral-free loans to MSMEs to Rs 20 lakh is a significant development, and the following facts are relevant for prelims: the earlier limit was Rs 10 lakh, and the move is expected to benefit over 80 lakh MSMEs in the country.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>The topic can be categorized under the following GS papers: GS III (Economy), and is relevant for the UPSC Civil Services Examination.</p>",
    "category": "GS-3"
  },
  {
    "headline": "India well placed amid global uncertainty, growth strong and inflation benign: RBI Governor",
    "summaryText": "<h3>Why in News</h3>\n<p>Recent statements by the RBI Governor have highlighted India's strong economic position amidst global uncertainty, with a focus on the country's robust growth and controlled inflation.</p>\n\n<h3>Background</h3>\n<p>The global economy is facing numerous challenges, including the ongoing pandemic, geopolitical tensions, and supply chain disruptions. However, India has managed to maintain a strong economic growth trajectory, with the RBI playing a crucial role in navigating these challenges.</p>\n\n<h3>Key Highlights</h3>\n<p>The RBI Governor has emphasized that India's growth is strong and inflation is benign, making it an attractive destination for investments. The Governor also highlighted the importance of maintaining macroeconomic stability and ensuring that the economic growth is sustainable and inclusive.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The RBI is constitutionally mandated to regulate the monetary policy of the country, with the primary objective of maintaining price stability and promoting economic growth. The RBI Act, 1934, provides the legal framework for the RBI's functions and powers.</p>\n\n<h3>Significance</h3>\n<p>India's strong economic position amidst global uncertainty has significant implications for the country's growth and development. A stable and growing economy can attract investments, create jobs, and improve the overall standard of living of the citizens.</p>\n\n<h3>Challenges</h3>\n<p>Despite the strong economic growth, India still faces numerous challenges, including a widening trade deficit, declining private investments, and a slowing global economy. The RBI and the government need to work together to address these challenges and ensure that the economic growth is sustainable and inclusive.</p>\n\n<h3>Way Forward</h3>\n<p>The RBI and the government need to continue to work together to maintain macroeconomic stability, promote economic growth, and ensure that the benefits of growth are shared by all sections of society. This can be achieved through a combination of monetary and fiscal policies, as well as structural reforms to improve the business environment and attract investments.</p>\n\n<h3>Prelims Facts</h3>\n<p>RBI Governor: The Governor of the Reserve Bank of India is the chief executive of the RBI and is responsible for regulating the monetary policy of the country. RBI Act, 1934: The RBI Act, 1934, provides the legal framework for the RBI's functions and powers.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>Indian Economy: This topic is relevant to the Indian Economy section of the GS Paper, which covers topics such as economic growth, inflation, monetary policy, and fiscal policy.</p>",
    "category": "GS-3"
  },
  {
    "headline": "RBI keeps repo rate unchanged at 5.25%, maintains neutral stance",
    "summaryText": "<h3>Why in News</h3>\n<p>The Reserve Bank of India (RBI) has decided to keep the repo rate unchanged at 5.25%, while maintaining a neutral stance, in a bid to balance growth and inflation concerns.</p>\n\n<h3>Background</h3>\n<p>The RBI's decision comes amidst a slowing economy and rising inflationary pressures, with the consumer price index (CPI) exceeding the central bank's target range of 2-6%.</p>\n\n<h3>Key Highlights</h3>\n<p>The key highlights of the RBI's decision include: \n- Repo rate remains unchanged at 5.25%\n- Reverse repo rate remains unchanged at 4.65%\n- Marginal standing facility (MSF) rate and the bank rate remain unchanged at 5.25%\n- Neutral monetary policy stance maintained</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The RBI's monetary policy decisions are guided by the Reserve Bank of India Act, 1934, which mandates the central bank to regulate the money supply, maintain price stability, and promote economic growth.</p>\n\n<h3>Significance</h3>\n<p>The RBI's decision to keep the repo rate unchanged is significant, as it aims to balance the need to support economic growth with the need to control inflation and maintain financial stability.</p>\n\n<h3>Challenges</h3>\n<p>The RBI faces challenges in achieving its monetary policy objectives, including managing inflationary pressures, supporting economic growth, and maintaining financial stability in a volatile global economic environment.</p>\n\n<h3>Way Forward</h3>\n<p>Going forward, the RBI will need to carefully monitor economic developments and adjust its monetary policy stance as needed to achieve its objectives, while also ensuring that the economy remains on a sustainable growth path.</p>\n\n<h3>Prelims Facts</h3>\n<p>Key facts for prelims include: \n- Repo rate: 5.25%\n- Reverse repo rate: 4.65%\n- MSF rate and bank rate: 5.25%</p>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic can be categorized under GS Paper 3, which covers Indian economy, including issues related to planning, mobilization of resources, growth, development, and employment.</p>",
    "category": "GS-3"
  },
  {
    "headline": "Union Budget: Rs 10,000-crore SME Growth Fund, reform to boost liquidity for MSMEs",
    "summaryText": "<h3>Why in News</h3>\n<p>The Union Budget has announced a Rs 10,000-crore SME Growth Fund to boost liquidity for Micro, Small, and Medium Enterprises (MSMEs), which has been a significant sector in the country's economic growth.</p>\n\n<h3>Background</h3>\n<p>MSMEs have been facing liquidity issues due to the pandemic and other economic factors, affecting their growth and development. The government has been taking measures to support the sector, including the introduction of various schemes and funds.</p>\n\n<h3>Key Highlights</h3>\n<p>The SME Growth Fund will provide financial support to MSMEs, enabling them to access capital and expand their businesses. The fund will also facilitate the growth of startups and encourage entrepreneurship in the country.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The government has made provisions in the budget to support the MSME sector, including the SME Growth Fund, which will be governed by the regulations and guidelines set by the Ministry of Micro, Small, and Medium Enterprises.</p>\n\n<h3>Significance</h3>\n<p>The SME Growth Fund is expected to have a positive impact on the MSME sector, promoting economic growth, employment, and entrepreneurship. It will also contribute to the country's overall development and GDP growth.</p>\n\n<h3>Challenges</h3>\n<p>Despite the government's efforts, the MSME sector still faces challenges such as limited access to credit, inadequate infrastructure, and regulatory issues. The effectiveness of the SME Growth Fund will depend on its implementation and the ability to address these challenges.</p>\n\n<h3>Way Forward</h3>\n<p>The government needs to ensure that the SME Growth Fund is utilized efficiently and effectively, with a focus on supporting the growth of MSMEs and promoting entrepreneurship. Additionally, the government should continue to address the challenges faced by the sector and provide a conducive business environment.</p>\n\n<h3>Prelims Facts</h3>\n<p>The SME Growth Fund has been allocated Rs 10,000 crore in the Union Budget. The fund will support the growth of MSMEs, startups, and entrepreneurship in the country.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic can be categorized under GS Paper II (Polity and Governance) and GS Paper III (Economy), as it relates to the government's economic policies and initiatives to support the MSME sector.</p>",
    "category": "GS-3"
  },
  {
    "headline": "Union Budget 2026: Govt proposes to top up Self Reliant India Fund with Rs 4,000 crore in FY27 to support MSMEs",
    "summaryText": "<h3>Why in News</h3>\n<p>The Union Budget 2026 has proposed to top up the Self Reliant India Fund with Rs 4,000 crore in FY27 to support MSMEs, as announced by the government.</p>\n\n<h3>Background</h3>\n<p>The Self Reliant India Fund was established to provide financial support to Micro, Small, and Medium Enterprises (MSMEs) in India, with the aim of promoting self-reliance and entrepreneurship in the sector.</p>\n\n<h3>Key Highlights</h3>\n<p>The key highlights of the proposal include: \n- Allocation of Rs 4,000 crore to the Self Reliant India Fund in FY27.\n- The fund will provide financial support to MSMEs, focusing on promoting self-reliance and entrepreneurship.\n- The move is expected to boost the growth and development of MSMEs in India.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The proposal is in line with the government's initiatives to promote MSMEs, as outlined in various policies and schemes, including the Micro, Small and Medium Enterprises Development Act, 2006.</p>\n\n<h3>Significance</h3>\n<p>The proposal holds significance as it aims to promote self-reliance and entrepreneurship among MSMEs, which are a crucial sector in the Indian economy, providing employment opportunities and contributing to the country's GDP.</p>\n\n<h3>Challenges</h3>\n<p>Despite the proposal, MSMEs in India continue to face challenges such as limited access to finance, inadequate infrastructure, and intense competition, which may hinder their growth and development.</p>\n\n<h3>Way Forward</h3>\n<p>To effectively utilize the allocated funds and promote the growth of MSMEs, the government should focus on implementing policies that address the challenges faced by the sector, such as simplifying regulatory frameworks and providing access to finance and markets.</p>\n\n<h3>Prelims Facts</h3>\n<p>Key facts to note: \n- The Self Reliant India Fund was established to support MSMEs.\n- The fund will receive an allocation of Rs 4,000 crore in FY27.\n- The Micro, Small and Medium Enterprises Development Act, 2006, is a key policy framework for promoting MSMEs in India.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>The topic can be categorized under the General Studies Paper III, which covers topics related to the Indian economy, including government schemes and policies, and the development of MSMEs.</p>",
    "category": "GS-3"
  },
  {
    "headline": "Congress leaders accepted Partition as only way forward: New NCERT book",
    "summaryText": "<h3>Why in News</h3>\n<p>A new NCERT book has been released, which states that Congress leaders accepted Partition as the only way forward.</p>\n\n<h3>Background</h3>\n<p>The book highlights the historical context surrounding the Partition of India and the role of key leaders in the decision-making process.</p>\n\n<h3>Key Highlights</h3>\n<p>The book notes that the Congress leaders, including Jawaharlal Nehru and Mahatma Gandhi, ultimately accepted the Partition plan due to the complexities of the situation and the need for a swift resolution.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The Indian Independence Act of 1947, which paved the way for the Partition, is a key constitutional provision relevant to this topic.</p>\n\n<h3>Significance</h3>\n<p>The book's assertion about Congress leaders accepting Partition has significant implications for our understanding of India's history and the decisions that shaped the nation's trajectory.</p>\n\n<h3>Challenges</h3>\n<p>The Partition of India resulted in one of the largest mass migrations in history, leading to significant social, economic, and cultural challenges for the newly independent nation.</p>\n\n<h3>Way Forward</h3>\n<p>Understanding the historical context of the Partition and its aftermath can inform strategies for addressing ongoing social and economic disparities in India.</p>\n\n<h3>Prelims Facts</h3>\n<p>Key dates: August 15, 1947 (Indian Independence Day), June 3, 1947 (Mountbatten Plan announced).</p>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic falls under GS Paper I: History and Culture, with relevance to Indian history, particularly the period surrounding Independence and Partition.</p>",
    "category": "GS-1"
  },
  {
    "headline": "ISRO rocket LVM-3 places 6000-kg US satellite – its heaviest – into orbit",
    "summaryText": "<h3>Why in News</h3>\n<p>The Indian Space Research Organisation (ISRO) has successfully launched its heaviest satellite, a 6000-kg US satellite, into orbit using the LVM-3 rocket.</p>\n\n<h3>Background</h3>\n<p>The LVM-3 rocket, also known as the Geosynchronous Satellite Launch Vehicle Mark III (GSLV Mk III), is a heavy-lift launch vehicle developed by ISRO. It has a payload capacity of up to 8000 kg to the Geosynchronous Transfer Orbit (GTO). The rocket has previously launched several satellites, including the Chandrayaan-2 mission to the Moon.</p>\n\n<h3>Key Highlights</h3>\n<p>The LVM-3 rocket launched the 6000-kg US satellite into a geosynchronous transfer orbit. The satellite is the heaviest payload launched by ISRO to date. The launch demonstrates ISRO's capability to launch heavy satellites into orbit, making it a significant milestone for the Indian space program.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The launch is governed by the Indian Space Policy, which outlines the framework for the country's space activities. The policy aims to promote the use of space technology for national development and to establish India as a major player in the global space industry.</p>\n\n<h3>Significance</h3>\n<p>The successful launch of the LVM-3 rocket with a 6000-kg US satellite has significant implications for India's space program. It demonstrates ISRO's capability to launch heavy satellites into orbit, making it a major player in the global launch market. The launch also highlights India's growing expertise in space technology and its potential to become a hub for satellite launches.</p>\n\n<h3>Challenges</h3>\n<p>Despite the success of the launch, ISRO faces several challenges, including the need to develop more advanced launch vehicles and to increase its payload capacity. The organization also needs to address concerns related to the cost and reliability of its launches.</p>\n\n<h3>Way Forward</h3>\n<p>ISRO plans to continue developing its launch capabilities, with a focus on reusable launch vehicles and advanced propulsion systems. The organization also aims to increase its international cooperation and to establish itself as a major player in the global space industry.</p>\n\n<h3>Prelims Facts</h3>\n<p>LVM-3 rocket, Geosynchronous Satellite Launch Vehicle Mark III (GSLV Mk III), payload capacity of up to 8000 kg, Geosynchronous Transfer Orbit (GTO), Chandrayaan-2 mission.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>Science and Technology, Space Technology, Indian Space Research Organisation (ISRO), LVM-3 rocket, Satellite Launch.</p>",
    "category": "GS-3"
  },
  {
    "headline": "Budget’s STT hike, lack of positive triggers batter stocks as market slumps 2%",
    "summaryText": "<h3>Why in News</h3>\n<p>The recent budget announcement has led to a hike in Securities Transaction Tax (STT), resulting in a significant slump in the stock market, with a 2% decline in market value.</p>\n\n<h3>Background</h3>\n<p>The Securities Transaction Tax (STT) is a tax levied on the purchase and sale of securities in India. The STT was introduced in 2004 to reduce the burden of taxation on investors and to increase market transparency.</p>\n\n<h3>Key Highlights</h3>\n<p>The budget has proposed an increase in STT, which is expected to negatively impact the stock market. The lack of positive triggers in the budget has also contributed to the market slump.</p>\n\n<h3>Constitutional / Legal Provisions</h3>\n<p>The STT is governed by the Securities Transaction Tax Act, 2004, which empowers the central government to levy tax on securities transactions.</p>\n\n<h3>Significance</h3>\n<p>The increase in STT is expected to reduce trading activity in the stock market, leading to a decline in market liquidity. This could have a negative impact on the overall economy.</p>\n\n<h3>Challenges</h3>\n<p>The government faces the challenge of balancing the need to increase revenue through taxation with the need to promote economic growth through a vibrant stock market.</p>\n\n<h3>Way Forward</h3>\n<p>The government could consider revising the STT hike or introducing measures to promote market liquidity and trading activity, such as reducing other taxes or introducing incentives for investors.</p>\n\n<h3>Prelims Facts</h3>\n<p>Securities Transaction Tax (STT) is a tax levied on the purchase and sale of securities in India. The STT was introduced in 2004.</p>\n\n<h3>GS Paper Categorization</h3>\n<p>This topic can be categorized under GS Paper 3, which deals with Economic Development and related issues.</p>",
    "category": "GS-1"
  }
]