[
  {
    "headline": "Prime Minister addresses the Israeli Parliament - Knesset",
    "fullText": "Prime Minister Shri Narendra Modi addressed today a Special Plenary of the Knesset in Jerusalem. He is the first Indian Prime Minister to address the Israeli parliament.\n\nUpon his arrival at the Knesset, Prime Minister was received by the Speaker of the Knesset, H.E. Amir Ohana and accorded a ceremonial welcome. The Prime Minister of Israel, H.E. Mr. Benjamin Netanyahu; Leader of Opposition, H.E. Mr Yair Lapid; and Speaker Ohana spoke in the Plenary ahead of Prime Minister’s address, expressing strong bipartisan support for India-Israel ties.\n\nPrime Minister began his address by thanking the Speaker for the special honour. He expressed gratitude for being bestowed with the \"Speaker of The Knesset” medal, which he dedicated to the enduring friendship and shared democratic traditions of the two countries. Highlighting the strong bonds of friendship between India and Israel, Prime Minister noted that the two peoples share both ancient civilizational ties and a robust contemporary partnership based on technology, innovation, defence, security and strategic convergences. He stated that the vibrant people-to-people ties based on cooperation in agriculture, rural development, water management, sustainability and enterprise have imparted a dynamic outlook to the relationship. Underlining the historical connections and two-way movement of people between the two countries, Prime Minister stated that the Indian community in Israel and the Jewish diaspora in India have made significant contribution to progress in both countries.\n\nRecalling the uncompromising policy of zero tolerance for terrorism of the two countries, Prime Minister offered condolences for the October 7 terror attack and noted that there can be no justification for such brutality. He offered India’s support to all efforts that contribute to durable peace and stability in the region. In this context, he highlighted India’s firm support for the Gaza Peace Initiative endorsed by the UN Security Council. Noting the ongoing collaboration between India and Israel in the plurilateral arena, he called for deeper interaction between the two countries in the India-Middle East-Europe Economic Corridor [IMEC] and the I2U2 frameworks.\n\nPrime Minister highlighted India’s growth story and sought greater bilateral collaboration in the fields of trade, investment, infrastructure development, green growth, start-ups, digital solutions and emerging technologies, unlocking the innovation and creativity of the youth. Expressing satisfaction at the conclusion of the Bilateral Investment Treaty, he called for early finalisation of an ambitious Free Trade Agreement to realise the untapped trade potential.\n\nPrime Minister called for greater parliamentary interaction between the two vibrant democracies taking advantage of the recently formed Parliamentary Friendship Group for Israel in India. Drawing parallels between the ethos of the two civilizations, Prime Minister noted that India’s philosophy of Vasudhaiva Kutumbakam [the world is one family] and the Israeli principle of Tikkum Olam [healing the world] speak of shared approaches towards a harmonious society. Prime Minister thanked the members of the Knesset for their contribution to India-Israel ties and conveyed good wishes for the upcoming festival of Purim. The full address of Prime Minister may be seen here [link]",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232916&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister’s Address to the Knesset ",
    "fullText": "His Excellency, Prime Minister Benjamin Netanyahu,\n\nHis Excellency, Mr. Amir Ohana, Speaker of the Knesset,\n\nHis Excellency, Mr. Yair Lapid, Leader of the Opposition,\n\nHon’ble Members of the Knesset,\n\nMy dear sisters and brothers,\n\nShalom!\n\nNamaste!\n\nHon’ble Members,\n\nIt is a privilege and an honour for me to stand before this distinguished House. I do so as the Prime Minister of India, and also as a representative of one ancient civilisation addressing another. I bring with me the greetings of 1.4 billion Indians, and a message of friendship, respect, and partnership.\n\nI thank you, Mr. Speaker, for your kind invitation. And for your wonderful gesture of lighting up the Knesset in Indian colours. Your visit to India three years ago was the first by a Speaker of the Knesset. And thanks to you, I am the first Prime Minister of India to address this august gathering.\n\nNine years ago, I had the good fortune to be the first Prime Minister of India to visit Israel. And I am very happy to be here again, returning to a land to which I have always felt drawn. Afterall, I was born on the same day that India formally recognized Israel – September 17, 1950!\n\nHon’ble Members,\n\nI also carry with me the deepest condolences of the people of India for every life lost and for every family whose world was shattered in the barbaric terrorist attack by Hamas on \"October 7”. We feel your pain. We share your grief. India stands with Israel, firmly, with full conviction, in this moment, and beyond.\n\nNo cause can justify the murder of civilians. Nothing can justify terrorism.\n\nIndia has also endured the pain of terrorism for a long time. We remember the 26/11 Mumbai attacks and the innocent lives lost, including Israeli citizens. Like you, we have a consistent and uncompromising policy of zero tolerance for terrorism, with no double standards.\n\nTerrorism aims to destabilise societies, to block development, and to erode trust. Countering terrorism requires sustained and coordinated global action, because terror anywhere threatens peace everywhere. That is why, India supports all efforts that contribute to durable peace and regional stability.\n\nSome years ago, when you concluded the Abraham Accords, we applauded your courage and vision. It was a moment of new hope for a long-troubled region. Since then, the situation has changed significantly. The path is even more challenging. Yet it is important to sustain that hope.\n\nThe Gaza Peace Initiative that was endorsed by the UN Security Council offers a pathway. India has expressed its firm support for the initiative. We believe that it holds the promise of a just and durable peace for all the people of the region, including by addressing the Palestine Issue.\n\nLet all our efforts be guided by wisdom, courage, and humanity. The road to peace is not always easy. But India joins you and the world for dialogue, peace and stability in this region.\n\nHon’ble Members,\n\nIn India, there is great admiration for Israel’s resolve, courage, and achievements. Long before we related to each other as modern States, we were linked by ties that go back more than two thousand years. The Book of Esther refers to India as Hodu. The Talmud records trade with India in ancient times.\n\nJewish merchants travelled across sea routes that connected the Mediterranean with the Indian Ocean. They came seeking opportunity and dignity. And, in India, they became one of us.\n\nJewish communities have lived in India without fear of persecution or discrimination. They have preserved their faith and participated fully in society. That record is a source of pride for us.\n\nHon’ble Members,\n\nThe Bene Israel of Maharashtra, the Cochini Jews of Keralam, the Baghdadi Jews of Kolkata and Mumbai, and the Bnei Menashe of the North East have enriched India. In my home state Gujarat, there is a school set-up by a Bene Israeli family - Mister and Missus Best. It is an excellent school, and of course, it is called the Best School!\n\nEdwyn Myers gave shape to the Films Division of India and was a towering figure in the history of Indian cinema. Doctor Reuben David was the founder of the Kankaria Zoo in Ahmedabad. The actor David Abraham Cheulkar, or Uncle David, became a household name across the country. Walter Kaufmann composed the signature tune for All India Radio. David Sassoon built many institutions that still serve Indian society.\n\nAnd, of course, the heroic contribution of Lt. General J.F.R. Jacob during the 1971 war with Pakistan is widely known. I had the honour of working closely with him after his retirement. We discussed India-Israel relations, among many other things, over many cups of tea. There have been countless others whose contributions are woven into India’s rich fabric of life.\n\nHon’ble Members,\n\nThere was movement from India to Israel too, when many Indian Jews migrated to Israel in the mid twentieth century. Today, a vibrant Indian-origin Jewish community lives here. They have contributed to the building of modern Israel, in laboratories and hospitals, in classrooms, and also on the battlefield. They hold firmly that Israel is their fatherland and India their motherland. We are proud of them.\n\nHon’ble Members,\n\nIndia’s connection to this land is also written in blood and sacrifice. During the First World War, more than four thousand Indian soldiers laid down their lives in this region. The cavalry charge at Haifa in September 1918 remains a significant chapter in military history.\n\nMajor Thakur Dalpat Singh, remembered as the Hero of Haifa, symbolises this shared history. During my last visit, I was deeply moved to pay my respects at the Haifa memorial for Indian soldiers.\n\nHon’ble Members,\n\nLast month, the world marked the International Holocaust Remembrance Day. The Holocaust stands as one of humanity’s darkest chapters. Yet, even in those turbulent years, some acts of humanity stood out. The Maharaja of Nawanagar in Gujarat, also known as the Jam Saheb, offered refuge to Polish children, including Jewish children, who had nowhere else to turn. I am told that a statue of Jam Saheb was unveiled in Moshav Nevatim recently.\n\nThank you. Thank you, for this honour and remembrance.\n\nHon’ble Members,\n\nAfter India’s independence, many Indian leaders felt a kinship with the people of Israel. India’s parliamentary debates of the 1950s are witness to their admiration for Israel’s efforts to develop agriculture in the desert. The Kibbutz movement of Israel inspired our leaders like Acharya Vinoba Bhave and Loknayak Jayaprakash Narayan. First in my home state Gujarat, and now across India, I have seen the approach of \"Per Drop, More Crop” work wonders in agriculture.\n\nMy own first visit to Israel was in 2006, as the Chief Minister of Gujarat. Later, in 2017, during my visit to Israel as Prime Minister, our two countries elevated their relationship to a Strategic Partnership. Since then, our engagement has expanded in scale and scope. And we are committed to further consolidate this relationship across many sectors.\n\nHon’ble Members,\n\nFor the last few years, India has been the fastest-growing major economy in the world. Soon, we will be among the top three economies globally. At the same time, Israel is a powerhouse of innovation and technological leadership. This creates a natural foundation for a forward-looking partnership.\n\nWe are committed to expanding trade, strengthening investment flows, and promoting joint infrastructure development. The Bilateral Investment Treaty signed last year will provide confidence and predictability to our businesses.\n\nIn the last few years, India has concluded a number of important trade agreements with other nations. To your West, the European Union, and the UK. To your East, the UAE and Oman.\n\nOur bilateral goods trade has grown manifold in recent years. But, it does not reflect the full scope of opportunity. That is why our teams are working hard to negotiate an ambitious Free Trade Agreement. It will unlock the vast untapped potential in our trade relationship.\n\nWe will also work closely in different formats such as the India–Middle East–Europe Economic Corridor and the I2U2 framework between India, Israel, UAE and the US. Defence and Security is another important pillar of our partnership. In November last year, we signed an MOU on Defence Cooperation. In today’s uncertain world, a strong defence partnership between trusted partners like India and Israel is of vital importance.\n\nHon’ble Members,\n\nIsrael is often called the \"start-up nation”. In recent years, we have also been working to unlock the innovation and creativity of our youth. I recall that in 2018, Prime Minister Netanyahu and I inaugurated the iCreate Technology Business Incubator in India. Since then, it has supported nearly 900 such start-ups.\n\nLast week, we hosted the world’s largest and most democratised AI Impact Summit, with representatives from over 100 countries. Our aspirational spirit aligns naturally with Israel’s innovation ecosystem. I see a lot of synergies in areas such as quantum technologies, semiconductors, and artificial intelligence. We are also working with Israel on creating cross-border financial linkages using our Digital Public Infrastructure.\n\nHon’ble Members,\n\nI mentioned how inspiring we found Israel’s agricultural miracle in the desert. Israeli expertise in precision irrigation and water management has already transformed agricultural practices in India.\n\nTogether, we have established 43 Centres of Excellence across India that have provided training to more than half a million farmers. We should now set an ambitious goal of expanding to 100 Centres to benefit millions of farmers and fishermen.\n\nHon’ble Members,\n\nAt the heart of the India-Israel partnership are the ties between our peoples. When I first visited Israel in 2006, there were a handful of Yoga centres in Israel. Today, Yoga seems to be practiced in almost every neighbourhood!\n\nI am told that interest in Ayurveda is also growing in Israel. I invite more and more young Israelis to travel to India. They will witness the dynamism of our society, and experience what holistic wellness can do for the body and the mind.\n\nI am happy to inform this august house that the Indian Parliament has set-up a Parliamentary Friendship Group for Israel. I invite you all to visit India and look forward to having more exchanges between our Members of Parliament.\n\nI am aware that Indian caregivers and skilled workers in Israel contribute immensely to families and communities. They have displayed remarkable courage and dedication in times of crisis, including on October 7. We are proud of them.\n\nAs the Jewish teaching reminds us, \"Whoever saves one life, saves the entire world.” Their service reflects the strength of the human bonds behind our cooperation. We will continue to facilitate the movement of workers and professionals across sectors that benefit both of our nations.\n\nHon’ble Members,\n\nWe are both ancient civilizations. And it is perhaps no surprise that our civilisational traditions also reveal philosophical parallels. In Israel, the principle of Tikkun Olam speaks of healing the world. In India, Vasudhaiva Kutumbakam affirms that the world is one family. Both ideas extend responsibility beyond immediate boundaries. They ask societies to act with compassion and moral courage.\n\nJudaism emphasises Halakha, guiding everyday conduct through law and practice. Hindu philosophy speaks of Dharma, the moral order that shapes duty and right action. In both traditions, ethical life is lived through action, and faith is expressed through conduct.\n\nThere is an endearing similarity in our festivals as well. You celebrate Hanukkah with the warm glow of candles. Around the same time, we celebrate Diwali, the festival of lights, with the gentle radiance of lamps. Soon, India will celebrate the festival of Holi, filled with happiness and colour. And around the same time, Israel will also celebrate Purim with enthusiasm and joy.\n\nHon’ble Members,\n\nOur shared ideals are the deep foundations that give strength to our modern partnership. We are democracies shaped by history and focused on the future. Our partnership is grounded in shared experience and shared aspirations. Our strong partnership not only serves national interests but also contributes to global stability and prosperity.\n\nLet us ensure that the friendship between India and Israel remains a source of strength in an uncertain world.\n\nAm Yisrael Chai.\n\nJai Hind.\n\nThank you.",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232908&reg=3&lang=1"
  },
  {
    "headline": "Indian Railways Begins to Operate 1,244 Holi Special Train Trips Across Zones to Ensure Smooth and Comfortable Festival Travel",
    "fullText": "Indian Railways has made elaborate arrangements to facilitate smooth, safe and comfortable travel for passengers during the upcoming Holi festival. To manage the anticipated surge in passenger traffic, 1244 Holi Special train trips to be operated across various Railway Zones for the Holi period from 25.02.2026 to 18.03.2026. The number may increase up to 1500 if more demand is observed.\n\nThese special services will connect major cities, state capitals and important regional centres across the country, ensuring confirmed accommodation and reducing congestion on regular trains.\n\nKey long-distance connections include Mumbai, Pune and Nagpur to destinations such as Danapur, Gorakhpur, Hazrat Nizamuddin, Samastipur and Barauni; Visakhapatnam, Puri and Bhubaneswar to Shalimar, Patna, Yesvantpur and Dhanbad; and major Bihar and Jharkhand hubs like Patna, Darbhanga, Saharsa and Dhanbad to New Delhi, Anand Vihar Terminal, Chandigarh and SMVT Bengaluru.\n\nEastern and Northern corridors will see enhanced connectivity between Howrah, Sealdah, Kolkata and Malda Town with Raxaul, Madhubani, Gorakhpur and Anand Vihar Terminal, while Delhi region stations will be linked extensively with Varanasi, Lucknow, Ayodhya Cantt, Haridwar, Amritsar and Katihar.\n\nFrom the South, special services will connect MGR Chennai Central, Ernakulam, Thiruvananthapuram North, Coimbatore, Secunderabad, Tirupati and SMVT Bengaluru with Patna, Barauni, Muzaffarpur, Santragachi, Ajmer, Jaipur and other northern and eastern centres. Western India, including Mumbai Central, Ahmedabad, Vadodara, Surat and Bandra Terminus, will have additional links to Kanpur, Katihar, Banaras, Gorakhpur, Darbhanga and Bhagalpur.\n\nWith the objective of providing smooth, safe and comfortable travel during the Holi festival, Central Railway will operate several Holi Special trains from major stations including Mumbai (CSMT & Lokmanya Tilak Terminus), Pune and Nagpur to key destinations across North and East India. Central Railway to run 20 Holi Special Train Services with 129 trips which are as follows:\n\nTrain No. 01469/01470 Pune–Nagpur–Pune Holi Special will operate between 25.02.2026 and 05.03.2026 with notified trips on Wednesdays and Thursdays.\n\nTrain No. 01073/01074 Lokmanya Tilak Terminus–Banaras–Lokmanya Tilak Terminus Holi Special will run between 25.02.2026 and 07.03.2026 on notified weekdays.\n\nTrain No. 01481/01482 Pune–Danapur–Pune Holi Special will operate between 27.02.2026 and 08.03.2026 on Mondays and Fridays (outward) and Wednesdays and Sundays (return).\n\nTrain No. 01431/01432 Pune–Ghazipur City–Pune Holi Special will run between 24.02.2026 and 08.03.2026 on notified weekly frequencies.\n\nTrain No. 01043/01044 Lokmanya Tilak Terminus–Samastipur–Lokmanya Tilak Terminus Holi Special will operate between 26.02.2026 and 05.03.2026.\n\nTrain No. 01491/01492 Pune–Hazrat Nizamuddin–Pune Holi Special will run between 27.02.2026 and 07.03.2026.\n\nTrain No. 01079/01080 CSMT–Gorakhpur–CSMT Holi Special will operate daily from 25.02.2026 to 08.03.2026.\n\nTrain No. 01415/01416 Pune–Gorakhpur–Pune Holi Special will also run daily between 25.02.2026 and 08.03.2026.\n\nTrain No. 01143/01144 Lokmanya Tilak Terminus–Danapur–Lokmanya Tilak Terminus Holi Special will operate daily during the notified period.\n\nTrain No. 01449/01450 Pune–Danapur–Pune Holi Special will also run daily from 25.02.2026 to 08.03.2026.\n\nEast Coast Railway will operate Holi Special trains from Visakhapatnam, Puri and Bhubaneswar towards Eastern and Southern destinations. East Coast Railway to run 8 Holi Special Train Services with 62 trips which are as follows:\n\nTrain No. 08507/08508 Visakhapatnam–Shalimar–Visakhapatnam Holi Special will operate between 03.03.2026 and 18.03.2026.\n\nTrain No. 08439/08440 Puri–Patna–Puri Holi Special will run between 28.02.2026 and 15.03.2026.\n\nTrain No. 02811/02812 Bhubaneswar–Yesvantpur–Bhubaneswar Holi Special will operate between 28.02.2026 and 16.03.2026.\n\nTrain No. 02831/02832 Bhubaneswar–Dhanbad–Bhubaneswar Holi Special will run daily from 25.02.2026 to 18.03.2026.\n\nEast Central Railway will operate a large number of Holi Special trains connecting Bihar and Jharkhand with Delhi, Mumbai and South India. East Central Railway to run 50 Holi Special Train Services with 275 trips which are as follows:\n\nTrain No. 02563/02564 Barauni–New Delhi–Barauni Holi Special will run daily from 25.02.2026 to 18.03.2026.\n\nTrain No. 02569/02570 Darbhanga–New Delhi–Darbhanga Holi Special will also operate daily during the same period.\n\nTrain No. 05575/05576 Saharsa–Anand Vihar Terminal–Saharsa Holi Special will operate between 10.03.2026 and 18.03.2026.\n\nTrain No. 05579/05580 Purnea Court–Anand Vihar Terminal–Purnea Court Holi Special will run between 06.03.2026 and 18.03.2026 on multiple weekly frequencies.\n\nTrain No. 03293/03294 Patna–Old Delhi–Patna Holi Special will operate daily between 05.03.2026 and 16.03.2026.\n\nTrain No. 03697/03698 Sheikhpura–Anand Vihar Terminal–Sheikhpura Holi Special will run between 27.02.2026 and 15.03.2026.\n\nTrain No. 02397/02398 Sheikhpura–Anand Vihar Terminal–Sheikhpura Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nTrain No. 03639/03640 Gaya–Old Delhi–Gaya Holi Special will run between 06.03.2026 and 13.03.2026.\n\nTrain No. 03309/03310 Dhanbad–Old Delhi–Dhanbad Holi Special will operate between 03.03.2026 and 18.03.2026.\n\nTrain No. 03311/03312 Dhanbad–Chandigarh–Dhanbad Holi Special will run between 06.03.2026 and 19.03.2026.\n\nTrain No. 03379/03380 Dhanbad–Lokmanya Tilak Terminus–Dhanbad Holi Special will operate between 10.03.2026 and 19.03.2026.\n\nTrain No. 03677/03678 Dhanbad–Gorakhpur–Dhanbad Holi Special will run between 08.03.2026 and 16.03.2026.\n\nTrain No. 03257/03258 Danapur–Anand Vihar Terminal–Danapur Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nTrain No. 03223/03224 Rajgir–Haridwar–Rajgir Holi Special will run between 06.03.2026 and 14.03.2026.\n\nTrain No. 03221/03222 Rajgir–Anand Vihar Terminal–Rajgir Holi Special will operate between 09.03.2026 and 18.03.2026.\n\nTrain No. 03251/03252 Danapur–SMVT Bengaluru–Danapur Holi Special will run daily between 25.02.2026 and 18.03.2026.\n\nTrain No. 03225/03226 Danapur–Charlapalli–Danapur Holi Special will operate between 05.03.2026 and 15.03.2026.\n\nTrain No. 03253/07855-56 Patna–Charlapalli–Patna Holi Special will run between 09.03.2026 and 16.03.2026.\n\nTrain No. 02023/02024 Patna–Howrah–Patna Holi Special will operate between 08.03.2026 and 15.03.2026.\n\nTrain No. 05557/05558 Raxaul–Lokmanya Tilak Terminus–Raxaul Holi Special will run between 07.03.2026 and 15.03.2026.\n\nTrain No. 05585/05586 Saharsa–Lokmanya Tilak Terminus–Saharsa Holi Special will operate between 10.03.2026 and 19.03.2026.\n\nTrain No. 05219/05220 Muzaffarpur–Anand Vihar Terminal–Muzaffarpur Holi Special will run between 06.03.2026 and 15.03.2026.\n\nWith the objective of managing Holi festival rush, Eastern Railway will operate several Holi Special trains from Howrah, Sealdah, Kolkata, Malda Town, Dankuni and Asansol towards Bihar, Uttar Pradesh and Delhi region. Eastern Railway to run 22 Holi Special Train Services with 48 trips which are as follows:\n\nTrain No. 03043/03044 Howrah–Raxaul–Howrah Holi Special will operate between 28.02.2026 and 15.03.2026 on notified days.\n\nTrain No. 03045/03046 Howrah–Raxaul–Howrah Holi Special will run between 01.03.2026 and 03.03.2026.\n\nTrain No. 03183/03184 Sealdah–Madhubani–Sealdah Holi Special will operate between 28.02.2026 and 08.03.2026.\n\nTrain No. 03185/03186 & 03187/03188 Kolkata–Madhubani–Kolkata Holi Specials will run between 27.02.2026 and 04.03.2026.\n\nTrain No. 03525/03526 and 03527/03528 Asansol–Gorakhpur–Asansol Holi Specials will operate between 27.02.2026 and 03.03.2026.\n\nTrain No. 03009/03010 Dankuni–Anand Vihar Terminal–Dankuni Holi Special will run between 28.02.2026 and 08.03.2026.\n\nTrain No. 03435/03436 Malda Town–Anand Vihar Terminal–Malda Town Holi Special will operate between 02.03.2026 and 17.03.2026.\n\nTrain No. 03007/03008 Howrah–Kharagpur–Howrah Holi Special will run between 25.02.2026 and 13.03.2026.\n\nTrain No. 03129/03130 Kolkata–New Jalpaiguri–Kolkata Holi Special will operate between 28.02.2026 and 01.03.2026.\n\nTrain No. 03101/03102 Sealdah–Malda Town–Sealdah Holi Special will run between 27.02.2026 and 21.03.2026.\n\nTrain No. 03417/03418 Malda Town–Udhna–Malda Town Holi Special will operate between 28.02.2026 and 23.03.2026.\n\nNorthern Railway will operate extensive Holi Special trains connecting Delhi region with Uttar Pradesh, Bihar, Uttarakhand and Punjab. Northern Railway to run 48 Holi Special Train Services with 204 trips which are as follows:\n\nTrain No. 04209/04210 New Delhi–Varanasi–New Delhi Holi Special will operate five days a week between 25.02.2026 and early March.\n\nTrain No. 04213/04214 Ayodhya Cantt–Anand Vihar Terminal–Ayodhya Cantt Holi Special will run tri-weekly.\n\nTrain No. 04227/04228 Varanasi–Chandigarh–Varanasi Holi Special will operate bi-weekly.\n\nTrain No. 04203/04204 Lucknow–New Delhi–Lucknow Holi Special will run weekly.\n\nTrain No. 04052/04051 New Delhi–Howrah–New Delhi Holi Special will operate daily between 25.02.2026 and 08.03.2026.\n\nTrain No. 04014/04013 New Delhi–Barauni–New Delhi Holi Special will run daily during the notified period.\n\nTrain No. 04070/04069 Anand Vihar Terminal–Lucknow–Anand Vihar Holi Special will operate daily.\n\nTrain No. 04060/04059 Anand Vihar Terminal–Saharsa–Anand Vihar Holi Special will run daily between 25.02.2026 and 07.03.2026.\n\nTrain No. 04010/04009 Delhi–Sitamarhi–Delhi Holi Special will operate between 25.02.2026 and 06.03.2026.\n\nTrain No. 04066/04065 Anand Vihar Terminal–Puri–Anand Vihar Holi Special will run daily.\n\nTrain No. 04614/04613 Amritsar–Katihar–Amritsar Holi Special will operate weekly during early March.\n\nTrain No. 04652/04651 Amritsar–Jay Nagar–Amritsar Holi Special will run bi-weekly.\n\nTrain No. 04616/04615 Firozpur Cantt–Danapur–Firozpur Cantt Holi Special will operate weekly.\n\nTrain No. 04610/04609 Amritsar–Mansi–Amritsar Holi Special will run bi-weekly.\n\nTrain No. 04302/04301 Haridwar–Muzaffarpur–Haridwar Holi Special will operate tri-weekly.\n\nTrain No. 04312/04311 Yog Nagari Rishikesh–Kolkata–Yog Nagari Rishikesh Holi Special will run tri-weekly.\n\nTrain No. 04514/04513 Chandigarh–Gorakhpur–Chandigarh Holi Special will operate weekly.\n\nTrain No. 04002/04001 New Delhi–Dadar Western–New Delhi Holi Special will run bi-weekly.\n\nTrain No. 04226/04225 Varanasi–Lokmanya Tilak Terminus–Varanasi Holi Special will operate bi-weekly.\n\nTrain No. 04212/04211 Sultanpur–Lokmanya Tilak Terminus–Sultanpur Holi Special will run bi-weekly.\n\nTrain No. 04414/04413 Hazrat Nizamuddin–Mathura–Hazrat Nizamuddin Holi Special will operate daily.\n\nTrain No. 04412/04411 Tilak Bridge–Bareilly–Tilak Bridge Holi Special will run daily.\n\nWith the objective of managing the additional passenger rush during the Holi festival, North Central Railway has notified several Holi Special train services connecting Uttar Pradesh with Maharashtra and other key destinations. North Central Railway to run 16  Holi Special Train Services with 46 trips which are as follows:\n\nTrain No. 04212 Sultanpur – Lokmanya Tilak Terminus Holi Special will operate on 26.02.2026 and 02.03.2026.\n\nTrain No. 04211 Lokmanya Tilak Terminus – Sultanpur Holi Special will operate on 27.02.2026 and 03.03.2026.\n\nTrain No. 04226 Varanasi – Lokmanya Tilak Terminus Holi Special will operate on 25.02.2026 and 01.03.2026.\n\nTrain No. 04225 Lokmanya Tilak Terminus – Varanasi Holi Special will operate on 26.02.2026 and 02.03.2026.\n\nTrain No. 04203 Lucknow – New Delhi Holi Special will operate on 23.02.2026 and 02.03.2026.\n\nTrain No. 04204 New Delhi – Lucknow Holi Special will operate on 23.02.2026 and 02.03.2026.\n\nTrain No. 04209 Varanasi – Delhi Holi Special will operate between 22.02.2026 and 06.03.2026.\n\nTrain No. 04210 Delhi – Varanasi Holi Special will operate between 23.02.2026 and 07.03.2026.\n\nTrain No. 04227 Varanasi – Chandigarh Holi Special will operate between 21.02.2026 and 28.02.2026.\n\nTrain No. 04228 Chandigarh – Varanasi Holi Special will operate between 22.02.2026 and 01.03.2026.\n\nNorth Eastern Railway will operate Holi Special trains connecting Lal Kuan, Mau, Rajkot, Amritsar, Gomti Nagar and Valsad. North Eastern Railway to run 12 Holi Special Train Services with 27 trips which are as follows:\n\nTrain No. 05046/05045 Lal Kuan–Rajkot–Lal Kuan Holi Special will operate between 27.02.2026 and 14.03.2026.\n\nTrain No. 05060/05059 Lal Kuan–Kolkata–Lal Kuan Holi Special will run on notified weekly days.\n\nTrain No. 05301/05302 Mau–Ambala Cantt–Mau Holi Special will operate between 05.03.2026 and 13.03.2026.\n\nTrain No. 05005/05006 Barhni–Amritsar–Barhni Holi Special will run between 04.03.2026 and 18.03.2026.\n\nTrain No. 05023/05024 Gomti Nagar–Khatipura–Gomti Nagar Holi Special will operate during early March.\n\nTrain No. 05017/05018 Mau–Valsad–Mau Holi Special will run between 28.02.2026 and 08.03.2026.\n\nNorth Frontier Railway will operate Holi Special trains connecting Northeast India with Bihar and North India. North Frontier Railway to run 10 Holi Special Train Services with 29 Trips which are as follows:\n\nTrain No. 05932/05931 Dibrugarh–Kolkata–Dibrugarh Holi Special will operate between 28.02.2026 and 09.03.2026.\n\nTrain No. 05633/05634 Narangi–Gorakhpur–Narangi Holi Special will run between 26.02.2026 and 12.03.2026.\n\nTrain No. 05736/05735 Katihar–Amritsar–Katihar Holi Special will operate between 25.02.2026 and 18.03.2026.\n\nTrain No. 05974/05973 Dibrugarh–Jay Nagar–Dibrugarh Holi Special will run between 24.02.2026 and 17.03.2026.\n\nTrain No. 05627/05628 Agartala–Guwahati–Agartala Holi Special will operate between 25.02.2026 and 18.03.2026\n\nWith the objective of facilitating smooth travel during the Holi festival, North Western Railway will operate several Holi Special trains from Rajasthan region including Jaipur, Jodhpur, Ajmer, Hisar, Bikaner and Bhagat Ki Kothi towards major destinations across North and West India. North Western Railway to run 14 Holi Special Train Services with 28 trips which are as follows:\n\nTrain No. 09705/09706 Jaipur–Bandra Terminus–Jaipur Holi Special will operate between 01.03.2026 and 16.03.2026 on weekly frequency.\n\nTrain No. 04829/04830 Jodhpur–Gorakhpur–Jodhpur Holi Special will run between 05.03.2026 and 13.03.2026.\n\nTrain No. 04715/04716 Bikaner–Sainagar Shirdi–Bikaner Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nTrain No. 04725/04726 Hisar–Kharki–Hisar Holi Special will run between 01.03.2026 and 16.03.2026.\n\nTrain No. 04727/04728 Hisar–Valsad–Hisar Holi Special will operate during early and mid-March.\n\nTrain No. 04827/04828 Bhagat Ki Kothi–Bandra Terminus–Bhagat Ki Kothi Holi Special will run between 01.03.2026 and 16.03.2026.\n\nTrain No. 09621/09622 Ajmer–Bandra Terminus–Ajmer Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nSouth Central Railway will operate Holi Special trains from Charlapalli, Tirupati, Secunderabad and Chandrapura towards North, East and Northeast India. South Central Railway to run 16 Holi Special Train Services with 40 trips which are as follows:\n\nTrain No. 07092 Charlapalli–Danapur Holi Special will operate between 25.02.2026 and 09.03.2026.\n\nTrain No. 07119/07120 Charlapalli–Madar–Charlapalli Holi Special will run in early March.\n\nTrain No. 07512/07513 Charlapalli–Shalimar–Charlapalli Holi Special will operate between 26.02.2026 and 05.03.2026.\n\nTrain No. 07005/07006 Charlapalli–Raxaul–Charlapalli Holi Special will run between 28.02.2026 and 04.03.2026.\n\nTrain No. 07051/07052 Tirupati–Raxaul–Tirupati Holi Special will operate between 28.02.2026 and 10.03.2026.\n\nTrain No. 07046/07047 Secunderabad–Naharlagun–Secunderabad Holi Special will run between 27.02.2026 and 02.03.2026.\n\nTrain No. 07023/07024 Charlapalli–Hazrat Nizamuddin–Charlapalli Holi Special will operate between 28.02.2026 and 04.03.2026.\n\nTrain No. 07615/07616 Charlapalli–Tiruchchirappalli–Charlapalli Holi Special will run between 03.03.2026 and 17.03.2026.\n\nSouth Eastern Railway will operate Holi Special trains from Santragachi, Shalimar, Ranchi, Tatanagar, Hatia and Bhanjpur towards Eastern, Northern and Southern destinations. South Eastern Railway to run 28 Holi Special Train Services with 107 trips which are as follows:\n\nTrain No. 08185/08186 Hatia–Durg–Hatia Holi Special will operate between 25.02.2026 and 18.03.2026.\n\nTrain No. 08007/08008 Shalimar–Bhanjpur–Shalimar Holi Special will run between 26.02.2026 and 17.03.2026.\n\nTrain No. 08011/08012 Bhanjpur–Puri–Bhanjpur Holi Special will operate between 25.02.2026 and 18.03.2026.\n\nTrain No. 02839/02840 Shalimar–Puri–Shalimar Holi Special will run between 28.02.2026 and 16.03.2026.\n\nTrain No. 02847/02848 and 02897/02898 Santragachi–Digha–Santragachi Holi Specials will operate on weekends between 28.02.2026 and 16.03.2026.\n\nTrain No. 02863/02864 Santragachi–Yelahanka–Santragachi Holi Special will run between 01.03.2026 and 15.03.2026.\n\nTrain No. 02841/02842 Shalimar–MGR Chennai Central–Shalimar Holi Special will operate between 26.02.2026 and 15.03.2026.\n\nTrain No. 08611/08612 Santragachi–Ajmer–Santragachi Holi Special will run between 02.03.2026 and 16.03.2026.\n\nTrain No. 08629/08630 Ranchi–Gorakhpur–Ranchi Holi Special will operate between 25.02.2026 and 18.03.2026.\n\nTrain No. 08181/08182 Tatanagar–Katihar–Tatanagar Holi Special will run between 02.03.2026 and 17.03.2026.\n\nTrain No. 08183/08184 Tatanagar–Buxar–Tatanagar Holi Special will operate between 03.03.2026 and 17.03.2026.\n\nTrain No. 08105/08106 Ranchi–Jhanjharpur–Ranchi Holi Special will run between 02.03.2026 and 16.03.2026.\n\nTrain No. 08109/08110 Santragachi–Darbhanga–Santragachi Holi Special will operate between 03.03.2026 and 17.03.2026.\n\nSouth East Central Railway (SECR)\n\nWith the objective of ensuring smooth and comfortable travel during Holi, South East Central Railway will operate Holi Special trains from Bilaspur, Durg and Gondia towards North and South India. South East Central Railway to run 10 Holi Special Train Services with 14 trips which are as follows:\n\nTrain No. 08263/08264 Bilaspur–Hyderabad–Bilaspur Holi Special will operate between 27.02.2026 and early March on notified days.\n\nTrain No. 08861/08862 Gondia–Patna–Gondia Holi Special will run between 02.03.2026 and 03.03.2026.\n\nTrain No. 08751/08752 Durg–Hazrat Nizamuddin–Durg Holi Special will operate between 01.03.2026 and 03.03.2026.\n\nTrain No. 08863/08864 and 08865/08866 Gondia–Chhapra–Gondia Holi Specials will run between 01.03.2026 and 04.03.2026.\n\nTrain No. 08753/08754 Durg–Madhubani–Durg Holi Special will operate between 01.03.2026 and 02.03.2026.\n\nSouthern Railway will operate Holi Special trains connecting Chennai, Ernakulam, Thiruvananthapuram and Coimbatore with North and East India. Southern Railway to run 12 Holi Special Train Services with 31 trips which are as follows:\n\nTrain No. 06019/06020 MGR Chennai Central–Hazrat Nizamuddin–Chennai Holi Special will operate between 01.03.2026 and 15.03.2026.\n\nTrain No. 06085/06086 Ernakulam–Muzaffarpur–Ernakulam Holi Special will run between 25.02.2026 and 18.03.2026.\n\nTrain No. 06039/06040 MGR Chennai Central–Barauni–Chennai Holi Special will operate between 02.03.2026 and mid-March.\n\nTrain No. 06077/06078 MGR Chennai Central–Santragachi–Chennai Holi Special will run between 01.03.2026 and 15.03.2026.\n\nTrain No. 06081/06082 Thiruvananthapuram North–Santragachi–Thiruvananthapuram North Holi Special will operate between 01.03.2026 and 15.03.2026.\n\nTrain No. 06181/06182 Coimbatore–Jaipur–Coimbatore Holi Special will run between 01.03.2026 and 16.03.2026.\n\nSouth Western Railway will operate Holi Special trains from SMVT Bengaluru, Yesvantpur and Mysuru to East and North India. South Western Railway to run 8 Holi Special Train Services with 21 trips which are as follows:\n\nTrain No. 06565/06566 SMVT Bengaluru–Malda Town–SMVT Bengaluru Holi Special will operate between 28.02.2026 and 16.03.2026.\n\nTrain No. 06563/06564 Yesvantpur–Dhanbad–Yesvantpur Holi Special will run between 01.03.2026 and 15.03.2026.\n\nTrain No. 06597/06598 Yesvantpur–Yog Nagari Rishikesh–Yesvantpur Holi Special will operate between 01.03.2026 and 15.03.2026.\n\nTrain No. 06281/06282 Mysuru–Ajmer–Mysuru Holi Special will run between 01.03.2026 and 16.03.2026.\n\nWest Central Railway will operate Holi Special trains from Jabalpur, Kota, Rewa and Rani Kamlapati towards West, South and Northeast India. West Central Railway to run 18 Holi Special Train Services with 43 trips which are as follows:\n\nTrain No. 01665/01666 Rani Kamlapati–Agartala–Rani Kamlapati Holi Special will operate between 27.02.2026 and 14.03.2026.\n\nTrain No. 02131/02132 Pune–Jabalpur–Pune Holi Special will run between 01.03.2026 and 15.03.2026.\n\nTrain No. 02197/02198 Jabalpur–Coimbatore–Jabalpur Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nTrain No. 02133/02134 Jabalpur–Bandra Terminus–Jabalpur Holi Special will run between 06.03.2026 and 14.03.2026.\n\nTrain No. 02187/02188 Rewa–CSMT–Rewa Holi Special will operate between 26.02.2026 and 13.03.2026.\n\nTrain No. 09801/09802 Kota–Mathura–Kota Holi Special will run between 02.03.2026 and 03.03.2026.\n\nTrain No. 09803/09804 Kota–Radhikapur–Kota Holi Special will operate between 25.02.2026 and 05.03.2026.\n\nTrain No. 09805/09806 Kota–Jabalpur–Kota Holi Special will run between 01.03.2026 and 04.03.2026.\n\nWestern Railway will operate a large number of Holi Special trains from Mumbai Central, Ahmedabad, Vadodara, Valsad, Sabarmati and Udhna towards Bihar, Uttar Pradesh and Madhya Pradesh. Western Railway to run 32 Holi Special Train Services with 120 trips which are as follows:\n\nTrain No. 09185/09186 Mumbai Central–Kanpur Anwarganj–Mumbai Central Holi Special will operate between 01.03.2026 and 15.03.2026.\n\nTrain No. 09189/09190 Mumbai Central–Katihar–Mumbai Central Holi Special will run between 28.02.2026 and 14.03.2026.\n\nTrain No. 09183/09184 Mumbai Central–Banaras–Mumbai Central Holi Special will operate between 03.03.2026 and 17.03.2026.\n\nTrain No. 09025/09026 Valsad–Danapur–Valsad Holi Special will run between 02.03.2026 and 16.03.2026.\n\nTrain No. 09111/09112 Vadodara–Gorakhpur–Vadodara Holi Special will operate between 02.03.2026 and 16.03.2026.\n\nTrain No. 09195/09196 Vadodara–Mau–Vadodara Holi Special will run between 02.03.2026 and 16.03.2026.\n\nTrain No. 09343/09344 Dr Ambedkar Nagar–Patna–Dr Ambedkar Nagar Holi Special will operate between 25.02.2026 and 18.03.2026.\n\nTrain No. 09309/09310 Indore–Hazrat Nizamuddin–Indore Holi Special will run between 27.02.2026 and 16.03.2026.\n\nTrain No. 09425/09426 Sabarmati–Haridwar–Sabarmati Holi Special will operate between 01.03.2026 and 15.03.2026.\n\nTrain No. 09031/09032 Udhna–Hasanpur–Udhna Holi Special will run between 02.03.2026 and 16.03.2026.\n\nTrain No. 09271/09272 Bhavnagar Terminus–Bikaner–Bhavnagar Holi Special will operate between 01.03.2026 and 16.03.2026.\n\nTrain No. 09065/09066 Surat–Chhapra–Surat Holi Special will run between 25.02.2026 and 18.03.2026.\n\nTrain No. 09447/09448 Ahmedabad–Patna–Ahmedabad Holi Special will operate between 27.02.2026 and 13.03.2026.\n\nTrain No. 09465/09466 Ahmedabad–Darbhanga–Ahmedabad Holi Special will run between 01.03.2026 and 15.03.2026.\n\nTrain No. 09451/09452 Gandhidham–Bhagalpur–Gandhidham Holi Special will operate between 01.03.2026 and 08.03.2026.\n\nTrain No. 09085/09086 Mumbai Central–Indore–Mumbai Central Holi Special will run between 01.03.2026 and 08.03.2026.\n\nKonkan Railway will operate Holi Special trains connecting Madgaon, Lokmanya Tilak Terminus, Chiplun and Diva. Konkan Railway to run 4 Holi Special Train Services with 20 trips which are as follows:\n\nTrain No. 01003/01004 Lokmanya Tilak Terminus–Madgaon–Lokmanya Tilak Terminus Holi Special will operate between 01.03.2026 and 08.03.2026.\n\nTrain No. 01159/01160 Diva–Chiplun–Diva Holi Special will run daily between 25.02.2026 and 08.03.2026.\n\nWith these extensive arrangements across zones, Indian Railways is ensuring enhanced connectivity, adequate accommodation and a smooth, safe and comfortable travel experience for passengers during Holi 2026.\n\nThe large-scale operation of special services reflects Indian Railways’ proactive planning to manage festive rush efficiently and minimize inconvenience to regular commuters. By strengthening connectivity between major cities, state capitals and regional centres, these measures are set to ease congestion and facilitate timely travel for lakhs of passengers celebrating the festival across the country.\n\nDharmendra Tewari/ Dr. Nayan Solanki/ Ritu Raj/ Manik Sharma",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232897&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister Condoles the Passing of  Thiru R. Nallakannu",
    "fullText": "The Prime Minister has expressed his condolences over the passing of Thiru R. Nallakannu, highlighting his grassroots connect and his tireless efforts to give a voice to the underprivileged.\n\nThe Prime Minister noted that Thiru R. Nallakannu was widely respected by people from every section of society and his simplicity was noteworthy. The Prime Minister shared that his thoughts are with the family and admirers during this time.\n\nThe Prime Minister shared on X;\n\n\"Thiru R. Nallakannu will be remembered for his grassroots connect and efforts to give voice to the underprivileged, workers and farmers. He was widely respected by people from every section of society. Equally noteworthy was his simplicity. My thoughts are with his family and admirers.\"\n\nThiru R. Nallakannu will be remembered for his grassroots connect and efforts to give voice to the underprivileged, workers and farmers. He was widely respected by people from every section of society. Equally noteworthy was his simplicity. My thoughts are with his family and…\n\nதிரு நல்லகண்ணு அவர்கள் அடித்தட்டு மக்களுடனான தொடர்புக்காகவும், உரிமை மறுக்கப்பட்டோர், தொழிலாளர்கள் மற்றும் விவசாயிகளுக்காகக் குரல் கொடுக்கும் முயற்சிகளுக்காகவும் நினைவுகூரப்படுவார். சமூகத்தின் அனைத்துப் பிரிவு மக்களாலும் அவர் பெரிதும் மதிக்கப்பட்டார். அவரது எளிமையும் அதே…",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232868&reg=3&lang=1"
  },
  {
    "headline": "NBEMS Achieves Historic Milestone with Official GUINNESS WORLD RECORDS™ Recognition for “Most viewers of an Artificial Intelligence in Healthcare lesson live stream on YouTube”",
    "fullText": "The National Board of Examinations in Medical Sciences (NBEMS), an autonomous body under the Union Health Ministry on Wednesday achieved a historic milestone by being officially recognized by Guinness World Records for \"Most viewers of an Artificial Intelligence in Healthcare lesson live stream on YouTube\".\n\nThe record was achieved through the successful implementation of a nationwide online training programme on Artificial Intelligence in Healthcare, designed specifically for registered medical practitioners across the country.\n\nThe peak concurrent viewership for the programme was 17,999.\n\nThe AI training initiative was conceptualized by NBEMS under the leadership of Dr Abhijat Sheth, President of NBEMS and Chairman of NMC to empower doctors with foundational and applied knowledge of artificial intelligence.\n\nThere are 20 modules in the programme being delivered across six months by reputed national and international faculty from Harvard USA, IIM Lucknow, IISc Bengaluru, etc. The NBEMS is not charging any fee from the participants.\n\nThe mega digital academic e-learning programme of AI for medical professionals across the country was planned and executed by Dr Rakesh Sharma, Governing Body Member of NBEMS, and Dr AVS Suresh from Hyderabad, along with the NBEMS team in collaboration with various AI experts nationally and internationally.\n\nThe record attempt was officially adjudicated by a team led by Swapnil Dangarikar, appointed judge from Guinness World Records, who conducted a thorough evaluation and verification process before confirming the achievement.\n\n\"This achievement draws inspiration from the visionary leadership of Prime Minister of India, Shri Narendra Modi, who has always emphasised on digital India, technological innovation, and the responsible adoption of artificial intelligence in governance and public service,\" Dr Sheth said. \"I also express my heartfelt gratitude to the Union Health Minister Shri J P Nadda, MOHFW officers, faculty members, academic partners, and participating doctors whose collective effort made this achievement possible,\" he said.\n\nThis recognition from Guinness World Records is not merely a record but a testimony to India’s leadership in adopting digital innovation in medical education, he said.\n\nThe NBEMS remains committed towards advancing competency-based learning and will continue to introduce initiatives aimed at enhancing the quality of healthcare delivery across the nation, he underlined.\n\n\"At NBEMS, we believe medical education must grow with global advancements. Our goal is not only to train specialists, but to prepare future-ready healthcare leaders who can use new technologies responsibly. This record is not just about numbers. It proves that NBEMS is ready to lead and move forward with the changing world,\" he said.\n\nThe programme witnessed unprecedented participation of doctors from government and private institutions on pan India basis, reflecting the growing enthusiasm among healthcare professionals towards AI.\n\nHFW/NBEMS Guinness Record/25th February 2026/1",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001RO4H.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002SMFM.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003FANZ.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004SLB2.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005ZSTH.jpg"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232864&reg=3&lang=1"
  },
  {
    "headline": "Government of India and National Film Development Corporation Celebrate Global Recognition for Indian Cinema",
    "fullText": "Lakshmipriya Devi’s Boong Wins Best Children’s and Family Film at the BAFTA Film Awards 2026. The Ministry of Information and Broadcasting, Government of India, along with the National Film Development Corporation, congratulates filmmaker Lakshmipriya Devi and the entire team of Boong on winning the Best Children’s and Family Film award at the BAFTA Film Awards 2026. This landmark achievement marks a proud moment for Indian cinema and highlights the growing global appreciation for India’s diverse and meaningful storytelling traditions.\n\nThe film’s journey has been supported by India’s film development and festival ecosystem. Boong was curated at Film Bazaar under the Work in Progress Lab and Film Bazaar Recommends in 2023, initiatives designed to nurture promising filmmakers and enable global industry engagement. The film was subsequently screened at the 55th International Film Festival of India in 2024, where it was selected under the Best Debut Director category, further affirming its critical acclaim.\n\nThe Government of India and the National Film Development Corporation reaffirm their commitment to strengthening platforms such as Film Bazaar and the International Film Festival of India that empower filmmakers, foster creative excellence, and create pathways for Indian cinema to reach international audiences.",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001LQPU.jpg"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232861&reg=3&lang=1"
  },
  {
    "headline": "PRESIDENT OF INDIA GRACES THE STATE-LEVEL LAUNCH OF ‘GOLDEN ERA OF MAHARASHTRA THROUGH UNITY AND TRUST’",
    "fullText": "The President of India Smt Droupadi Murmu graced the state-level launch of ‘Golden Era of Maharashtra through Unity and Trust’, organised by Brahma Kumaris at Vishwa Shanti Sarovar, Nagpur, Maharashtra today (February 25, 2026).\n\nSpeaking on the occasion, the President said that Maharashtra has consistently set examples of social, economic, cultural, and spiritual development in the country. This sacred land has been the birthplace of great ideologies and ideals of nation-building that instilled a new consciousness in the people of India. The thoughts, struggles and contributions of great icons like Chhatrapati Shivaji Maharaj, Mahatma Jyotiba Phule, Vasudev Balwant Phadke, Maharishi Dhondo Karve, Rajarshi Shahu Maharaj, Lokmanya Bal Gangadhar Tilak, Gopal Krishna Gokhale, Vinayak Damodar Savarkar and Dr. Bhimrao Ambedkar have empowered our nation.\n\nThe President said that Maharashtra is consistently strengthening the developmental journey of India on the basis of its industry, agriculture, entrepreneurship, innovation, higher education and invaluable cultural traditions. Our goal is to move towards holistic development that benefits every citizen. We must work with determination to build a stronger and more prosperous Maharashtra and India by drawing inspiration from history and harnessing the power of modern technology, skill development and innovation. She expressed confidence that the initiative ‘Golden Era of Maharashtra through Unity and Trust’ of the Brahma Kumaris will inspire the people of Maharashtra to develop inner strength, and leadership spirit, and work for value-based development.\n\nThe President said that spirituality makes people aware of human values and duties. Harmony, ethical behaviour, positive thinking and social responsibility—all these together strengthen society. When such values become part of life, trust is naturally established in society. Mutual trust promotes positivity in society.\n\nThe President said that unity and trust are the foundations on which a strong nation stands. When mutual trust grows in society, people rise above personal gains and work together to achieve a common goal. Every citizen can effectively contribute to nation-building by promoting equality, eradicating discrimination and participating in community service.\n\nThe President said that India will be truly developed only when everyone has equal opportunities to grow, technology becomes a vehicle for development and the benefits of progress reach everyone. She appreciated Brahma Kumaris for this initiative and expressed confidence that their efforts strengthen unity and trust in society.\n\nPlease click here to see the President's speech-",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/PResidentpic125022026R08E.JPG",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/PResidentpic225022026L5J5.JPG",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/PResidentpic325022026MCKR.JPG"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232856&reg=3&lang=1"
  },
  {
    "headline": "MILAN 2026 CONCLUDES SUCCESSFULLY; CLOSING CEREMONY ONBOARD INS VIKRANT MARKS MARITIME MILESTONE",
    "fullText": "Exercise MILAN 2026, the Indian Navy’s premier multilateral maritime exercise, culminated on 25 Feb 2026 with a closing ceremony conducted onboard India’s indigenous aircraft carrier, INS Vikrant, off the coast of Visakhapatnam.\n\nThe ceremony was presided over by Rear Admiral Alok Ananda, Flag Officer Commanding Eastern Fleet (FOCEF). Commanding Officers and officers from all participating units attended the ceremony, marking the successful completion of the exercise and celebrating the enduring bonds forged across the vast expanse of the Bay of Bengal.\n\nHeld under the theme ‘Camaraderie, Cooperation, Collaboration’, MILAN 2026 witnessed participation on an unprecedented scale, comprising 42 ships and submarines and, 29 aircraft. These also included 18 ships from the participating Friendly Foreign Countries.\n\nFurther, apart from integral helicopters onboard the Friendly Foreign Country ships, maritime patrol aircraft from France, Germany and USA also participated.\n\nMILAN 2026 commenced with a Harbour Phase that featured bilateral engagements, Subject Matter Expert Exchange (SMEE) programme and the International Maritime Seminar (IMS). Professional interactions were complemented by cultural exchanges, cross-deck and outstation visits.\n\nTechnological demonstrations and the MILAN of Young Officers (MOYO) interaction facilitated the exchange of best practices, while friendly sports fixtures enabled informal interaction.\n\nThis was followed by the Sea Phase, which comprised high-intensity operational drills focused on advanced warfare disciplines including integrated air defence and antisubmarine warfare exercises, maritime interdiction operations, surface strike coordination, communication exercises, and cross-deck flying operations, enhancing interoperability and collective readiness.\n\nLive firings as part of surface gun shoots and FPM drills as well as anti-air firings were also undertaken. Emphasis was placed on real-time coordination, joint mission planning and logistical support at sea.\n\nFriendly Foreign navies participated in high-tempo tactical manoeuvres alongside Indian Naval Ships, reflecting growing convergence of maritime interests towards ensuring safe and secure seas. The exercise validated seamless coordination, rapid response capabilities and best practices, aligned with the vision of MAHASAGAR - Mutual and Holistic Advancement for Security and Growth Across Regions.\n\nDuring the closing ceremony onboard the indigenous aircraft carrier INS Vikrant, Commanding Officers of all participating ships expressed their deep appreciation for the professional conduct and meticulous planning that characterised MILAN 2026. They unanimously affirmed that the exercise had comprehensively achieved its training objectives and operational aims, significantly enhancing interoperability, mutual understanding and collective maritime readiness.\n\nThe successful culmination of MILAN 2026 stands as a testament to the shared commitment of participating navies towards strengthening cooperative mechanisms, fostering enduring partnerships for safe and secure seas.",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Pic(1)(6)UI6G.jpeg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Pic(5)(2)S1SJ.jpeg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Pic(6)OPGL.jpeg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Pic(8)(2)THMZ.jpeg"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232853&reg=3&lang=1"
  },
  {
    "headline": "Central Board of Indirect Taxes and Customs (CBIC) to host National Symposium on Customs Reforms and International Customs Day 2026 with the theme of ‘Customs protecting society through vigilance and commitment’",
    "fullText": "The Central Board of Indirect Taxes and Customs (CBIC) is hosting the National Symposium on Customs Reforms, 2026, and International Customs Day, 2026, in New Delhi, tomorrow.\n\nUnion Minister of State for Finance Shri Pankaj Chaudhary will preside over the International Customs Day 2026 along with Shri Arvind Shrivastava, Secretary, Department of Revenue; Shri Vivek Chaturvedi, Chairman, CBIC; and officials of Department of Revenue, Ministry of Finance, and CBIC, will also remain present.\n\nThe International Customs Day 2026 will witness screening of a short film on Customs Reforms; an audio-visual presentation and launch of Single Window SWIFT 2.0; release of the SWIFT 2.0 Booklet and the Digital Travellers Guide; and release of the revamped Atithi App.\n\nThe celebrations will also witness the stakeholder feedback from representatives of trade and industry. The event will also include the distribution of the WCO Certificate of Merit to distinguished officers (List in Annexure-I).\n\nPrior to the International Customs Day 2026 celebrations, CBIC is also organising the National Symposium on Customs Reforms 2026.\n\nShri Arvind Shrivastava, Secretary, Department of Revenue, will preside over the National Symposium on Customs Reforms 2026 along with Shri Vivek Chaturvedi, Chairman, CBIC, for the session. The session will commence with remarks by the Member (Customs), CBIC, setting the context for the deliberations.\n\nThis will be followed by an overview presentation on Customs Reforms by the Joint Secretary (Customs), CBIC, outlining key policy and procedural advancements. The session will comprehensively cover trust-based customs processes and digital governance, including recent legal changes and import procedural reforms. It will also highlight the evolution of the digital ecosystem through initiatives such as SWIFT 2.0 and the Customs Integrated System (CIS). In addition, the discussions will focus on emerging export opportunities, including courier reforms, fisheries enablement and export procedure reforms. Special emphasis will also be placed on ease of living measures, particularly reforms relating to baggage rules and personal imports.\n\nThe Symposium will highlight India’s ongoing transformation in Customs administration, focusing on trust-based processes, digital governance, trade facilitation and ease of living for citizens.\n\nThe event will bring together senior government officials, policymakers, trade representatives, industry stakeholders and officers from across the country to deliberate on key reforms shaping the future of Indian Customs.\n\nThe Symposium underscores CBIC’s continued commitment to simplifying procedures, enhancing transparency, strengthening digital infrastructure and fostering a partnership-driven approach with trade and citizens.\n\nList of Distinguished Officials awarded WCO Certificate of Merit\n\nDirector,  TRU-I, CBIC, New Delhi\n\nAdditional Commissioner, CCO, Mumbai Customs Zone-I\n\nAdditional Director, DRI, Indore Zonal Unit\n\nAdditional Director, NCTC (Cargo), Mumbai\n\nJoint Commissioner, Member (lT, TPS & Tech), CBIC,\n\nJoint Commissioner, Chennai Airport Customs, Commissionerate\n\nJoint Commissioner, Directorate of International Customs\n\nJoint Commissioner, Commissioner of Customs, Airport and ACC, Bangaluru\n\nDeputy Commissioner, Custom House, Cochin\n\nOSD, Customs & EB, CBIC, New Delhi\n\nDeputy Director, DRI, Mumbai Zonal Unit\n\nUnder Secretary, GST Policy Wing, CBIC, New Delhi\n\nAssistant Commissioner, O/O the Chief Commr., Customs Delhi Zone, New Delhi\n\nTechnical Officer, TRU-I, CBIC, New Delhi\n\nSuperintendent, Customs IV Section, Customs  Policy Wing\n\nSuperintendent, Custom, Canine Centre, Attari\n\nSuperintendent, Custom, Prev. Jaipur\n\nSuperintendent, DRI Regional Unit Mangaluru\n\nIntelligence Officer, DRI, Aizawl Regional Unit\n\nTax Assistant, DRI, Head Quarter, New Delhi",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232839&reg=3&lang=1"
  },
  {
    "headline": "Union Minister of Road Transport and Highways, Shri Nitin Gadkari Launches Revamped RAJMARG PRAVESH Portal for Transparent and Faster NOC Approvals",
    "fullText": "Union Minister of Road Transport and Highways, Shri Nitin Gadkari, today launched the upgraded RAJMARG PRAVESH web portal for hassle free obtaining No Objection Certificates (NOCs) for fuel stations, wayside amenities, private properties, rest area complexes, connecting roads, and other such facilities along National Highways.\n\nThe Ministry has developed this improved portal to make the process of getting permissions simpler, faster, and more transparent, in line with the Government’s commitment to improving ease of doing business. The portal can be accessed at http://rajmargpravesh.morth.gov.in\n\nThrough the new RAJMARG PRAVESH portal, citizens, businesses, and organizations can apply online in a simple way for permissions related to access from National Highways for private properties, industries, and wayside facilities. The portal can also be used by Government and private organizations to obtain permissions for laying utilities such as water pipelines, gas pipelines, optical fibre cables, electrical lines, and other services along or across National Highways.\n\nThe new portal will make the approval process more convenient, transparent, and time-bound, helping citizens and businesses save time and effort.\n\nSenior officials present on the occasion included Secretary (RTH) V Umashankar, DG(RD) & Spl. Secy. Vinay Kumar Rajawat, Chairman National Highways Authority of India Santosh Kumar Yadav, Managing Director National Highways and Infrastructure Development Corporation Limited Krishan Kumar, Member (Admin) National Highways Authority of India Vishal Chauhan and other senior officials of the Ministry.",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001ZFCA.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002ZCUN.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0035Z8H.jpg"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232836&reg=3&lang=1"
  },
  {
    "headline": "India and Nepal sign MoU to strengthen cooperation in Forests, Wildlife, Environment, Biodiversity Conservation and Climate Change",
    "fullText": "Union Ministry of Environment, Forest and Climate Change, Government of India, today signed a Memorandum of Understanding (MoU) with the Ministry of Forests and Environment, Government of Nepal, to promote bilateral cooperation in the areas of forests, wildlife, environment, biodiversity conservation and climate change, including restoration of wildlife corridors and interlinking areas, and exchange of knowledge, technical expertise and best practices.\n\nThe signing ceremony took place in New Delhi, in the presence of Shri Bhupender Yadav, Union Minister of Environment, Forest and Climate Change, Government of India, and Shri Madhav Prasad Chaulagain, Cabinet Minister for Forests and Environment, Government of Nepal.\n\nIndia and Nepal are endowed with rich biodiversity and natural heritage and have established extensive networks of Protected Areas in their respective territories. Both countries are also Parties to several multilateral environmental agreements and conventions. In view of the shared ecosystems and transboundary wildlife habitats, a need was felt to further strengthen coordination and cooperation between the two Governments in the fields of forests, wildlife, environment, biodiversity conservation and climate change.\n\nThe MoU envisages cooperation in formulation of biodiversity conservation strategies at the landscape level with emphasis on key species such as elephant, Gangetic dolphin, rhinoceros, snow leopard, tiger and vultures. It also provides for strengthened forest and protected area management; restoration of corridors and other interlinking areas towards creation of transboundary conservation landscapes; addressing biodiversity conservation threats; combating forest and wildlife crime; strengthening the capacity of frontline staff of enforcement agencies; and promoting smart green infrastructure in biodiversity hotspots.\n\nThe signing of this MoU is expected to further deepen India–Nepal cooperation in conservation of wildlife and biodiversity, and contribute to protection of shared ecosystems and sustainable management of natural resources in the region.",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/WhatsAppImage2026-02-25at8.04.17PM4IU7.jpeg"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232834&reg=3&lang=1"
  },
  {
    "headline": "Three-day National Pusa Krishi Vigyan Mela inaugurated by Union Agriculture Minister Shri Shivraj Singh Chouhan",
    "fullText": "Union Minister for Agriculture and Farmers’ Welfare, and Rural Development, Shri Shivraj Singh Chouhan on Wednesday inaugurated the three-day Pusa Krishi Vigyan Mela organised at the Indian Council of Agricultural Research campus in Pusa, Delhi, and presented a comprehensive roadmap of major agricultural reforms aimed at steering Indian farming towards the vision of ‘Developed Agriculture (Viksit Krishi) – Self-Reliant India (Atmanirbhar Bharat)’. He sent a clear message that the old practice of withholding farmers’ money would no longer be tolerated. From MSP procurement to Kisan Credit Card loans, pesticide licensing and the role of Krishi Vigyan Kendras (KVKs), transparency, time-bound delivery and accountability would be ensured at every level.\n\nThe prestigious annual Pusa Krishi Vigyan Mela, held at the Indian Agricultural Research Institute (ICAR-IARI) campus in Pusa, was inaugurated by Union Minister Shri Shivraj Singh Chouhan with a ceremonial plantation. On the occasion, Union Agriculture Secretary Shri Devesh Chaturvedi, Director General of ICAR and Secretary of the Department of Agricultural Research and Education Dr. M. L. Jat, and Director of IARI Dr. C. H. Srinivas Rao were also present, along with a large number of scientists, progressive farmers and representatives of various institutions.\n\nBy seating farmers in the front row on the dais and personally wheeling a differently-abled farmer forward in his wheelchair to interact with him, Union Agriculture Minister Shri Shivraj Singh Chouhan conveyed the message that farmers remain the core of policy-making. During the programme, seven farmers were honoured with the IARI Krishi Adhyeta Award, further reinforcing the spirit of ‘Farmers First’.\n\nSpeaking on agricultural reforms, Shri Chouhan first addressed the issue of delays in payment of farmers’ dues. In a stern warning, he said that any agency or state government that holds back farmers’ money will have to pay 12 per cent interest on the withheld amount. He asserted that delayed payments and the practice of “parking” funds in government accounts to earn interest would no longer be tolerated. The Union Agriculture Minister made it clear that the Central Government would not cause any delay from its side, and even in cases where states delay payments under schemes, the option of transferring the Centre’s share directly into farmers’ accounts is being actively explored. His message was unequivocal: the benefits meant for farmers from the Centre must reach them on time and without obstacles.\n\nReferring to assistance being provided for agricultural mechanisation, drip and sprinkler irrigation, polyhouses and greenhouses, Shri Shivraj Chouhan said that the Central Government is providing resources to states under more than 18 schemes. However, merely releasing funds is not enough. Citing an example, he said that in one district, although 700 farmers’ names were on the list, only 158 farmers actually received machines. He emphasised that when the Centre releases money, it also has the responsibility to ensure that the benefits actually reach real farmers. For this, a strong monitoring system is an essential reform.\n\nHighlighting the role of Krishi Vigyan Kendras (KVKs), the Union Minister said that KVKs would be developed as strong district-level units acting as a bridge between research and extension. He entrusted them with the responsibility of taking new varieties, innovative farming practices and successful models to villages through better coordination with states. Strengthening the institutional structure of KVKs was described as a key reform to ensure that scientific advances translate into tangible benefits for farmers.\n\nShri Shivraj Singh Chouhan said that around 75 per cent of small farmers currently benefit from Kisan Credit Card loans, with an effective interest rate of 4 per cent, ensuring access to affordable credit. However, delays in disbursal are unacceptable. He urged banks and financial institutions to ensure that KCC-linked loans are released on time and without unnecessary paperwork, so that farmers do not have to depend on moneylenders.\n\nAddressing the issue of pesticide quality and licensing, Shri Shivraj Singh Chouhan acknowledged that the current licensing system is lengthy and complex, forcing even honest companies to make repeated rounds of offices and delaying the availability of quality products to farmers. He indicated that efforts would be made to simplify the pesticide licensing process by reducing layers, setting clear timelines and ensuring complete transparency. This, the Union Minister said, would help quality products reach the market faster and enable strict action against substandard and counterfeit products.\n\nOn procurement at Minimum Support Price (MSP), the Union Agriculture Minister said that the existing three-month procurement window is impractical, as farmers cannot hold on to their produce for such a long period. He suggested that, in coordination with states, systems should be put in place to complete MSP procurement within a maximum of one month. This would ensure that farmers receive immediate and fair prices, and prevent others from cornering undue profits later in the name of MSP.\n\nThe Union Minister noted that the central government spends over ₹2 lakh crore annually on fertiliser subsidies, enabling farmers to purchase urea bags costing around ₹2,400 at prices of roughly ₹265–270. He said it should be considered whether such a large subsidy could be transferred directly to farmers’ accounts through Direct Benefit Transfer (DBT). This would allow farmers to decide which fertilisers to buy and in what quantity, ensuring that the real beneficiary of the subsidy is the farmer actually applying fertiliser in the field.\n\nOutlining future strategy, Shri Shivraj Singh Chouhan spoke in detail about the ‘Viksit Krishi Sankalp Abhiyan’ (Developed Agriculture Resolution Campaign). Under this initiative, teams of scientists will visit villages and directly interact with farmers, sharing the latest research, pest and disease management practices, integrated farming models and export-quality varieties. He said the campaign would be conducted in a time-bound manner starting in April, ahead of the kharif season, so that farmers receive scientific advice, better seeds and improved technologies well in advance.\n\nDescribing the Pusa Krishi Vigyan Mela as a national ‘Kumbh’ of farmers, Union Minister Shri Shivraj Singh Chouhan said that the event is not merely an exhibition but a major confluence of farmers, scientists, entrepreneurs and policymakers from across the country. It is a platform where laboratory research directly reaches the fields and where a roadmap is prepared for a developed, modern and self-reliant agricultural sector for the entire nation. He directed IARI to organise the fair on an even larger scale from next year, further strengthening its role as a bridge between science and farming practice.",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/1000154970WSJA.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/1000154972UOS7.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/10001549714ZQW.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/1000154973FXXE.jpg"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232831&reg=3&lang=1"
  },
  {
    "headline": "Union Environment Minister inaugurates TERI's World Sustainable Development Summit 2026 and MoEFCC’s Him-CONNECT platform",
    "fullText": "Union Minister for Environment, Forest and Climate Change Shri Bhupender Yadav today inaugurated the Silver Jubilee edition of TERI’s World Sustainable Development Summit (WSDS) and Him-CONNECT, a dedicated platform organised by the Ministry of Environment, Forest and Climate Change (MoEFCC) to connect researchers working in the Himalayan region with start-ups, industry leaders, investors and policymakers.\n\nThe dignitaries on dais during the Inaugural Session featured Dr. Bharrat Jagdeo, Vice President, The Cooperative Republic of Guyana; Shri Nitin Desai, Chairman, TERI; Dr. Vibha Dhawan, Director-General, TERI; and Shri Siddhartha Sharma, CEO, Tata Trust, among others.\n\nIn his inaugural address, the Minister noted his long association with The Energy and Resources Institute (TERI) and said WSDS has, over the last 25 years, grown into a unique forum from the Global South that brings together governments, industry, academia, civil society and communities to translate the science of sustainability into policy, partnerships and practical action.\n\nHighlighting the Ministry’s initiative as part of WSDS 2026, Shri Yadav said 'Him-CONNECT' has been conceived as a structured platform to translate research supported under the Ministry's National Mission on Himalayan Studies (NMHS) into solutions that can be implemented at scale. He thanked the exhibitors from the Himalayan States and Union Territories participating in Him-CONNECT and said their presence demonstrates the strength of innovation emerging from mountain ecosystems.\n\nHim-CONNECT creates a bridge between science and society by bringing together researchers, start-ups, entrepreneurs, investors, development agencies and policymakers. The initiative strengthens the link between research and real-world impact, and aligns with India’s approach of placing communities at the centre of environmental action, he said.\n\nTaking note of the Global Climate Challenge, Shri Yadav said that the first Global Stocktake under the Paris Agreement has made it clear that globally, we are not on the trajectory required to limit global warming to 1.5 degrees Celsius. Emission reductions remain insufficient. Adaptation finance remains inadequate. SDG implementation is uneven.\n\nThe Minister said transformation must go beyond small policy changes and bring structural change in energy systems, economic models, consumption patterns and global governance frameworks. Referring to the Summit theme - Transformations: Vision, Voices and Values for Sustainable Development - he said it reflects a strategic necessity at this defining moment for humanity and the planet.\n\nExplaining the meaning of transformation, Shri Yadav said that while it implies structural change in English, in Indian thought “parivartan” signifies a deeper evolution of consciousness. For India, sustainability is a civilisational ethic. Transformation does not mean abandoning development, but redefining it within ecological limits, with social justice and inter-generational equity, he added.\n\nThe Minister outlined India’s Vision: achieving 500 GW of non-fossil fuel energy capacity by 2030, reducing emissions intensity of GDP by 45 per cent from 2005 levels by 2030, achieving net-zero by 2070, advancing the National Green Hydrogen Mission and building climate-resilient infrastructure. Globally, he said, transformation requires tripling renewable energy, doubling energy efficiency, scaling up adaptation finance and reforming multilateral development banks to unlock climate finance. Climate ambition and climate finance must move together, he stressed.\n\nOn the theme’s second pillar, ‘Voices’, the Minister said the Global South stands at the frontline of climate impacts while continuing its development journey. India has consistently upheld the principles of Common but Differentiated Responsibilities, climate justice, equitable carbon space and inclusive carbon markets. The voices of small island states, least developed countries, indigenous communities and youth must shape global frameworks, he said.\n\nOn ‘Values’, Shri Yadav said technology can accelerate transformation and finance can enable it, but values define its fairness. Referring to India’s G20 Presidency theme, ‘Vasudhaiva Kutumbakam - One Earth, One Family, One Future’, he said sustainability frameworks must be fair, transparent and reflect different development realities.\n\nShri Yadav said that as a nation committed to building a ‘Viksit Bharat’, India is advancing reforms across four pillars - Energy Transformation, Circular Economy Transition, Nature-Based Solutions and Digital Environmental Governance. He said that the next 25 years must be about moving from pledges to performance, from targets to trajectories and from ambition to accountability. He said that the Silver Jubilee of WSDS should mark acceleration and reaffirmed that India stands ready to partner with all nations for a sustainable and resilient future.\n\nOn the occasion, the Minister inaugurated the ‘Him-CONNECT’ exhibition and reviewed different exhibits from scientists and researchers from Himalayan states and Union territories.",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Screenshot2026-02-25200342TE9I.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Screenshot2026-02-25200355I23Q.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Screenshot2026-02-25200406G25T.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Screenshot2026-02-252004157BOJ.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Screenshot2026-02-25200423LKEU.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Screenshot2026-02-25200433JX0W.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Screenshot2026-02-2520044556TW.png"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232832&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister received by Prime Minister of Israel on arrival in Tel Aviv",
    "fullText": "​Prime Minister Shri Narendra Modi arrived in Israel today on a State Visit. In a special gesture, on arrival at the airport in Tel Aviv, he was received by the Prime Minister of Israel H.E. Benjamin Netanyahu and his spouse Mrs. Sara Netanyahu and accorded a ceremonial welcome.\n\nFollowing the arrival ceremony, the two Prime Ministers held a brief one-on-one meeting. At the hotel, Prime Minister was accorded a warm and enthusiastic welcome by the members of the Indian community and the representatives of the Jewish Indian diaspora. The reception was marked by vibrant cultural performances by Indian and Israeli artistes, symbolizing the enduring friendship between the two nations.",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232824&reg=3&lang=1"
  },
  {
    "headline": "Advancing the Prime Minister’s Vision of ‘Ashtalakshmi’ and National Integration",
    "fullText": "The Union Minister of Communications and Development of North Eastern Region (DoNER), Shri Jyotiraditya M. Scindia, on Wednesday, virtually interacted with the 12th batch of students participating in the Ashtalakshmi Darshan Youth Exchange Programme, being held at Rajiv Gandhi University, Arunachal Padesh, from 18th February to 3rd March, 2026.\n\nThe session was attended by the Secretary, MDoNER, Joint Secretary, MDoNER, and other senior officials of the Ministry of Development of North Eastern Region (MDoNER) and the North Eastern Council (NEC).\n\nThe Ashtalakshmi Darshan is a flagship Youth Exchange Programme organized and funded by MDoNER to deepen national integration and strengthen bonds among young people from diverse regions of the country. Designed as a 14-day immersive experience, the programme includes academic sessions, heritage visits, cultural exchanges, and community interactions.\n\nThe initiative envisages the participation of 1,280 students in 32 batches from 28 States and Union Territories, providing them exposure to all eight Northeastern states. The programme ensures equal participation of boys and girls, reflecting the Government’s commitment to inclusivity and youth empowerment. The 12th batch comprises 20 students each from Jharkhand and Puducherry. So far, 471 students from different states have participated so far.\n\nAddressing the participating students, Shri Scindia emphasised that the programme embodies the spirit of Ek Bharat Shreshtha Bharat by creating a meaningful confluence of ideas, cultures, and aspirations between the Northeast and the rest of India.\n\nDescribing the eight Northeastern states — Arunachal Pradesh, Assam, Manipur, Meghalaya, Mizoram, Nagaland, Tripura, and Sikkim — as the “Ashtalakshmi,” he encouraged students to expand their understanding of the region’s languages, traditions, and developmental potential.\n\n“You are part of weaving this fabric of confluence,” the Minister said, noting that such exchanges foster unity in diversity and contribute to the vision of Viksit Bharat 2047.\n\nShri Scindia observed that the students were midway through their immersive journey and had also participated in Statehood Day celebrations, visited Ita Fort and Ganga Lake, and interacted at Raj Bhavan. He highlighted that such exposure provides first-hand insights into governance structures, constitutional institutions, and the rich cultural tribal heritage of Arunachal Pradesh.\n\nSpeaking about tourism in Northeast India, the Minister underscored its immense potential for economic growth and employment generation, particularly in Arunachal Pradesh, which he described as possessing vast and untapped tourism prospects.\n\nDuring the interaction, students also shared their learnings and impressions.\n\nMalay Shrivastava, a third-year B.Tech student from Jharkhand, described the programme as a wonderful opportunity and appreciated Arunachal Pradesh’s environmental consciousness and strong community culture.\n\nShradhanjali Mohapatra from Pondicherry University highlighted the sense of peace in the region and the valuable opportunity to engage closely with local communities, while Anima Kumari from Jharkhand spoke about the strong scope for cultural integration through the exchange programme and expressed her desire to revisit Arunachal Pradesh with her family. Mumtazan Thahmeena from Puducherry shared her admiration for the breathtaking sunrise views from the “land of the rising sun,” and Ruchika Kumari appreciated the lush greenery and discipline observed among the people of the state.\n\nIn his concluding remarks, Shri Scindia praised the students’ enthusiasm and urged them to share their experiences widely with family and friends, particularly about the people, traditions, and natural beauty of the Northeastern region.\n\nHe reiterated that the vision of Prime Minister Shri Narendra Modi through the Ashtalakshmi Darshan Youth Exchange Programme is to enable students to experience the authentic culture, people, and traditions of Northeast India and return as ambassadors of unity and integration.\n\nThe Ashtalakshmi Darshan Youth Exchange Programme stands as a testament to the Government’s commitment to cultural integration, youth engagement, and national unity, reflecting the shared vision of a co-prosperous and inclusive Viksit Bharat 2047.\n\nSpoke to yet another enthused batch of young changemakers under the Ashtalakshmi Darshan Youth Exchange Programme, this one with students hailing from Jharkhand and Puducherry, exploring the rich heritage of Arunachal Pradesh.Their experiences reflect the true spirit of… pic.twitter.com/6FMZivMtQS",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001BI0Z.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002ZL8Z.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003VM0K.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004M29F.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005HO2G.jpg"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232823&reg=3&lang=1"
  },
  {
    "headline": "IAF AND EAC CUP RACES HELD AT ROYAL CALCUTTA TURF CLUB",
    "fullText": "The prestigious Indian Air Force (IAF) Cup and Eastern Air Command (EAC) Cup races were conducted with grandeur at the historic Royal Calcutta Turf Club (RCTC) on 25 February 2026. These annual fixtures, instituted in 1996, commemorate the strong association between the Indian Air Force and the RCTC.\n\nThe RCTC, founded in 1847 and bestowed the title 'Royal' in 1912, remains one of the most prestigious horse racing organizations in the country. Since then it continues to host the IAF and EAC Cup races as a tribute to the rich heritage and contributions of the Indian Air Force.\n\nAir Chief Marshal AP Singh, Chief of the Air Staff, graced the occasion as the Chief Guest and distributed the prizes along with Air Marshal IS Walia, Air Officer Commanding-in-Chief, Eastern Air Command. This year the winner of the IAF cup was Antony Raj S. On his horse Abhicandra owned by Mr Vikram Bachhawat. While the EAC cup was lifted by MS Deora on his charger Laguna Seca owned by  M/s Caimhill stud farms Pvt td & M/s Sarainaga Racing Pvt Ltd.\n\nChief of the Air Staff lauded the event as a significant milestone in fostering camaraderie and strengthening the bond between the defence forces and the community as a whole The event saw enthusiastic participation and was attended by senior officers from the Army, Navy, IAF as well as Coast Guard, underscoring the unity among India's defence forces. An enthralling performance by the Indian Air Force Band, added to the splendour of the day captivating the audience with its harmonious renditions, embodying the spirit and pride of the Air Force.",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Photo2(1)B7JX.jpeg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Photo3(1)P504.jpeg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/Photo4(1)2MLW.jpeg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/PhotoVY3J.jpeg"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232820&reg=3&lang=1"
  },
  {
    "headline": "India and Sweden Deepen AI Partnership Through SITAC Framework",
    "fullText": "On the sidelines of the India AI Impact Summit 2026, the IndiaAI Mission and the Business Sweden signed a Statement of Intent (SoI) to strengthen bilateral cooperation in the field of Artificial Intelligence (AI) and digital technologies and to promote trade and investment engagement between India and Sweden.\n\nThe Statement of Intent provides a structured framework for collaboration on the development, application and deployment of artificial intelligence solutions, with emphasis on real-world industrial and societal outcomes. The cooperation builds upon the long-standing partnership between India and Sweden and reflects the shared national priorities of both countries in leveraging AI for innovation, economic growth and sustainable development, while addressing associated risks.\n\nTalking about the partnership Ms. Kavita Bhatia, COO, IndiaAI Mission, said, “India and Sweden are not merely partners in Artificial Intelligence rather we are co-architects of a value-based, sustainable, and trusted AI future. Our collaboration reflects complementary strengths and shared democratic values, positioning both nations to shape the next phase of global technological transformation.”\n\n\"This Statement of Intent with IndiaAI represents a significant advancement, translating our shared strategic vision into concrete outcomes. Through SITAC, we are looking to connect our ecosystems and bring together the best AI and digitech innovations from both countries to create new business opportunities\" stated Mrs. Sofia Högman, Trade & Invest Commissioner of Sweden to India.\n\nBoth countries will jointly develop a dedicated programme titled the Sweden–India Technology and Artificial Intelligence Corridor (SITAC). SITAC will serve as the flagship platform to facilitate structured engagement among government agencies, industry stakeholders, startups and academic institutions from both countries.\n\nUnder SITAC, both departments will take initiatives including:\n\nThe partnership aligns the objectives of the IndiaAI Mission to build a comprehensive national AI ecosystem through access to compute, data and talent with Sweden’s strengths in industrial innovation, advanced research and development and responsible AI implementation. The collaboration is expected to support enterprises, startups and research institutions in both countries in jointly developing scalable and inclusive AI solutions.",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232803&reg=3&lang=1"
  },
  {
    "headline": "Union Tribal Affairs Minister Jual Oram Offers Prayers at Shri Banke Bihari Temple; Reviews Cold Storage Facility in Hathras",
    "fullText": "Union Minister for Tribal Affairs Shri Jual Oram today visited the world-renowned Shri Banke Bihari Temple in Mathura district and offered prayers to Lord Shri Krishna, seeking peace, prosperity, and well-being for all citizens of the country.\n\nMeanwhile the Union Minister also inspected potato cold storage facility located in Bas Amru village under the Sadabad Assembly constituency in Hathras district. During the visit he reviewed the storage arrangements, cold chain systems, and other facilities being provided to farmers. He directed the officials and management to accord the highest priority to farmers’ interests, enhance storage capacity, and ensure transparency in operations.\n\nHe also interacted with local residents and potato farmers in Bas Amru village. On this occasion, farmers shared their views regarding fair pricing of agricultural produce, expansion of storage facilities, and effective implementation of government schemes.\n\nListening attentively to the concerns of the farmers, the Union Minister assured them that the Central Government remains committed to farmers’ welfare, enhancement of income, and strengthening of agriculture infrastructure, and that various schemes are being effectively implemented in this direction. The visit reflected the Government’s commitment to spiritual values, rural development, and farmer welfare.",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001YWSS.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002ENOY.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0035E7X.jpg"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232800&reg=3&lang=1"
  },
  {
    "headline": "Union Minister of State for Rural Development participates in “Ek Ped Maa Ke Naam” in Majuli, Assam",
    "fullText": "Union Minister of State for Rural Development Shri Kamlesh Paswan continued his official visit to Majuli district on 25th February, 2026, with a series of developmental and outreach engagements.\n\nShri Kamlesh Paswan participated in the plantation programme titled “Ek Ped Maa Ke Naam” near Court Field, Garamur, reaffirming his commitment towards environmental sustainability and community participation.\n\nThereafter, the Minister visited Gubinpur Model AWC and Gubinpur LP School, where he interacted warmly with students, parents, teachers, and anganwadi workers. He took stock of the facilities available, encouraged the children in their academic pursuits, and appreciated the role of parents and frontline workers in strengthening grassroots education and child welfare services. He emphasized the importance of early childhood care, nutrition, and foundational education in shaping a self-reliant and empowered India.\n\nSubsequently, the Minister attended a seminar on Vikasit Bharat - Guarantee for Rojgar and Ajeevika Mission - Gramin (VB-G RAM-G) at the Integrated DC Office, Garamur. The programme was attended by PRI members of Majuli, senior officers, and officials of the District Administration. During the seminar, the Government of India’s commitment to strengthening rural livelihoods, promoting self-employment, and ensuring last-mile delivery of welfare schemes was highlighted.\n\nFollowing the seminar, Union Minister of State addressed the media and briefed the press on the outcomes of his visit. He expressed satisfaction over the progress of various Rural Development initiatives in Majuli and reiterated the Centre’s continued support for holistic and inclusive rural growth.",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001P43D.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002017J.jpg"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232790&reg=3&lang=1"
  },
  {
    "headline": "CBDC-Based Food Subsidy Distribution Pilot under PMGKAY to be Launched in Puducherry",
    "fullText": "In a major step towards strengthening India’s digital public infrastructure and enhancing transparency in subsidy delivery, the Government of India will launch a Central Bank Digital Currency (CBDC)-based Food Subsidy Distribution Pilot under the Pradhan Mantri Garib Kalyan Anna Yojana (PMGKAY) in the Union Territory of Puducherry on 26th February 2026.\n\nThe pilot will be inaugurated by the Hon’ble Union Minister for Consumer Affairs, Food and Public Distribution, Shri Pralhad Joshi, in the presence of the Lieutenant Governor of Puducherry, Shri K. Kailashnathan; Chief Minister of Puducherry, Shri N. Rangasamy; and other dignitaries.\n\nThe digital rupee or e-rupee is a tokenised digital version of the Indian rupee, issued by the Reserve Bank of India (RBI) as a Central Bank Digital Currency (CBDC). The introduction of Central Bank Digital Currency (CBDC – Digital Rupee) offers an opportunity to enhance the DBT ecosystem by providing a secure, instant, traceable, and programmable digital cash mechanism for PMGKAY beneficiaries, thereby enabling smoother fund flow and reducing friction in availing entitlements.\n\nThe initiative marks a significant reform in the delivery of food subsidy through the Public Distribution System (PDS) by integrating the Digital Rupee issued by the Reserve Bank of India into the Direct Benefit Transfer (DBT) framework. Under the pilot project, food subsidy will be credited to identified beneficiaries in the form of programmable Central Bank Digital Currency (CBDC) tokens directly into their CBDC wallets. The tokens shall be redeemable exclusively for purchase of entitled foodgrains at authorized merchants & Fair Price Shops (FPS), thereby ensuring purpose-bound usage of subsidy and enhanced transparency.\n\nThe pilot is being implemented in coordination with the Government of Puducherry, the Reserve Bank of India, Public Financial Management System (PFMS), and designated banking partner, Canara Bank.\n\nThe CBDC-based Digital Food Currency initiative represents the next stage of digital transformation in India’s food security ecosystem. It seeks to enhance transparency, efficiency, accountability, and beneficiary empowerment in subsidy delivery.\n\nFollowing the implementation in Puducherry, the CBDC-based pilot will be expanded in a phased manner to cover additional beneficiaries and other Union Territories.",
    "images": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "source": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2232780&reg=3&lang=1"
  }
]