[
  {
    "headline": "INS Anjadip - built with indigenous SAIL steel to join Indian Navy fleet",
    "summaryText": "<p>INS Anjadip - built with indigenous SAIL steel to join Indian Navy fleet</p><p>Steel Authority of India Limited (SAIL), the largest steelmaking public sector unit and Maharatana company, has supplied the entire quantity of special steel for the INS Anjadip built by Garden Reach Shipbuilders & Engineers Ltd (GRSE). INS Anjadip is the third Anti-Submarine Warfare Shallow Water Craft (ASW-SWC) corvette to be commissioned into the Indian Navy, following the commissioning of INS Arnala and INS Androth last year.</p><p>The ASW-SWC corvettes are being built indigenously to replace the Navy’s aging Abhay-class vessels. Contributing to this strategic effort, SAIL has supplied the full quantity of approximately 3,500 tonnes of special-grade steel for the eight ASW-SWC corvettes being built by (GRSE). The steel was sourced from SAIL’s integrated plants at Bokaro, Bhilai and Rourkela, underscoring the strength of India’s domestic supply chain.</p><p>This milestone highlights SAIL’s commitment to advancing India’s self-reliance in defence manufacturing, reduce import dependence and reinforce the vision of Aatmanirbhar Bharat. . Over the years, SAIL has consistently met the nation’s requirement for special-grade steel in defence indigenization, supplying to landmark projects such as INS Vikrant, INS Udaygiri, INS Nilgiri, INS Surat among others.</p><p>Read this release in: हिन्दी</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/आईएनएसअंजदीपC4ZA.jpeg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233347&reg=3&lang=1"
  },
  {
    "headline": "4th Meeting of Joint Defence Cooperation Committee between India and Kenya Concluded",
    "summaryText": "<p>4th Meeting of Joint Defence Cooperation Committee between India and Kenya Concluded</p><p>The fourth meeting of the Joint Defence Cooperation Committee (JDCC) between India and Kenya was held in Nairobi, Kenyabetween 24th and 26th February 2026. Discussions focused on expanding Services engagements, enhancing training opportunities, strengthening maritime security cooperation, and promoting collaboration in defence R&D and production.</p><p>​Both countries expressed satisfaction on the progress made since the previous JDCC meeting and agreed to formulate a five year roadmap to further deepen and expand defence cooperation. Both sides agreed to broaden the scope of service-to-service engagements, including initiating structured interactions between their respective Navies.</p><p>​Both countries deliberated on cooperation in customized training programmes, instituting military exercises, border management, capacity building in advanced domains such as Electronic Warfare, Cyber Security, cooperation in military medical services, including training and knowledge exchange.</p><p>​The meeting was co-chaired by Shri Amitabh Prasad, Joint Secretary (IC) and Major General Fredrick L. Leuria, Assistant Chief of Defence Forces, Kenya. The Indian delegation included senior officers from Department of Defence, Services and DGAFMS. Ambassador of India in Kenya Dr. Adarsh Swaika and India’s Defence Attache in Kenya also joined the meeting.</p><p>​The Indian delegation called on Chief of Defence Forces General Charles Kahariri and Principal Secretary Defence Dr Patrick Mariru of Kenya and briefed them on the key outcomes of the 4th India-Kenya JDCC. The discussions focused on expanding and deepening India-Kenya defence cooperation.</p><p>​The Indian delegation interacted with Commandant NDC, Kenya Lt Gen Juma Shee Mwinyikai who briefed them on the role of NDC Kenya in preparing Kenyan Defence Forces and civilians to make strategic and important decisions in their future higher roles. Both sides discussed ways to further strengthen defence training cooperation between India and Kenya.</p><p>​The Indian delegation also called on Commander of Kenya Navy Maj Gen Paul Otieno at the Mtongwe Naval base. They discussed ways to further strengthen Naval cooperation through deeper engagement between the two Navies. As part of the visit, the delegation toured the CT Scan Radiology Centre at Mtongwe, gaining insights into ongoing initiatives in military medical infrastructure and healthcare support services, and Kenya Naval Training College at the naval base.</p><p>​Joint Secretary (IC) also paid homage at the Joint India-Africa Commemorative Memorial at Mile 27, Taita Taveta County, Kenya to honour the valour and the supreme sacrifice of the unknown Indian and African soldiers who laid down their lives during World War I in the East African theatre, reaffirming the shared respect for the sacrifices of Indian and African soldiers.</p><p>​India attaches great importance to its relationship with Kenya, which is anchored in historical links, shared democratic values and close people-to-people ties.</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233323&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister Condoles the Passing of Shri Maroof Raza Ji",
    "summaryText": "<p>Prime Minister Condoles the Passing of Shri Maroof Raza Ji</p><p>Prime Minister Narendra Modi has expressed grief over the passing of Shri Maroof Raza Ji, honoring his legacy in the fields of journalism.</p><p>The Prime Minister stated that Shri Maroof Raza Ji made a rich contribution to the world of journalism. He noted that Shri Raza enriched public discourse through his nuanced understanding of defence, national security, and strategic affairs.</p><p>Expressing his sorrow, the Prime Minister said he is pained by his passing and extended his condolences to his family and friends. The Prime Minister shared on X:</p><p>“Shri Maroof Raza Ji made a rich contribution to the world of journalism. He enriched public discourse with his nuanced understanding of defence, national security as well as strategic affairs. Pained by his passing. Condolences to his family and friends”</p><p>Shri Maroof Raza Ji made a rich contribution to the world of journalism. He enriched public discourse with his nuanced understanding of defence, national security as well as strategic affairs. Pained by his passing. Condolences to his family and friends.</p><p>Read this release in: Assamese , Gujarati</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233319&reg=3&lang=1"
  },
  {
    "headline": "PRESIDENT OF INDIA TO TAKE SORTIE IN INDIGENOUS LIGHT COMBAT HELICOPTER (PRACHAND) TOMORROW",
    "summaryText": "<p>PRESIDENT OF INDIA TO TAKE SORTIE IN INDIGENOUS LIGHT COMBAT HELICOPTER (PRACHAND) TOMORROW</p><p>The Hon'ble President of India, Smt Droupadi Murmuwill visit Jaisalmer, Rajasthan tomorrow (February 27, 2026) to witness Indian Air Force's Exercise Vayu Shakti. Prior to the exercise, Hon'ble President will fly a sortie in indigenous Light Combat Helicopter (LCH) at Jaisalmer. The mission will be undertaken as a two aircraft LCH formation, with Chief of the Air Staff, Air Chief Marshal AP Singh, flying in the second LCH.</p><p>Read this release in: Marathi</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233303&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister visits Yad Vashem – The World Holocaust Remembrance Centre",
    "summaryText": "<p>Prime Minister visits Yad Vashem – The World Holocaust Remembrance Centre</p><p>Prime Minister Shri Narendra Modi, accompanied by the Prime Minister of Israel, H.E Mr. Benjamín Netanyahu, visited Yad Vashem – The World Holocaust Remembrance Centre - in Jerusalem today, and paid tribute to the victims of the Holocaust. Prime Minister participated in a solemn ceremony at the Hall of Remembrance. The ceremony was marked by the poignant recital of the \"El Maleh Rahamim\" by the Cantor. Prime Minister also visited the Book of Names Hall which displays personal stories of the victims of the Holocaust. The visit underscores the deep emotional bond and shared commitment to human values between the people of India and Israel.</p><p>Read this release in: Marathi , हिन्दी , Assamese , Gujarati , Kannada</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233272&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister meets with the President of Israel",
    "summaryText": "<p>Prime Minister meets with the President of Israel</p><p>Prime Minister Shri Narendra Modi today called on the President of Israel, H.E. Mr. Isaac Herzog, in Jerusalem. Prime Minister warmly recalled his previous meetings with President Herzog during his visit to Israel in 2017 and in Dubai in 2023. The two leaders noted that the elevation of India-Israel ties to a \"Special Strategic Partnership for Peace, Innovation and Prosperity\" marks a new beginning in bilateral ties and is reflective of the deep trust, shared democratic values and special friendship between the two countries. The two leaders expressed satisfaction at the ongoing cooperation in the fields of trade and technology, innovation and enterprise, defence and security, and counter terrorism. The two leaders also discussed regional issues of mutual interest. Expressing support for the Gaza Peace Plan, Prime Minister conveyed his satisfaction at the progress being made with the initiative to achieve peace and stability in West Asia. In a special gesture, reflecting the shared values of both nations to nurture the environment, Prime Minister, along with President Herzog and the First Lady, planted a tree in the President’s garden under the Ek Ped Maa Ke Naam (One Tree for Mother) initiative. Prime Minister thanked President Herzog for his warmth and hospitality and for his support to the India-Israel partnership.</p><p>Read this release in: Marathi , हिन्दी , Assamese , Gujarati , Kannada</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233271&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister meets with Prime Minister of Israel",
    "summaryText": "<p>Prime Minister meets with Prime Minister of Israel</p><p>On his State Visit to Israel, Prime Minister Shri Narendra Modi held official talks with the Prime Minister of Israel, H.E. Mr. Benjamin Netanyahu, in Jerusalem on February 26, 2026. The two Prime Ministers engaged in comprehensive discussions covering the entire gamut of the India-Israel partnership. Reflecting the deep trust and friendship between the two countries, the leaders decided to elevate the bilateral relationship to a \"Special Strategic Partnership for Peace, Innovation and Prosperity\". This elevation is emblematic of the growing convergence of interests and the shared vision of both countries for a secure and prosperous future. Both leaders expressed satisfaction at the progress made in bilateral cooperation across all domains and agreed to further expand collaboration in the fields of trade and investment, defence and security, space, energy, critical technologies, cyber security, education, scientific research and innovation. They also emphasized the transformative potential of the India-Israel partnership in agriculture, water management, start-ups, fintech, digital healthcare, biotechnology and advanced pharma. The two leaders welcomed the new initiatives to expand mobility partnership, which would give a further boost to people-to-people ties. Calling for early conclusion of the proposed Free Trade Agreement, they noted that the Bilateral Investment Treaty, India-Israel Innovation Bridge, India-Israel Innovation Centre for Agriculture and India-Israel Industrial R&D and Innovation Fund would significantly enhance economic, entrepreneurial and scientific collaborations between the two countries. They also called for greater collaboration in the fields of AI, Semiconductors, Quantum and other cutting-edge technologies, synergising India’s talented workforce and Israel’s innovation. The two leaders also discussed regional and global issues of mutual interest. Prime Minister conveyed his support for the Gaza Peace Plan and hoped that the initiative would bring peace and stability to the region. The two leaders also called for closer cooperation between the two countries on IMEC and I2U2 initiatives. They also expressed their resolve to strengthen the global fight against terrorism. Prime Minister thanked Prime Minister Netanyahu for the support extended by Israel in India’s fight against terrorism. Following the talks, several agreements and Memoranda of Understanding were exchanged [Link]. A Joint Statement outlining the future course of action for the bilateral partnership was adopted on the occasion of the State Visit [Link]. Prime Minister thanked Prime Minister Netanyahu for his warmth and hospitality.</p><p>Read this release in: Marathi , हिन्दी , Gujarati</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233269&reg=3&lang=1"
  },
  {
    "headline": "NAMASTE Scheme Programme Held in Pilibhit in the Presence of Hon’ble MoS Shri B. L. Verma",
    "summaryText": "<p>Ministry of Social Justice & Empowerment</p><p>NAMASTE Scheme Programme Held in Pilibhit in the Presence of Hon’ble MoS Shri B. L. Verma</p><p>Under the National Action for Mechanized Sanitation Ecosystem (NAMASTE) Scheme of the Government of India, a programme was successfully organized on 26 February 2026 at Gandhi Prekshagrih, Gandhi Stadium, Near Jeevan Rekha, Nakhasa, Pilibhit (Uttar Pradesh). The programme was graced by the esteemed presence of Shri B. L. Verma, Hon’ble Minister of State for Social Justice & Empowerment and Consumer Affairs, Food & Public Distribution, Government of India.</p><p>Major Highlights of the Programme were:</p><p>Distribution of Personal Protective Equipment (PPE) kits to Sewer and Septic Tank Workers (SSWs) and waste pickers.</p><p>Distribution of Ayushman Cards to SSWs and waste pickers for health insurance coverage.</p><p>● Distribution of sewing machines to beneficiaries who completed skill development training to promote sustainable livelihoods.</p><p>During the programme, the Hon’ble Ministers emphasized the importance of dignity, safety, and social security of sanitation workers. They shared that under the NAMASTE Scheme, 89,248 sewer and septic tank workers have been verified so far, 87,037 workers have been provided with PPE kits, 74,647 workers have been covered under the Ayushman health insurance scheme. Additionally, 1,87,120 waste pickers have been profiled across the country.</p><p>In Pilibhit, a total of 92 SSWs and 452 waste pickers have been profiled. During the event PPE Kits were distributed to 452 beneficiaries, 30 beneficiaries were provided Ayushman Cards, 15 beneficiaries who underwent skill development training were distributed sewing machines.</p><p>The programme reaffirmed the Government’s commitment to the principle of “priority to the deprived”, ensuring that historically marginalized and overlooked communities receive the support they deserve. The initiative also reflects the broader vision of Viksit Bharat 2047, which envisions inclusive growth where every citizen has the opportunity to contribute to and benefit from India’s development journey.</p><p>The programme was also graced by Shri Gulab Singh, Chairperson, District Panchayat; Dr. Aastha Agrawal, Chairperson, Municipal Council; Shri Swami Prakatanand, Hon’ble MLA; Shri Baburam Paswan, Hon’ble MLA; Shri Vivek Kumar Verma, Hon’ble MLA; Dr. Sudhir Gupta, MLC; Shri Sanjeev P. Singh, BJP District President; Smt. Yogita Swaroop, Senior Economic Advisor, Ministry of Social Justice & Empowerment, Government of India; District Administration officials; and Shri Prabhat Kumar Singh, Managing Director, National Safai Karamcharis Finance and Development Corporation.</p><p>Read this release in: हिन्दी</p>",
    "category": "Health",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001634T.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002GFE1.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0037RIO.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0040TED.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005WHFS.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233255&reg=3&lang=1"
  },
  {
    "headline": "India Set to Become Global Maritime Powerhouse; Among Top Shipping Centres by 2047: MoS Shantanu Thakur",
    "summaryText": "<p>Ministry of Ports, Shipping and Waterways</p><p>India Set to Become Global Maritime Powerhouse; Among Top Shipping Centres by 2047: MoS Shantanu Thakur Ports Handle 95% of India’s Trade by Volume; Maritime Sector Key to Viksit Bharat Vision</p><p>Reinforcing the Government’s commitment to port-led development as a cornerstone of India’s export competitiveness and economic growth, the Ministry of Ports, Shipping and Waterways (MoPSW) is implementing major initiatives to modernise maritime infrastructure, strengthen multimodal connectivity and improve logistics efficiency across the country.</p><p>Addressing the CII EXIM Conference 2026 in Kolkata, the Hon’ble Minister of State for Ports, Shipping and Waterways, Shri Shantanu Thakur, highlighted the central role of the maritime sector in India’s global trade expansion and the vision to position India as a leading shipping hub by 2047.</p><p>Shri Shantanu Thakur said: “Nearly 95% of India’s trade by volume and around 70% by value is handled through our ports. This clearly shows that the maritime sector is not merely a transport channel — it is a strategic enabler of India’s global trade ambitions.”</p><p>Emphasising the progress achieved in the maritime sector over the past decade, the Minister noted that India’s port capacity has more than doubled, cargo handling efficiency has improved significantly, and turnaround time at major ports has reduced substantially, supported by mechanisation and digitalisation initiatives.</p><p>He added: “As India moves towards becoming a USD 5 trillion economy and realising the vision of Viksit Bharat 2047, export competitiveness will be one of the strongest pillars of our economic transformation.”</p><p>Shri Shantanu Thakur also highlighted the Government’s renewed focus on strengthening India’s shipbuilding ecosystem, noting that recent policy measures and budgetary support will help position India as a major global shipbuilding nation.</p><p>He said: “As you are aware, the Hon’ble Finance Minister in the recent Union Budget has emphasised the development of shipbuilding and support for the inland shipbuilding sector. India’s geographical position is highly significant for global trade as well as the global shipbuilding industry.”</p><p>Highlighting India's long-term potential in the sector, the Minister said that with sustained policy support and industry participation, India has the potential to emerge among the leading shipbuilding nations globally.“With the right momentum and support to shipbuilding, we can achieve our targets and reach among the top shipbuilding nations in the world.”</p><p>Shri Thakur emphasised the importance of industry partnership in strengthening the maritime ecosystem and advancing India’s global competitiveness. “With your efforts and support, we will move India forward and bring our maritime sector to the forefront. Under the leadership of Hon’ble Prime Minister Shri Narendra Modi ji, this initiative began in 2014, and we are committed to building a globally competitive maritime sector in the years ahead.”</p><p>The conference brought together policymakers, industry leaders and international partners to deliberate on strengthening India's export ecosystem through improved trade infrastructure and logistics efficiency.</p><p>The inaugural session was attended by Mr Aung Myo Thein, Consul General of Myanmar; Mr Shashwat Goenka, Chairman, CII Eastern Region; and Mr Sandeep Kumar, Chairman, CII ER International Trade Subcommittee, along with senior industry representatives.</p>",
    "category": "Infrastructure",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001YP2K.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002ZZ4U.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003VBW6.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004RWRE.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005MN5C.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233239&reg=3&lang=1"
  },
  {
    "headline": "PM to address Post Budget Webinar on “Technology, Reforms and Finance for Viksit Bharat” on 27th February",
    "summaryText": "<p>PM to address Post Budget Webinar on “Technology, Reforms and Finance for Viksit Bharat” on 27th February It is the first in a series of Post Budget Webinars being organised on key themes emerging from the Union Budget</p><p>Prime Minister Shri Narendra Modi will address the Post Budget Webinar on “Technology, Reforms and Finance for Viksit Bharat” on 27th February at around 11:30 AM via video conferencing. The webinar will entail discussions on public capex, infrastructure, banking sector reforms, financial sector architecture, deepening capital markets, and ease of living through tax reforms.</p><p>The webinar is the first in a series of Post Budget Webinars being organised on key themes emerging from the Union Budget 2026–27. These webinars aim to draw lessons from past experiences and obtain structured feedback from participants to strengthen and ensure outcome-oriented implementation of the Budget announcements for FY 2026-27, drawing upon the practical experience and insights of diverse stakeholders. They will bring together stakeholders from industry, financial institutions, market participants, Government, industry regulators and academia to deliberate on effective implementation pathways for key Budget announcements.</p><p>Read this release in: Telugu , Malayalam , Assamese , Marathi , हिन्दी , Gujarati</p>",
    "category": "Economy",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233236&reg=3&lang=1"
  },
  {
    "headline": "ECI reviews poll preparedness for forthcoming Assembly Elections in Tamil Nadu",
    "summaryText": "<p>ECI reviews poll preparedness for forthcoming Assembly Elections in Tamil Nadu</p><p>Chief Election Commissioner (CEC) Shri Gyanesh Kumar along with Election Commissioners Dr. Sukhbir Singh Sandhu and Dr. Vivek Joshi held a detailed and a comprehensive review of the poll preparedness for the forthcoming Tamil Nadu Legislative Assembly Elections in Chennai today.</p><p>During the review visit, the Commission interacted with the representatives of recognized national and state political parties namely Aam Aadmi Party, Bahujan Samaj Party, Bharatiya Janata Party, Communist Party of India (Marxist), Indian National Congress, National People’s Party, All India Anna Dravida Munnetra Kazhagam, Desiya Murpokku Dravida Kazhagam, Dravida Munnetra Kazhagam, Naam Tamilar Katchi and Viduthalai Chiruthaigal Katchi and sought their suggestions.</p><p>Most of the political parties appreciated the Election Commission of India for the peaceful and smooth conduct of the Special Intensive Revision of the Electoral Rolls in Tamil Nadu.</p><p>Political parties urged the Commission to take stringent measures to curb the use of money power and distribution of freebies during elections. Some political parties asked for an increase in the number of flying squads to curb malpractices during elections.</p><p>Some of the political parties urged the Commission to keep in mind the upcoming festivals while finalising the dates of elections.</p><p>Assuring the political parties that their suggestions will be considered, CEC Shri Gyanesh Kumar assured all the political parties that elections are always held as per law in a free, fair and a transparent manner.</p><p>Following the interaction with the Political Parties, the Commission held a detailed review with the Heads/Nodal Officers of Enforcement Agencies, IGs, DIGs, DEOs, SPs on every aspect of election planning, EVM management, logistics, training of election staff, seizures, law and order, voter awareness and outreach activities.</p><p>The Commission directed all Heads/Nodal Officers of Enforcement Agencies to act with complete impartiality and firmly clamp down on all inducement related activities.</p><p>The Commission also directed all DEOs, SPs, to prioritise voters’ comfort and accessibility at polling stations, and impart robust training to officials and ensure wide awareness about electoral processes.</p><p>The Commission also directed the officers to ensure absolute impartiality and act without fear or favour and underscored that there will be zero-tolerance towards any deviation from the laws, rules and related elections with respect to the conduct of elections.</p><p>Read this release in: हिन्दी</p>",
    "category": "Infrastructure",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233237&reg=3&lang=1"
  },
  {
    "headline": "Centre Approves ₹797 Crore Green Hydrogen Jetty at Paradip Port",
    "summaryText": "<p>Ministry of Ports, Shipping and Waterways</p><p>Centre Approves ₹797 Crore Green Hydrogen Jetty at Paradip Port Union Minister Sarbananda Sonowal Credits PM Narendra Modi’s Leadership in Advancing Clean Energy InfrastructureParadip Port to Anchor National Green Hydrogen Mission With 4 MTPA Dedicated Jetty Project</p><p>New Delhi, Feb. 25, 2026: The Ministry of Ports, Shipping & Waterways (MoPSW) has approved the development of a dedicated jetty with allied facilities for handling green hydrogen, ammonia and other liquid cargo at Paradip Port at an estimated cost of ₹797.17 crores. The project will be implemented by Paradip Port Authority on a build-operate-transfer (BOT) basis.</p><p>The proposed facility will have a handling capacity of 4.0 million tonnes per annum and is designed to strengthen Paradip Port’s role as a hub for green energy cargo. The infrastructure will include a dedicated jetty, storage systems, pipelines, handling equipment and associated facilities.</p><p>Union Minister of Ports, Shipping and Waterways Sarbananda Sonowal said the approval reflects the Centre’s commitment to building future-ready green infrastructure under the leadership of Prime Minister Narendra Modi.</p><p>“This approval is a direct outcome of Prime Minister Narendra Modi ji’s inspiring and decisive leadership in positioning India as a global leader in clean energy. Under his guidance, our ports are being transformed into gateways for green growth, innovation and sustainable logistics,” Sarbananda Sonowal said.</p><p>The jetty will have a centre-to-centre distance of 279 meters between extreme end dolphins and a dredged depth of 14.3 meters in front of the berth to enable safe handling of liquid cargo vessels.</p><p>Paradip Port Authority will provide capital support equivalent to 20% of the project cost, amounting to ₹159.43 crore, during the construction phase. The project is expected to be completed within 24 months.</p><p>Union Minister Sarbananda Sonowal said the dedicated green hydrogen jetty will play a critical role in strengthening export logistics and integrating Odisha’s emerging green hydrogen production clusters with global markets.</p><p>“Guided by Prime Minister Modi ji’s vision of an Atmanirbhar and environmentally responsible India, we are building world-class port infrastructure that supports the National Green Hydrogen Mission. The Paradip project will not only enhance cargo capacity but also catalyse investment, generate employment and create a robust green energy ecosystem in eastern India,” Sonowal added.</p><p>The facility will also include provisions for handling other liquid cargo to ensure optimal utilisation during the initial growth phase of the green hydrogen sector and to diversify Paradip Port’s cargo profile.</p><p>Officials said the project is aligned with the objectives of the National Green Hydrogen Mission and is expected to support investments in green energy infrastructure in Odisha while strengthening port-based logistics for clean energy commodities.</p><p>The proposed jetty will incorporate specialised infrastructure and advanced safety systems for handling and storing green energy derivatives and other liquid cargo, supporting the development of an integrated green hydrogen ecosystem around Paradip Port.</p><p>Read this release in: Odia</p>",
    "category": "Infrastructure",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0017W7D.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002462W.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233235&reg=3&lang=1"
  },
  {
    "headline": "India - Israel Joint Statement",
    "summaryText": "<p>India - Israel Joint Statement</p><p>A Special Strategic Partnership for Peace, Innovation, and Prosperity Recognising the warmth, goodwill, and deep strategic partnership between India and Israel, the Prime Minister Shri Narendra Modi made a state visit to Israel from 25 to 26 February 2026 on the invitation of Mr. Benjamin Netanyahu, Prime Minster of the State of Israel. The Prime Minister was accompanied by a high-level delegation comprised of senior ministers and officials. Recalling Indian Prime Minister Narendra Modi's historic visit to Israel in 2017 and Prime Minister Netanyahu’s visit to India in 2018, which together laid the foundation for a new era of partnership and collaboration, the leaders noted the immense progress made in the India-Israel bilateral relationship across diverse domains, including emerging technologies, cyber, agriculture, water management, health, entrepreneurship, defence, security, and more. Prime Minister Netanyahu and Prime Minister Modi agreed and decided to elevate the Strategic Partnership to a new level – ‘A Special Strategic Partnership for Peace, Innovation & Prosperity.’ Together into the future The Prime Ministers reaffirmed their shared vision for a robust special strategic partnership rooted in mutual aspirations for peace, security and prosperity through technological innovations and entrepreneurship. The leaders acknowledged that Indian and Israeli capabilities complement each other perfectly - Israel is a global powerhouse of technology and innovation, India serves as a hub of talent, manufacturing excellence and entrepreneurial energy. The Prime Ministers affirmed their commitment to integrating India's and Israel's advancements in AI, cybersecurity, semiconductors, quantum computing, biotechnology, agriculture and water management, defence platforms, and space exploration. This partnership strengthens India’s vision of an ‘Atmanirbhar and Viksit Bharat 2047’, aims to spark the next wave of technological transformation and shared progress of both countries. Underscoring the shared commitment to transform policy priorities into tangible outcomes, the Prime Ministers emphasised the importance of institutionalising bilateral mechanisms across Government-to-Government, Business-to-Business, and People-to-People domains to ensure sustained collaboration and meaningful impact. Defence and Security Welcoming the Memorandum of Understanding on Defence Cooperation signed on 4th November 2025, Prime Minister Netanyahu and Prime Minister Modi acknowledged the significant growth made in defence cooperation between their nations, both in scope and scale. Both leaders provided a vision and a roadmap for future defence cooperation. Technology and Innovation Acknowledging the complementary strengths of India's and Israel's technological prowess that create avenues for deeper collaboration in Critical and Emerging Technology (CET) sectors, Prime Minister Netanyahu and Prime Minister Modi welcomed the new initiative on Critical and Emerging Technologies led by the National Security Advisors of the two countries. They emphasised that this initiative would synergise the individual strengths of both countries in niche technologies, fostering a focused and futuristic partnership. The leaders called on both sides to take forward the initiative. The Prime Ministers reviewed the functioning of the India-Israel Industrial R&D and Innovation Fund (I4F), jointly implemented by the Department of Science and Technology of India and the Israel Innovation Authority, and reaffirmed its important role in advancing industrial collaboration between the two countries. They agreed to further strengthen the operational implementation of the I4F mechanism, including enhanced outreach to industry and facilitation of high-quality joint R&D partnerships, in order to fully realize the Fund’s potential and expand impactful cooperation between Indian and Israeli enterprises. Acknowledging the success of the India-Israel Joint Research Calls (IIJRC), implemented by Department of Science and Technology (DST), India, and Ministry of Innovation, Science and Technology (MOST), Israel, the Prime Ministers agreed to increase the contribution of both sides— from the current USD 1 million to USD 1.5 million each. This will promote joint research between Indian and Israeli universities through joint use of research facilities, materials, and equipment, and will also provide for exchange visits of the collaborating scientists. Both sides agreed to mandate the Joint Scientific Committee to coordinate and advance the Joint Research Call. The leaders also welcomed the elevation of the Joint Commission on Science and Technology to the Ministerial level and both sides agreed to hold the JCM on Science and Technology at Ministerial level at the earliest possible occasion in India or in Israel. The Prime Ministers recognized the importance of strengthening academia–industry linkages as a key driver of innovation and agreed to promote structured networking and collaboration between researchers, industry leaders and technology experts from both countries, with a view to advancing joint research, technology development and commercial partnerships. The Prime Ministers recognized the importance of creating institutional support to advance joint innovation activities between the two countries. In this context, they agreed to explore the development of Tech Gateway mechanisms to facilitate collaborative R&D initiatives, technology validation processes, pilot projects and joint development activities between Indian and Israeli innovation ecosystems. The Prime Ministers recognized the strategic importance of Artificial Intelligence as a key driver of innovation and agreed to deepen cooperation in AI talent and expertise. They welcomed efforts to develop enabling frameworks that strengthen linkages between AI professionals, research institutions and innovative enterprises, including by facilitating professional collaboration and participation in leading innovation activities in both countries. Recognising the advances made by Israel and India in artificial intelligence, both leaders welcomed the signing of the MoU on Cooperation in Artificial Intelligence (AI) and agreed to deepen collaboration in this frontier technology for the welfare of their peoples. The Prime Ministers welcomed the ongoing collaboration between the Israel Space Agency (ISA) and the Indian Space Research Organisation (ISRO), recognising the significant potential for Israeli space-based start-ups and companies to engage more deeply with their Indian counterparts. They emphasised the importance of fostering greater cooperation between the two nations' space industries, encouraging joint ventures, innovation partnerships, and knowledge exchange to drive progress in the global space sector. Both leaders welcomed the signing of the Declaration of Intent for cooperation in establishing a ‘Horizon Scanning/Strategic Foresight Mechanism’. This mechanism helps identify emerging global trends in areas like technology, economy and society, by leveraging data, AI and expert insights to support strategic planning and decision making. Cybersecurity The Prime Ministers reaffirmed their commitment to enhancing cybersecurity in both governmental and private sectors. They emphasized the need for robust dialogue between their national cyber authorities and pledged to deepen cooperation in this field. In addition, they committed to developing a multi-year strategic program to guide bilateral collaboration in cybersecurity and advance a joint roadmap for implementation. The roadmap will include, among other elements, human capacity building, cybersecurity and AI, applied research, the integration of Security by Design principles and regular joint table top exercises. Recognising the importance of strengthening and institutionalising their comprehensive cyber cooperation, they welcomed the successful convening of the inaugural India-Israel Cyber Policy Dialogue in March 2025. In a significant step forward, both leaders welcomed the signing of Letter of Intent for the establishment of an India-Israel Centre of Excellence in Cybersecurity in India to foster the activities outlined above. Trade, Investment, and Connectivity Prime Minister Modi and Prime Minister Netanyahu emphasised the importance of unlocking the full potential of bilateral trade and investment. They welcomed the signing of the India-Israel Bilateral Investment Agreement by the two Finance Ministers in New Delhi in September 2025, which is expected to enhance investor confidence, promote greater two-way investments, and ensure transparency, predictability, and protection through a clear framework of treatment of investment and independent dispute resolution mechanism. Both leaders welcomed the signing of the Terms of Reference (ToR) for the Free Trade Area (FTA) Agreement negotiations and the convening of the first negotiating round in New Delhi. The leaders assert their commitment for the realization of the FTA Agreement between the two countries and tasked the negotiating teams to expedite the negotiations for an early signing of an FTA. Both Leaders emphasized that a resilient financial ecosystem is a fundamental pillar of economic stability. They welcomed the strategic partnership in the financial-cyber domain. This collaboration will focus on enhancing the resilience of the financial ecosystem through the exchange of financial- cyber intelligence, joint development of methodologies, and the performance of multilateral financial-cyber simulations operationalised through Financial Computer Security Incident Response Teams of both countries. Prime Minister Netanyahu appreciated India’s fintech revolution, exemplified by the Unified Payments Interface (UPI), which is a world-class model for affordable, real-time cross-border transactions. Both sides agreed to explore linking UPI with Israel’s fast payment system to enhance interoperability and strengthen economic ties. Both leaders welcomed the signing of an MoU between NPCI International and MASAV for cooperation in order to examine linkages between NPCI and MASAV for cross-border payments between the countries. The leaders noted that direct air connectivity is a basic building block that is essential for scaling the bilateral relationship to new heights. In this regard, they expressed their desire to expand direct air connectivity between Tel Aviv and major Indian cities and encouraged both Indian and Israeli airlines to take up the opportunity to start direct flight operations between the two countries. The leaders welcomed the launch of the India–Israel Financial Dialogue to boost closer financial cooperation. Both leaders encouraged more Indian participation in the infrastructure sector of Israel, particularly in light of major upcoming projects in Israel in the sectors of metro, rail, road, airports, desalination plants, waste-water treatment plants, etc. The two leaders welcomed the successful conclusion of the 4th round of India-Israel CEOs Forum and Business Summit in Tel Aviv in November 2025. They commended the meaningful engagement between business and government leaders, which contributed to strengthening bilateral economic cooperation and unlocking new opportunities for investment and collaboration across key sectors. Both leaders reaffirmed their commitment to building on this positive momentum to further deepen the India-Israel strategic partnership. They also welcomed the signing of the MoU on Arbitration between Indian Council of Arbitration (ICA) and Israeli Institute of Commercial Arbitration (IICA) recognising it as a significant step toward facilitating smoother commercial dispute resolution and enhancing investor confidence. Agriculture, Water and Environmental Protection Recognizing the critical role of water and agriculture in sustainable development, Prime Minister Modi and Prime Minister Netanyahu affirmed the importance of efforts to strengthen the partnership in water and agriculture. The partnership focusses on key areas of water conservation, wastewater treatment and its reuse for agriculture, desalination, water utility reforms, and the cleaning of the Ganges and other rivers using advanced water technologies. The Prime Ministers also agreed to strengthen the ongoing capacity building program in agriculture in Israel, led by MASHAV in collaboration with the Ministry of Agriculture of India. This multifaceted program benefits hundreds of thousands of Indian farmers, through trainings, introduction of unique and innovative techniques and knowledge transfer. The Prime Ministers apprised the progress of the 35 centres of excellence in agriculture already operating and the 8 that are being jointly operationalised in various locations across India. Both leaders noted with satisfaction that more than a million Indian farmers have been trained at these centres of excellence so far. The Prime Ministers welcomed the signing of the MOU between ICAR and MASHAV regarding the India – Israel Innovation Centre for Agriculture (IINCA) –This initiative will drive innovation and research, enhance productivity, and promote sustainable growth in agriculture. Both leaders also welcomed the launch of 20 Joint Fellowships for Agricultural Research by Indian researchers at the Volcani Agriculture Research Organization. Both leaders welcomed the signing of the Declaration of Intent on cooperation in fisheries and aquaculture in January 2026 and agreed to strengthen cooperation in this area including through setting up of a Joint Centre of Excellence in Fisheries and Aquaculture. The Prime Ministers underlined the importance of cooperation in the field of environment and climate change and agreed to have bilateral consultations to strengthen collaboration among stakeholders on climate action, including capacity building and examining possibilities for technology transfer as well as jointly promoting a circular economy, protection of biodiversity and prevention of environmental pollution. Combating Terror, Promoting Peace The leaders unequivocally and strongly condemned terrorism, in all its forms and manifestations including cross-border terrorism. They called for decisive and concerted international efforts to combat terrorism in a comprehensive and sustained manner. Expressing the grave concern over this common challenge, the Prime Ministers reaffirmed their collective resolve to combat this menace as the leaders of two vibrant and resilient democracies. They strongly condemned the heinous October 7, 2023 terror attack on Israel, the savage terror attack on Indian tourists at Pahalgam in Jammu & Kashmir in India on April 22, 2025 and the terror incident near Red Fort, New Delhi on November 10, 2025. Prime Minister Modi and Prime Minister Netanyahu reiterated their unwavering commitment to advancing global peace and security and welcomed US President Donald Trump’s \"Comprehensive Plan to End the Gaza Conflict.” The two leaders discussed the regional developments, including the peace process, and underlined the need for the establishment of a just and durable peace, security and freedom of navigation and trade in the region through dialogue and mutual understanding. Parliamentary Cooperation In view of the excellent parliamentary cooperation between the two vibrant democracies of India and Israel, and following the Memorandum of Understanding signed by the Speaker of the Lok Sabha and the Speaker of the Knesset, the leaders also welcomed the establishment of the India-Israel Parliamentary Friendship Group in the Parliament of India. People to People Cooperation The Prime Ministers emphasized that true friendship between nations leads to a connection between people that is strengthened through culture and sport. The Ministry of Culture and Sports of the State of Israel will work to deepen cooperation with the Republic of India in the field of cinema. This will include exchanges between creators, joint productions of films and series, and platforms that strengthen ties between the industries and audiences in both countries, while showcasing the unique cultures of each nation. Prime Minister Modi and Prime Minister Netanyahu acknowledged the contributions of Indian workers in Israel, who strengthen the bonds of friendship through their work. They acknowledged the importance of the Framework Agreement and Implementation Protocols, signed in November 2023, in facilitating the safe and secure mobility of Indian workers in the construction and caregiver sectors. In this regard, both leaders also welcomed the signing of the Protocols concerning the Commerce & Services, Manufacturing and Restaurant sectors. The Prime Ministers emphasized the need to ensure the safety, security, and legal rights of workers. They also emphasised the importance of expanding opportunities for Indian professionals in high-skill sectors such as data science, AI, and hi-tech. Both leaders agreed that up to 50,000 additional Indian workers may arrive in Israel within the next five years. The two leaders reviewed the work of the Joint Coordination Committee (JCC) and tasked the JCC to meet frequently to discuss outstanding issues related to workers and to resolve them at the earliest. Health The Prime Ministers called upon both sides to hold the first JWG on Health in early 2026. Both leaders agreed to collaborate on healthcare innovation, AI and digital transformation through sharing of best practices and cooperation between institutions of the countries. Education - Securing the Future Prime Minister Modi and Prime Minister Netanyahu agreed that, as knowledge-driven economies, India and Israel need to further deepen their collaborative endeavours in the field of education and promote cooperation through joint initiatives between universities, student and faculty exchanges, and the facilitation of student internships at each other's universities. Both leaders welcomed the signing of the MoU between Nalanda University and the Hebrew University of Jerusalem. They also welcomed the signing of MoU on Cooperation in advancing education through the use of Artificial Intelligence (AI). Prime Minister Modi apprised Prime Minister Netanyahu of the National Education Policy 2020, which aims to create an educational system rooted in Indian ethos as well as aligned with the 2030 Agenda for Sustainable Development. India and Israel agree to establish the India-Israel Academic Cooperation Forum (the I2I Forum) – a university-led platform for high-level, focused dialogue of academic and research institutions, policymakers, Higher Education experts, and other relevant stakeholders of India and Israel. The Forum will convene annually on rotation between India and Israel. Transforming the landscape of new global trade In an era of global uncertainties, Prime Minister Modi and Prime Minister Netanyahu reaffirmed their commitment to advancing transformative initiatives such as the I2U2 quadrilateral partnership. This framework serves as a vital instrument for fostering deeper engagement, trade, investment, innovation and leveraging the complementary strengths of both nations. The leaders discussed the India-Middle East-Europe Economic Corridor (IMEC) and expressed their intent to advance cooperation to promote regional connectivity, stability and shared prosperity through the initiative and explore Israel's role within its frameworks. Recognizing the strategic partnership and advocating the need to comprehensively enhance bilateral relations, the Prime Ministers welcomed the signing of the following new agreements: 1) MoU on cooperation in Artificial Intelligence (AI). 2) Letter of Intent on establishment of Indo Israel Cyber Centre of Excellence in India. 3) Memorandum of Understanding between the Minister of Education of Republic of India and Minister of Education of the State of Israel on the Cooperation on Advancing Education through the use of Artificial Intelligence (AI). 4) Cultural Exchange Programme between the Government of the Republic of India and the Government of the State of Israel for the Years 2026-2029. 5) Memorandum of Understanding between the Indian Council of Agricultural Research, New Delhi, Republic of India and MASHAV- Israel’s Agency for International Development Cooperation, the State of Israel on establishment of the India-Israel Innovation Centre for Agriculture (IINCA) for Cooperation in Agricultural Research and Education. 6) Memorandum of Understanding between the Ministry of Mines of the Government of the Republic of India and the Ministry of Energy and Infrastructure of the Government of the State of Israel on co-operation in the field of Geophysical Exploration. 7) Memorandum of Understanding between Ministry of Ports, Shipping and Waterways, of the Republic of India and Israel Antiquities Authority- Underwater Archaeology Unit for development of National Maritime Heritage Complex (NMHC), Lothal at Gujarat. 8) Declaration of Intent between the Ministry of Innovation, Science and Technology of the State of Israel and Office of the Principal Scientific Adviser, Republic of India on cooperation in the field of Horizon Scanning. 9) Memorandum of Understanding between the Department of Fisheries, Ministry of Fisheries, Animal Husbandry and Dairying, Government of the Republic of India and the Department of Fisheries and Aquaculture, Ministry of Agriculture and Food Security of the State of Israel on Cooperation in the field of Fisheries and Aquaculture. 10) Presentation of Report of the 4th India Israel CEO Forum. 11) Implementation Protocol C to the Agreement between the Government of the State of Israel and the Government of the Republic of India on Facilitation of the Temporary Employment of Indian Workers in Specific Labor Market Sectors in the State of Israel in Commerce and Services Sector. 12) Implementation Protocol E to the Agreement between the Government of the State of Israel and the Government of the Republic of India on Facilitation of the Temporary Employment of Indian Workers in Specific Labor Market Sectors in the State of Israel in Manufacturing Sector. 13) Implementation Protocol D to the Agreement between the Government of the State of Israel and the Government of the Republic of India on Facilitation of the Temporary Employment of Indian Workers in Specific Labor Market Sectors in the State of Israel in Restaurant Sector. 14) MOU between NPCI International Payments Limited and MASAV for linking payment systems of India and Israel (Linking of UPI with Israeli Payment system). 15) Agreement on Cooperation between Israeli Institute of Commercial Arbitration (IICA) and Indian Council of Arbitration (ICA). 16) Memorandum of Understanding between the International Financial Services Centres Authority (IFSCA) And Israel Securities Authority (ISA) in relation to mutual cooperation. Prime Minister Netanyahu and Prime Minister Modi reaffirmed their commitment to maintaining high-level engagement between the governments, industries, and peoples of both nations, with a shared vision of building an enduring India–Israel partnership that harnesses the ambitions of our knowledge-driven economies to forge a future defined by creativity, technology, collaboration, and shared success.</p><p>Read this release in: Urdu , हिन्दी , Gujarati , Odia , Kannada</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233228&reg=3&lang=1"
  },
  {
    "headline": "CDS inaugurates two-day CBRN Conclave organised by DRDO in New Delhi",
    "summaryText": "<p>CDS inaugurates two-day CBRN Conclave organised by DRDO in New Delhi</p><p>Defence Research and Development Organisation (DRDO) is organising Chemical, Biological, Radiological and Nuclear (CBRN) Conclave at Manekshaw Centre, New Delhi on February 26 & 27, 2026. The conference, with the theme ‘From policy to practice: Building CBRN resilient India’, was inaugurated by Chief of Defence Staff General Anil Chauhan. It brings together various experts and policymakers from the Armed Forces, CAPFs, and NDRF etc. with the aim to strengthen India’s response against CBRN threats.</p><p>In his address, the Chief of Defence Staff commended the work done by DRDO towards achieving self-reliance in CBRN defence technologies. Quoting Prime Minister Shri Narendra Modi, he stated that India will not be deterred by nuclear blackmail, emphasising that “CBRN needs to be considered as more of an environment than a threat, and we should brace ourselves to learn to live and operate in contaminated environments.” He underlined the need to stay ready with indigenous, state-of-the-art CBRN defence equipment for early warning systems, light weight Individual Protective Equipment & gadgets, well researched SOPs, and protocols to carry out coordinated operations in synergy with military and civilian establishment.</p><p>Secretary, Department of Defence R&D and Chairman DRDO Dr Samir V Kamat voiced the DRDO’s commitment to build CBRN resilient India through its specialised labs and centres which dedicatedly work on developing advanced technology for defence against CBRN threats. He urged the participants of the conference to utilise this as an opportunity for peer learning and contribute to advance research endeavours to build a resilient India.</p><p>Guest of Honour of the event, DG Armed Forces Medical Services (AFMS) Surgeon Vice Admiral Arti Sarin congratulated DRDO for timely organising this conclave and said that this will not only help in reflecting on the outstanding work done by its Scientists & Engineers but also bring in the users’ perspective for making a robust plan for futuristic technology development. She commended Vikiran Prehri program, a joint initiative of DRDO and AFMS for training the medical doctors of AFMS & CAPFs and said that the program has resulted in capacity building in the country for availability of trained manpower in medical management of radiological events.</p><p>DG (Soldier Support System) Dr UK Singh spelt out the broad contours of the conclave and modalities of engagement. He urged all the stakeholders to utilise this platform as an opportunity to come up with varied scenarios and the criticality in their operations and prepare a comprehensive plan, which will work as a guiding document for development of products/technologies with a speed of relevance to tackle any CBRN threat whatsoever.</p><p>The two-day event focuses on enhancing national resilience by incorporation of stakeholder’s perspectives in training and infusion of technologies. This will enhance the preparedness of security agencies in coordinated response for handling any CBRN event. The conclave underlined DRDO’s commitment in building a robust national network centric command and control framework utilising state-of-the-art sensors and Artificial Intelligence/Machine Learning tech for CBRN security & defence of the nation.</p><p>Read this release in: Urdu , हिन्दी , Tamil</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0014SNO.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image00248SX.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233229&reg=3&lang=1"
  },
  {
    "headline": "List of Outcomes: Visit of Prime Minister to Israel",
    "summaryText": "<p>List of Outcomes: Visit of Prime Minister to Israel</p><p>ANNOUNCEMENTS 1. Elevation of relationship to Special Strategic Partnership 2. JCM on Science and Technology elevated to Ministerial level 3. Initiative to collaborate in Critical and Emerging Technologies led by National Security Advisors 4. Financial Dialogue 5. Tech-Gateway Initiative 6. 20 Joint Fellowships in Agricultural Research 7. Increase of contribution of both sides for the Joint Research Calls 8. Quota of up to 50,000 Indian workers over the next 5 years. 9. India-Israel Academic Cooperation Forum 10. India- Israel Parliamentary Friendship Group</p><p>Read this release in: Urdu , हिन्दी , Marathi , Tamil , Kannada , Malayalam</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233226&reg=3&lang=1"
  },
  {
    "headline": "MoRTH Sensitizes Stakeholders on “PM RAHAT” – Cashless Treatment of Road Accident Victims",
    "summaryText": "<p>Ministry of Road Transport & Highways</p><p>MoRTH Sensitizes Stakeholders on “PM RAHAT” – Cashless Treatment of Road Accident Victims</p><p>Ministry of Road Transport and Highways (MoRTH) conducted a high-level meeting in hybrid mode under the Chairmanship of Hon’ble Minister Shri Nitin Jairam Gadkari and Hon’ble Ministers of State Shri Ajay Tamta & Shri Harsh Malhotra to assess the status of actions being undertaken for the seamless nationwide implementation of the PM RAHAT (Road Accident Victims’ Hospitalization and Assured Treatment) Scheme, launched by the Hon’ble Prime Minister on 13.02.2026. The meeting aimed at reviewing overall readiness and coordination across concerned stakeholders, including integration for emergency response, platform onboarding and system preparedness, expansion and preparedness of the designated hospital network, and the governance and grievance redressal framework to ensure effective and timely cashless treatment to road accident victims.</p><p>India records a significant number of road accident fatalities every year, many of which are preventable with timely medical intervention. Studies indicate that nearly 50% of road accident deaths can be averted if victims are admitted to hospital within the first hour.</p><p>Integration with the Emergency Response Support System (ERSS) 112 helpline ensures that accident victims reach hospitals within the Golden Hour. Road accident victims, Rah-Veer (Good Samaritans), or any person at the accident site may dial 112 to obtain details of the nearest designated hospital and request ambulance assistance, enabling swift coordination between emergency responders, police authorities and hospitals.</p><p>Under the Scheme, every eligible road accident victim on any category of road will be entitled to cashless treatment up to ₹1.5 lakh per victim, for period of 7 days from the date of accident. Stabilization treatment will be provided for up to 24 hours in non-life-threatening cases and up to 48 hours in life-threatening cases, subject to police authentication on an integrated digital system.</p><p>PM RAHAT is implemented through a robust, technology-driven framework amalgamating the Electronic Detailed Accident Report (eDAR) platform of the Ministry of Road Transport and Highways with the Transaction Management System (TMS 2.0) of the National Health Authority. This integration enables seamless digital linkage from accident reporting to hospital admission, police authentication, treatment administration, claim processing, and final payment. Police confirmation is required within defined timelines – 24 hours for non-life-threatening cases and 48 hours for life-threatening cases – ensuring accountability while allowing uninterrupted emergency care.</p><p>Reimbursement to hospitals will be made through the Motor Vehicle Accident Fund (MVAF). In cases where the offending vehicle is insured, payment will be drawn from contributions made by General Insurance Companies. In uninsured and Hit & Run cases, payment will be made through budgetary allocation by Government of India. Claims approved by the State Health Agency will be paid within 10 days, thereby providing financial certainty to hospitals and encouraging uninterrupted treatment.</p><p>Grievances of road accident victims will be addressed by a Grievance Redressal Officer nominated by the District Road Safety Committee chaired by the District Collector / District Magistrate / Deputy Commissioner, ensuring accountability at the district level.</p><p>The meeting witnessed active and constructive participation from Hon’ble Ministers of Transport and Health from various States/UTs, Transport and Health Secretaries, DGPs from States / UTs, along with senior officials from MoRTH, MHA, MoHFW, DFS, NHA, NIC, PFMS, State Health Agencies, and other key stakeholders. States shared encouraging progress on implementation readiness, including onboarding on TMS 2.0, creation of PFMS credentials by District Collectors and other important parameters for scheme implementation readiness. The collective commitment demonstrated during the deliberations reflects “whole of Government approach” and readiness to operationalize the PM RAHAT scheme effectively across the country, ensuring timely cashless treatment support to road accident victims.</p><p>Read this release in: Urdu , हिन्दी</p>",
    "category": "Health",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001VI9I.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002HXEY.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233219&reg=3&lang=1"
  },
  {
    "headline": "Vice-President Shri C. P. Radhakrishnan to Visit Tamil Nadu on 27th February, 2026",
    "summaryText": "<p>Vice President's Secretariat</p><p>Vice-President Shri C. P. Radhakrishnan to Visit Tamil Nadu on 27th February, 2026</p><p>The Vice-President of India, Shri C. P. Radhakrishnan, will visit Salem, Tamil Nadu on 27 February, 2026. During the visit, the Vice President will inaugurate the new academic building of the Indian Institute of Handloom Technology (IIHT), Salem.</p><p>Read this release in: Urdu , हिन्दी , Malayalam</p>",
    "category": "General",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233212&reg=3&lang=1"
  },
  {
    "headline": "First Round of India–Israel FTA Talks Conclude Successfully in New Delhi",
    "summaryText": "<p>Ministry of Commerce & Industry</p><p>First Round of India–Israel FTA Talks Conclude Successfully in New Delhi FTA Talks Cover Wide-Ranging Issues; Next Round to Be Held in Israel in May 2026</p><p>The first round of negotiations for the India–Israel Free Trade Agreement (FTA), held from 23 to 26 February 2026 in New Delhi, concluded successfully today. The Terms of Reference (ToR) was signed in November 2025, establishing a structured framework for discussions on identified areas to enhance trade and economic cooperation.</p><p>Presently on a two-day State Visit to Israel, Prime Minister Shri Narendra Modi while addressing a Special Plenary of the Knesset in Jerusalem on February 25, 2026, called for early finalization of an ambitious Free Trade Agreement to realize the untapped trade potential between the two countries.</p><p>On 24th February 2026, Union Minister of Commerce and Industry, Shri Piyush Goyal, met the visiting Israeli delegation and emphasized that both sides should work closely to unlock new opportunities in trade, innovation, and growth, thereby further strengthening the valued partnership between the two countries. He encouraged both sides to strive towards a modern, comprehensive, and future-ready trade agreement.</p><p>During the four-day negotiations, both countries engaged in discussions covering a wide range of areas, including trade in goods and services, rules of origin, sanitary and phytosanitary measures, technical barriers to trade, customs procedures, intellectual property rights, digital trade, and other key chapters. Discussions were held in a constructive and forward-looking manner, with both sides reaffirming their objective of negotiating a comprehensive, balanced, and mutually beneficial agreement. Both sides also agreed to continue inter-sessional engagements virtually. The next round of in-person negotiations will be held in May 2026 in Israel.</p><p>Bilateral merchandise trade between the two countries stood at approximately USD 3.62 billion in FY 2024–25. The proposed FTA offers a valuable opportunity to enhance trade flows by providing a stable and predictable framework for businesses in both India and Israel. Both sides noted the untapped potential in key sectors, including machinery, chemicals, textiles, agriculture, medical devices, and advanced technologies. The successful conclusion of the first round reflects a shared commitment to deepen economic partnership and creating new opportunities for stakeholders.</p><p>Abhishek Dayal/ Abhijith Narayanan/ Ishita Biswas</p><p>Read this release in: Urdu , Marathi , हिन्दी , Gujarati , Telugu , Malayalam</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233199&reg=3&lang=1"
  },
  {
    "headline": "Indian Railways and Indian Army Launch ‘Framework of Cooperation’ to Strengthen Post-Retirement Career Opportunities for Agniveers and Serving Army Personnel",
    "summaryText": "<p>Indian Railways and Indian Army Launch ‘Framework of Cooperation’ to Strengthen Post-Retirement Career Opportunities for Agniveers and Serving Army Personnel Major Employment Push with Dedicated Reservation for Ex-Servicemen and Ex-Agniveers in Level-1 and Level-2/Above PostsRailways to Recruit Over 5,000 Ex-Servicemen as Pointsmen on Contract Basis to Fill Vacancies FasterRailways Reserved 14,788 Posts for Ex-Servicemen in 2024–25 Vacancy Notifications</p><p>In a significant step towards deepening institutional collaboration, Indian Railways and the Indian Army have introduced a “Framework of Cooperation” aimed at expanding post-retirement employment opportunities for Agniveers and serving Army personnel transitioning to civilian life.</p><p>Spearheaded by senior leadership from the Army and the Ministry of Railways, the initiative is designed to ensure a smoother shift from military to civilian careers. It will also increase awareness about job prospects within the Railways and create a dedicated support system to assist retiring personnel.</p><p>This collaborative framework underscores a shared commitment to providing veterans with meaningful second-career pathways while supporting broader national development goals.</p><p>Major Employment Opportunities for Ex-Servicemen</p><p>Welfare and resettlement of retired armed forces personnel form an important component of Indian Railways’ policy framework.</p><p>To provide employment avenues for ex-servicemen and ex-agniveers:</p><p>10% horizontal reservation in Level-2/above posts and 20% in Level-1 posts has been provisioned for ex-servicemen.</p><p>Additionally, 5% reservation in Level-2/above posts and 10% in Level-1 posts has been earmarked for ex-agniveers.</p><p>In the years 2024 and 2025, a total of 14,788 posts were reserved for ex-servicemen in railway vacancy notifications, including:</p><p>8,303 posts in Level-2/above</p><p>Recruitment to Level-1 (erstwhile Group D) and Level-2/above posts is conducted through Railway Recruitment Centres (RRCs) and Railway Recruitment Boards (RRBs), respectively, via competitive examinations.</p><p>Immediate Engagement Through Contractual Appointments</p><p>To promote faster engagement of ex-servicemen and address existing vacancies, the Ministry of Railways has decided to recruit ex-servicemen as ‘Pointsmen’ across Indian Railways on a contract basis until regular recruitment processes are completed.</p><p>More than 5,000 Level-1 posts are currently being processed at the Zonal and Divisional levels. So far, 9 Divisions have entered into MoUs with concerned Army organizations for hiring of Pointsmen.</p><p>The collaborative framework also calls upon Army recruiting organizations to proactively engage with Railway Divisions to expedite the filling of these posts.</p><p>Harnessing Collective Strengths for Nation Building</p><p>Indian Railways and Indian Army share valuable skills, discipline, technical competence and leadership qualities developed during service, contributing significantly to nation building. A substantial number of soldiers retire at a comparatively young age with rich operational and managerial experience, along with strong discipline and national fervour.</p><p>The cooperation between Indian Railways and Indian Army plays a vital role in logistics and personnel movement. Strategic infrastructure projects such as the Dedicated Freight Corridors and the Udhampur–Srinagar–Baramulla Rail Link have enhanced rapid deployment capabilities for troops and equipment. Skill-sharing initiatives are also being promoted through Memorandums of Understanding (MoUs) with Gati Shakti Vishwavidyalaya.</p><p>The framework promotes structured engagement of ex-servicemen and ex-agniveers within the existing recruitment system and strengthens long-term collaboration. The initiative underscores the Government’s commitment to leveraging the experience and discipline of armed forces veterans while strengthening national infrastructure and security coordination.</p><p>Dharmendra Tewari/ Ritu Raj</p><p>Read this release in: Urdu , Marathi , हिन्दी , Gujarati , Tamil , Kannada , Malayalam</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233196&reg=3&lang=1"
  },
  {
    "headline": "“Shilp Samagam is not merely a fair, but a bridge to self-reliance and dignity” – Dr. Virendra Kumar inaugurates ‘Shilp Samagam–2026’",
    "summaryText": "<p>Ministry of Social Justice & Empowerment</p><p>“Shilp Samagam is not merely a fair, but a bridge to self-reliance and dignity” – Dr. Virendra Kumar inaugurates ‘Shilp Samagam–2026’</p><p>“This is not merely an exhibition of products, but a celebration of self-reliance, dignity and social empowerment.” With these words, the Union Minister for Social Justice and Empowerment, Dr. Virendra Kumar, today inaugurated the Shilp Samagam Mela–2026 at ‘Vallabh Sadan’, Sabarmati Riverfront, Ahmedabad.</p><p>Extending greetings to all present on the occasion of the upcoming festival of Holi, the Minister stated that the fair symbolizes the Ministry’s sustained commitment towards economically empowering the targeted sections of society and integrating them into the mainstream.</p><p>The Minister informed that since 2014, nearly 100 Shilp Samagam Melas have been organized or participated in by the Department of Social Justice and Empowerment. During 2025–26, five (05) such melas have been organized, and more are planned for 2026–27. He noted that Ahmedabad, known for its association with the freedom movement, Mahatma Gandhi’s Sabarmati Ashram, and as the karmabhoomi of Sardar Vallabhbhai Patel, is an appropriate venue for such an inclusive event.</p><p>The Ministry is implementing various schemes for the social and economic upliftment of Scheduled Castes, Other Backward Classes, Safai Karamcharis, Divyangjans, De-notified, Nomadic and Semi-Nomadic Tribes (DNT/NT/SNT), Senior Citizens and the Transgender community. The Minister stated that fairs like Shilp Samagam provide a direct marketing platform to artisans and beneficiaries belonging to these sections.</p><p>The mela, being held from February 26 to March 4, features 75 stalls allocated to artisans from 14 States. A wide range of handicraft products are on display, including Lucknowi Chikankari, Banarasi sarees, Chanderi and Maheshwari textiles, Bhagalpuri Tussar silk, Jaipuri and Kolhapuri footwear, Agate stone work, bamboo products, Kota Doria, and Carpets etc.</p><p>The Minister further informed that for artisans who are unable to participate directly, the Ministry has developed the ‘Bharat Tulip’ online platform to facilitate the sale of their products, which has been integrated with various e-commerce platforms. A ‘Bharat Tulip Showroom’ has also been launched at the mela to connect more beneficiaries with market opportunities.</p><p>Under the SEED Scheme for the empowerment of De-notified, Nomadic and Semi-Nomadic Tribes, 5,581 Women Self-Help Groups have been formed across eight States. These groups are being provided Revolving Funds, Entry Point Funds, and skill training. Under the health component, approximately 75,000 Ayushman Cards have been distributed.</p><p>The Minister stated that on March 13, 2024, Hon’ble Prime Minister Shri Narendra Modi dedicated the ‘PM-SURAJ Portal’ to the nation, enabling transparent and accessible delivery of concessional loan schemes of the Ministry to targeted beneficiaries. The ‘PM-DAKSH Portal’ has been developed for skill training, and the ‘SFMP Portal’ for scholarships. These digital initiatives have significantly enhanced transparency and efficiency in implementation.</p><p>He further informed that under the Ministry’s ‘VISVAS' yojana, eligible beneficiaries are provided a 5 percent interest subvention on bank loans. The ‘NAMASTE' scheme ensures safety and dignity for workers engaged in septic tank and sewer-related work. The Apex Corporations under the Ministry have so far extended loan assistance to nearly 60 lakh individuals and their families, and provided skill training to more than 6 lakh youth.</p><p>Expressing confidence, the Minister said that Shilp Samagam Mela at Ahmedabad will not only boost the sales of artisans’ products but also connect them with self-reliance, dignity and new opportunities. Concluding his address, he conveyed his best wishes to all participants and reaffirmed the Ministry’s continued commitment to bringing marginalized communities into the mainstream.</p><p>Read this release in: Urdu , हिन्दी , Gujarati</p>",
    "category": "Economy",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001DFQF.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002HFIF.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003U7JN.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004GCOE.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0052BWG.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233191&reg=3&lang=1"
  },
  {
    "headline": "India–Bhutan Deepen Bilateral Cooperation on Trans-Boundary Rivers and Hydropower Projects",
    "summaryText": "<p>India–Bhutan Deepen Bilateral Cooperation on Trans-Boundary Rivers and Hydropower Projects Secretary, DoWR, RD & GR Reviews Hydropower Projects; Explores Enhanced Flood Forecasting and Data Sharing Mechanisms</p><p>Shri V. L. Kantha Rao, Secretary, Department of Water Resources, River Development & Ganga Rejuvenation (DoWR, RD & GR), Ministry of Jal Shakti, GoI, led an Indian delegation comprising officers from DoWR, RD & GR; the State Governments of Assam and West Bengal; and WAPCOS Ltd., to the Kingdom of Bhutan from 24–27 February 2026 to discuss matters related to cooperation on trans-boundary rivers and to review the ongoing activities of the Punatsangchhu-I Hydro Electric Project being implemented in Bhutan in partnership with the Government of India.</p><p>During the Secretary-level bilateral meeting held on 25 February 2026, the two sides reviewed the existing mechanisms of bilateral cooperation between India and Bhutan in flood management and flood forecasting. Further deliberations focused on strengthening and modernising the existing hydro-meteorological observation network in Bhutan on trans-border rivers, improving data-sharing mechanisms for hydro-meteorological and flood forecasting data relating to trans-border rivers, enhancing collaboration in capacity building and technical exchanges, and addressing emerging challenges arising from climate change, glacial lake outburst floods (GLOFs), and extreme weather events.</p><p>After the bilateral meeting, the Secretary paid a courtesy call on H.E. Lyonpo Gem Tshering, Hon’ble Minister for Energy and Natural Resources.</p><p>The Secretary, DoWR, RD & GR, MoJS, GoI, also visited the Punatsangchhu-I Hydro Electric Project under construction and the recently commissioned Punatsangchhu-II Hydroelectric Project in Bhutan on 26 February 2026. He held meetings with officials of PHPA-I and PHPA-II and reviewed the progress of these projects. Other site visits included the National Center for Hydrology and Meteorology (NCHM), Bhutan, in Thimphu; the 3.5 MLD Water Treatment Plant at Chamgang; and the NCHM flood monitoring station near Wangdue Phodrang Dzong.</p><p>The visit aimed to enhance water resources management, flood forecasting, and climate resilience in shared river basins. It reaffirmed the shared commitment of both countries to the sustainable and mutually beneficial management of trans-boundary water resources. The Secretary, DoWR, RD & GR, GoI, conveyed India’s continued support for deepening cooperation in water resources management.</p><p>Meeting with Minister, MoNER, RGOB</p><p>Group photo at NCHM, Thimphu</p><p>Visit to 3.5 MLD Water Treatment Plant</p><p>Visit to NCHM Flood Monitoring Station Near Wangdue Phodrang Dzong</p><p>Review of Puna-2 & Puna-1 at Kamechu Conference Hal</p><p>Visit to Punatsangchhu-1 HEP</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001M45L.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002XVU0.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003W3RT.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004JITX.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005R6H7.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image00621UX.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image007UE6Z.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image008ED02.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image009T2LF.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233399&reg=3&lang=1"
  },
  {
    "headline": "Ministry of Ayush showcases integrated healthcare and rural empowerment at National Arogya Fair 2026 in Shegaon",
    "summaryText": "<p>Ministry of Ayush showcases integrated healthcare and rural empowerment at National Arogya Fair 2026 in Shegaon “Ayush is becoming the backbone of preventive healthcare and rural prosperity,” says Union Minister Shri Prataprao Jadhav“Medicinal farming will empower villages and position India as a global Ayush leader”</p><p>The Ministry of Ayush is showcasing a vibrant and comprehensive pavilion at the National Arogya Fair 2026 being held from February 25 to 28, 2026 at Shegaon in Buldhana district of Maharashtra. The pavilion reflects the Ministry’s continued commitment towards strengthening preventive, promotive and integrative healthcare through various Ayush systems of medicine while simultaneously promoting rural livelihoods through medicinal plant cultivation and value addition.</p><p>On the second day of the Fair, Union Minister of State (Independent Charge) for Ayush, Shri Prataprao Jadhav, addressed a large gathering of farmers, practitioners, entrepreneurs and members of the public. Emphasising the growing relevance of Ayush in addressing lifestyle disorders, he urged citizens to adopt disciplined daily routines such as early sleep and early rising to combat conditions like diabetes and hypertension. He highlighted the importance of preventive healthcare and encouraged the adoption of simple Ayurvedic home remedies rooted in traditional wisdom, referring to the popular concept of “Aaji Bai ka Batua” as an affordable and practical model for village-level self-care. He stated that Ayush is not only a system of medicine but also a movement for social transformation, rural empowerment and global leadership in holistic healthcare.</p><p>The Ministry’s pavilion features participation from its Research Councils, National Institutes and the National Medicinal Plants Board (NMPB), showcasing research achievements, academic programmes, clinical services, public health initiatives and evidence-based advancements across Ayush systems. A wide range of physical and digital Information, Education and Communication (IEC) materials are being disseminated to create awareness about flagship schemes, research outcomes and public health outreach programmes. Interactive digital displays and exhibitions on medicinal plants and herbal products are engaging visitors from different age groups and backgrounds.</p><p>Free medical consultations are being provided by qualified practitioners from Ayurveda, Yoga and Naturopathy, Unani, Siddha, Sowa-Rigpa and Homoeopathy systems. Authentic Ayush medicines are being distributed free of cost, ensuring direct healthcare benefits to citizens, particularly those from underserved areas. Live Yoga demonstrations and Yoga therapy sessions are witnessing enthusiastic public participation, highlighting the preventive and restorative potential of Yoga in managing stress and lifestyle-related ailments. An exclusive Ayush Aahar segment is promoting region-specific and nutritionally balanced dietary practices based on Ayush principles, reinforcing the critical role of diet in preventive healthcare and overall well-being.</p><p>A dedicated stall by the National Medicinal Plants Board is generating considerable interest among farmers and agri-entrepreneurs by showcasing initiatives related to medicinal plant cultivation, conservation, quality planting material, post-harvest management and market linkages. In coordination with the Agricultural Officer, ATMA Buldhana, PDKV Akola, RCFC Pune and NMPB Delhi, a comprehensive workshop on medicinal plant cultivation, harvesting, processing and market linkage has been organised during the Fair. Approximately 2000 farmers participated in the workshop, leading to the signing of nine Letters of Intent. A notable Letter of Intent was signed between Sevarpan Farmer Producer Organization and Veloce Herbals Pvt. Ltd., Gwalior, for the assured procurement of 100 metric tonnes of turmeric, ensuring buy-back arrangements, stable pricing and strengthened supply chains for medicinal crops. Such agreements are expected to encourage large-scale cultivation of high-value medicinal plants including turmeric, ginger, shatavari and aloe vera, thereby enhancing farmer incomes and supporting the Ayush industry.</p><p>Shri Jadhav also highlighted the importance of structured market linkages, quality standards and institutional support to enable India to emerge as a reliable global supplier of medicinal plant raw material. The National Arogya Fair 2026 has thus emerged as an important platform for direct engagement with citizens, healthcare providers, farmers and industry stakeholders, reinforcing the Ministry’s vision of holistic health, rural empowerment and global leadership in Ayush systems.</p><p>Shri Mahesh Kumar Dadhich, CEO, National Medicinal Plants Board, was also present on the occasion. He addressed farmers on the Central Sector Scheme on Medicinal Plants which is being implemented by the National Medicinal Plants Board under the Ministry of Ayush to promote cultivation, conservation and sustainable management of medicinal plant resources across the country.</p>",
    "category": "Agriculture",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001UA3J.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0020MPY.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0034GK9.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0042MQJ.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005UMBG.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image006GP5F.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233398&reg=3&lang=1"
  },
  {
    "headline": "Union Home Minister and Minister of Cooperation Shri Amit Shah pays tribute to the great revolutionary, invincible Chandrashekhar Azad, on his death anniversary",
    "summaryText": "<p>Union Home Minister and Minister of Cooperation Shri Amit Shah pays tribute to the great revolutionary, invincible Chandrashekhar Azad, on his death anniversary Chanting \"Vande Mataram\" until his last breath, Chandrashekhar Azad fought valiantly against the British ruleWhether it was the Kakori train action, formation of Hindustan Socialist Republican Association (HSRA), or creation of a powerful organization for revolutionaries, every moment of Chandrashekhar Azad's life was dedicated to the cause of freedomRemembering his saga of sacrifice still fills us with patriotism</p><p>Union Home Minister and Minister of Cooperation Shri Amit Shah paid tribute to the great revolutionary, invincible Chandrashekhar Azad, on his death anniversary.</p><p>In a post on X platform, Union Home Minister and Minister of Cooperation Shri Amit Shah said that chanting \"Vande Mataram\" until his last breath, Chandrashekhar Azad fought valiantly against the British rule. He said that whether it was the Kakori train action, formation of Hindustan Socialist Republican Association (HSRA), or creation of a powerful organization for revolutionaries, every moment of Chandrashekhar Azad's life was dedicated to the cause of freedom. Shri Shah said that remembering his saga of sacrifice still fills us with patriotism.</p><p>जीवन की अंतिम सांस तक ‘वंदे मातरम्’ का गान करते हुए चंद्रशेखर आजाद जी ने अंग्रेजी हुकूमत के विरुद्ध वीरतापूर्ण लड़ाई लड़ी। काकोरी ट्रेन एक्शन हो, हिंदुस्तान सोशलिस्ट रिपब्लिकन एसोसिएशन (HSRA) का गठन हो, या क्रांतिकारियों के लिए सशक्त संगठन निर्माण, चंद्रशेखर आजाद जी के जीवन का… pic.twitter.com/YmLO17COBz</p><p>Read this release in: हिन्दी</p>",
    "category": "General",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233395&reg=3&lang=1"
  },
  {
    "headline": "Casebook on AI and Gender Empowerment Launched at India AI Impact Summit 2026",
    "summaryText": "<p>Ministry of Electronics & IT</p><p>Casebook on AI and Gender Empowerment Launched at India AI Impact Summit 2026 Joint Initiative of MeitY and UN Women, supported by MoWCD, showcases Gender-Responsive AI Solutions from the Global South</p><p>The Casebook on AI and Gender Empowerment was officially launched at the India AI Impact Summit 2026 on 17th February, marking a significant milestone in India's commitment to inclusive and ethical artificial intelligence advancement.</p><p>Developed by the Government of India through the IndiaAI Mission under the Ministry of Electronics and Information Technology (MeitY) in partnership with UN Women and supported by the Ministry of Women and Child Development (MoWCD), the casebook brings together 23 real-world AI solutions from across the Global South that demonstrate measurable impact on gender equality and women's empowerment.</p><p>The publication was jointly launched by Shri S. Krishnan, Secretary, Ministry of Electronics and Information Technology (MeitY); Shri Anil Malik, Secretary, Ministry of Women and Child Development (MoWCD); and Ms. Christine Arab, Regional Director, UN Women Asia and the Pacific.</p><p>Global Recognition at the Summit</p><p>The casebook received international recognition when United Nations Secretary-General António Guterres visited the UN Women stall at the JanAI Expo on 20 February 2026. During his visit, the Secretary-General engaged with young women from rural communities pursuing STEM careers under the WeSTEM project, implemented by UN Women in collaboration with the Governments of Madhya Pradesh, Gujarat, and Maharashtra, the European Union, Micron, Nokia, and the Head Held High Foundation.</p><p>The young women shared how they are using AI to build new skills, expand access to learning, and explore emerging employment opportunities, reflecting practical pathways toward becoming future technology leaders. A copy of the casebook was presented by Kanta Singh, Country Representative a.i., UN Women to the Secretary-General during his visit, in the presence of Under-Secretary-General and the Secretary-General’s Envoy on Technology, Amandeep Singh Gill.</p><p>Showcasing Gender-Responsive AI Innovation</p><p>The casebook features 23 AI solutions selected from 233 submissions across more than 50 countries through a rigorous multi-stage evaluation process. An independent evaluation committee comprising senior officials from MeitY, MoWCD, and UN Women assessed submissions based on real-world deployment, measurable gender impact, and evidence-based outcomes.</p><p>The featured solutions span critical sectors including:</p><p>Healthcare including menstrual health</p><p>Economic empowerment and financial inclusion</p><p>Digital safety and prevention of technology-facilitated gender-based violence</p><p>Climate resilience and sustainable agriculture</p><p>Access to justice and legal services</p><p>Education and skills development</p><p>Knowledge Resource for Policymakers and Practitioners</p><p>The casebook serves as a comprehensive knowledge resource for policymakers, technology developers, researchers, and practitioners, highlighting practical options to ensure AI systems are ethical, inclusive, and responsive to the diverse realities of women and girls in India and across the Global South.</p><p>The publication aligns with India's vision of democratic AI diffusion and supports the Government's commitment to embedding gender-responsive principles across the Seven Chakras (working groups) of the IndiaAI Mission.</p><p>The development of the casebook exemplifies effective collaboration between the Government of India and international partners:</p><p>Ministry of Electronics and Information Technology (MeitY): Led the IndiaAI Mission framework and provided strategic direction</p><p>UN Women: Coordinated global outreach, managed submission evaluation, and provided technical expertise on gender and AI</p><p>The initiative was supported by the Ministry of Women and Child Development (MoWCD): India's nodal agency for gender, ensured gender-responsive evaluation standards.</p><p>The casebook is available for download at: https://impact.indiaai.gov.in/events/released-compendium</p><p>The India AI Impact Summit 2026 (16-20 February 2026) convened global leaders, policymakers, innovators, and civil society to advance responsible, inclusive, and impactful artificial intelligence. The Summit builds on India's leadership in digital public infrastructure and positions India as a co-architect of the global AI governance framework.</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001HFBY.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002WSN8.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0038RZV.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233368&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister Pays Tributes to Chandra Shekhar Azad on Martyrdom Day: Shares a Sanskrit Subhshitam Highlighting his Life Lessons",
    "summaryText": "<p>Prime Minister Pays Tributes to Chandra Shekhar Azad on Martyrdom Day: Shares a Sanskrit Subhshitam Highlighting his Life Lessons</p><p>Prime Minister Shri Narendra Modi, offered his respectful tributes to the legendary revolutionary, Chandra Shekhar Azad, the brave son of Mother India on his martyrdom day .</p><p>The Prime Minister stated that Azad sacrificed his everything to free Mother India from the shackles of slavery, and for this, he will always be remembered.</p><p>Reflecting on the legacy of the immortal revolutionary, the Prime Minister remarked that the life of Chandra Shekhar Azad demonstrates that the resolution to stand firm against injustice is the essence of true prowess. Shri Modi, added that the saga of his sacrifice for the motherland will continue to inspire every generation of the country.</p><p>Prime Minister Shared on X;</p><p>“भारत माता के वीर सपूत चंद्रशेखर आजाद के बलिदान दिवस पर उन्हें मेरी आदरपूर्ण श्रद्धांजलि। उन्होंने मां भारती को गुलामी की बेड़ियों से आजाद कराने के लिए अपना सर्वस्व न्योछावर कर दिया, जिसके लिए वे सदैव स्मरणीय रहेंगे।”</p><p>“अमर क्रांतिकारी चंद्रशेखर आजाद का जीवन बताता है कि अन्याय के खिलाफ अडिग रहने का संकल्प ही सच्चा पराक्रम है। मातृभूमि के लिए उनके बलिदान की गाथा देश की हर पीढ़ी को प्रेरित करती रहेगी।</p><p>न हि शौर्यात्परं किञ्चित् त्रिषु लोकेषु विद्यते।</p><p>शूरः सर्वं पालयति सर्वं शूरे प्रतिष्ठितम् ।।”</p><p>\"There is no element more transcendent than bravery in the three worlds. Valor is the fundamental force that nourishes and protects the animate and inanimate world. All worldly dignity, prosperity and duty exist solely in the valor of the valiant.\"</p><p>भारत माता के वीर सपूत चंद्रशेखर आजाद के बलिदान दिवस पर उन्हें मेरी आदरपूर्ण श्रद्धांजलि। उन्होंने मां भारती को गुलामी की बेड़ियों से आजाद कराने के लिए अपना सर्वस्व न्योछावर कर दिया, जिसके लिए वे सदैव स्मरणीय रहेंगे।</p><p>अमर क्रांतिकारी चंद्रशेखर आजाद का जीवन बताता है कि अन्याय के खिलाफ अडिग रहने का संकल्प ही सच्चा पराक्रम है। मातृभूमि के लिए उनके बलिदान की गाथा देश की हर पीढ़ी को प्रेरित करती रहेगी। न हि शौर्यात्परं किञ्चित् त्रिषु लोकेषु विद्यते।शूरः सर्वं पालयति सर्वं शूरे प्रतिष्ठितम् ।। pic.twitter.com/h6fZZfRWKa</p><p>Read this release in: Urdu , हिन्दी , Gujarati</p>",
    "category": "General",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233363&reg=3&lang=1"
  },
  {
    "headline": "PM-SETU Gains Momentum as MSDE Hosts Industry Leadership Conclave in Bhopal",
    "summaryText": "<p>Ministry of Skill Development and Entrepreneurship</p><p>PM-SETU Gains Momentum as MSDE Hosts Industry Leadership Conclave in Bhopal</p><p>In a decisive step toward deepening industry participation in India’s skilling architecture, the Ministry of Skill Development and Entrepreneurship (MSDE) convened a high-level Industry Leadership Conclave on PM-SETU (Pradhan Mantri Skilling and Employability Transformation through Upgraded ITIs) in Bhopal on 25–26 February 2026. The two-day strategic consultation marks a critical milestone in embedding industry-led governance within the Industrial Training Institute (ITI) ecosystem and accelerating reforms aimed at making India’s training infrastructure globally competitive and demand-driven.</p><p>The Conclave was chaired virtually by Ms. Debashree Mukherjee, Secretary, MSDE, and witnessed the participation of the Director General, Directorate General of Training (DGT), the Principal Secretary (Skill Development), Government of Madhya Pradesh, and senior officials from the Governments of Madhya Pradesh, Odisha, Chhattisgarh, Rajasthan, and Gujarat.</p><p>Speaking on the occasion, Ms. Debashree Mukherjee, Secretary, MSDE, underscored that PM-SETU represents a structural reform that goes beyond incremental upgrades. She emphasized that the scheme places industry at the centre of governance by empowering partners to take leadership in designing, managing, and delivering training across adopted ITI clusters. The reform, she noted, seeks to align skilling outcomes with real-time industrial demand, ensuring that graduates are employment-ready and future-ready.</p><p>More than 20 leading industry players participated in the Conclave, including ArcelorMittal, BHEL, CREDAI, ITC Limited, Mahanadi Coalfields Limited, Motherson Group, Tata Power Skill Development Institute, and UltraTech Cement, among others.</p><p>Industry leaders described PM-SETU as a timely and transformative reform that provides employers the flexibility to co-create curricula, deploy modern equipment, restructure institutional clusters, and embed global best practices in training delivery. They viewed the initiative as a significant opportunity to build a steady, high-quality talent pipeline while addressing persistent skill shortages across core sectors such as manufacturing, construction, energy, infrastructure, and advanced technologies.</p><p>The consultation served as a pivotal platform to translate the Prime Minister’s vision of a future-ready, globally competitive, and industry-integrated skilling ecosystem into actionable partnerships. Deliberations focused on governance frameworks, cluster restructuring, funding models, industry incentives, and mechanisms for outcome-based accountability.</p><p>The scheme is currently in the preparatory and phased rollout stage. The National Steering Committee has been constituted and guidelines approved. So far, 33 States and Union Territories have identified ITI clusters for upgradation, 31 have formed State Steering Committees, and 14 have floated Expressions of Interest or Requests for Proposal to select Industry Partners.</p><p>Parallel efforts are underway to internationalize India’s technical training ecosystem through strategic collaborations for National Centres of Excellence. A Letter of Intent has been signed with France for establishing a Centre of Excellence in Aeronautics at NSTI Kanpur. A Joint Declaration of Intent has been concluded with Germany for collaboration in the renewable energy sector at NSTI Hyderabad. Additionally, an MoU has been signed with Singapore for setting up a National Centre of Excellence in Advanced Manufacturing at NSTI Chennai. These partnerships aim to bring global standards, advanced technologies, and cross-border expertise into India’s skill development landscape.</p><p>Institutional capacity building has also commenced in parallel. As part of leadership strengthening initiatives, 100 ITI Principals from 27 States and Union Territories have already undergone specialized leadership training to enhance institutional governance, industry engagement, and operational readiness under the PM-SETU framework.</p><p>The Bhopal Conclave signals strong industry confidence in PM-SETU and reinforces MSDE’s commitment to transforming ITIs into globally competitive, industry-integrated institutions that power India’s growth and employability agenda.</p>",
    "category": "Environment",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001X4ME.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0028FK2.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003NAMF.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004AER7.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005P7T0.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233606&reg=3&lang=1"
  },
  {
    "headline": "Women in Science are Catalysts of \"Viksit Bharat\": Dr. Jitendra Singh at National Science Day Celebration 2026",
    "summaryText": "<p>Ministry of Science & Technology</p><p>Women in Science are Catalysts of \"Viksit Bharat\": Dr. Jitendra Singh at National Science Day Celebration 2026 Empowering young students, particularly girls, through structured exposure to laboratories and research institutions will create a multiplier effect in the years ahead: says Dr. Jitendra SinghANRF–Venture Centre Outreach Initiative Launched, a special boon for young aspirants; Hydrogen Valley Innovation Cluster launchedMission Innovation India Report and Indigenous Architecture Book ReleasedDST-Supported Nano Titania Technology Transferred for Heritage ConservationIndia’s scientific advancement must be measured not only by global rankings but by its capacity to deliver solutions for its people: Union Minister</p><p>Union Minister of State (Independent Charge) for Science & Technology, Earth Sciences, MoS PMO, Personnel, Public Grievances, Pensions, Atomic Energy and Space, Dr. Jitendra Singh, today said that women in science are not merely participants but powerful \"catalysts\" in India’s journey towards Viksit Bharat. Addressing the National Science Day Celebration–2026 at the INSA Auditorium, New Delhi, the Minister underlined that scientific growth and national development are inseparable, and that inclusive participation especially of women is essential to sustaining India’s innovation momentum.</p><p>Speaking on the focal theme “Women in Science: Catalyzing Viksit Bharat,” Dr. Jitendra Singh emphasized that India’s scientific ecosystem must nurture talent across gender and geography. He highlighted the growing representation of women in research, leadership positions and innovation-driven sectors, noting that the transformation of India’s science landscape requires both policy support and institutional commitment.</p><p>Dr. Jitendra Singh further observed that India’s science policy framework has increasingly focused on enabling ecosystems rather than isolated achievements. He stressed that sustained institutional support, early-stage mentoring, and translational pathways are critical to ensuring that research outcomes convert into tangible societal impact. He noted that initiatives announced during the celebration reflect a continuum from student engagement to innovation clusters—designed to strengthen India’s long-term scientific capacity.</p><p>The Minister also underlined that science communication and public engagement are central to building a scientific temperament. He said that empowering young students, particularly girls, through structured exposure to laboratories and research institutions will create a multiplier effect in the years ahead. He emphasized that India’s demographic dividend must be aligned with its scientific aspirations to achieve the goals of Viksit Bharat.</p><p>During the programme, several key initiatives were launched and released. These included the Hydrogen Valley Innovation Cluster and the ANRF-Venture Centre Outreach Initiative. The Mission Innovation India Report was also released, along with the book Indigenous Architecture of Northeast India. A DST-supported technology on copper-doped nano titania coating for heritage stones was formally transferred to M/s Rebuild Technologies Services Pvt. Ltd., marking a significant step towards translating laboratory research into societal applications.</p><p>The Copper-Doped Nano Titania (Cu–TiO₂) coating technology represents an advanced scientific solution for the preservation of heritage stone monuments. The technology, developed through nano-titania and Cu-doped nano-titania coatings embedded in a Paraloid B-72 matrix, has demonstrated enhanced hydrophobicity, UV resistance and aesthetic compatibility for marble, sandstone and granite surfaces. The Cu-doped formulation retained high hydrophobic performance even after prolonged UV exposure, underscoring its durability and suitability for long-term conservation of heritage structures.</p><p>Another significant announcement was the launch of the “Engage with Science” Programme, conceptualized by the National Council for Science & Technology Communication (NCSTC), DST. The programme aims to provide immersive, one-week residential exposure to students of Classes 8 and 9 across 16 autonomous DST institutions, encouraging early interest in research and development. The initiative spans seven thematic areas including Materials Science, Biological Sciences, Astronomy, Medical Technology, Indigenous Knowledge Systems and Earth Sciences, thereby fostering scientific curiosity among young learners and nurturing future scientific ambassadors.</p><p>In his welcome address, Prof. Abhay Karandikar, Secretary, Department of Science and Technology, highlighted DST’s continued efforts to build a robust and inclusive research ecosystem. He emphasized the importance of strengthening innovation clusters, promoting translational research, and ensuring that scientific outcomes are effectively aligned with national priorities. He underscored that initiatives such as the Hydrogen Valley Innovation Cluster and the ANRF outreach efforts are designed to deepen industry-academia collaboration and accelerate research-to-market pathways.</p><p>Dr. Rajesh Gokhale, Secretary, Department of Biotechnology, stressed the need to integrate biological sciences and biotechnology innovations with national development missions. He spoke about strengthening institutional linkages, promoting interdisciplinary research, and leveraging innovation ecosystems to ensure that biotechnology solutions contribute meaningfully to healthcare, agriculture and sustainable development goals.</p><p>Further, Dr. Jitendra Singh, reiterated that India’s scientific advancement must be measured not only by global rankings but by its capacity to deliver solutions for its people. He emphasized that initiatives such as hydrogen innovation clusters, outreach programmes and technology transfers represent a shift towards mission-driven science with societal relevance. He called upon scientific institutions to maintain momentum, deepen collaboration and ensure that the spirit of National Science Day translates into year-round action.</p><p>Concluding the programme, the Minister stated that National Science Day is not merely a commemorative event but a reaffirmation of India’s scientific resolve. He emphasized that the initiatives launched reflect the Government’s commitment to empowering women scientists, strengthening indigenous innovation, preserving cultural heritage through science, and nurturing the next generation of researchers in alignment with the vision of Viksit Bharat.</p>",
    "category": "Environment",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001GW6O.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002QND5.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003TXXE.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004UKNI.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233586&reg=3&lang=1"
  },
  {
    "headline": "Secretary (Defence Production) holds key meetings with senior Italian defence officials in Rome",
    "summaryText": "<p>Secretary (Defence Production) holds key meetings with senior Italian defence officials in Rome India & Italy reaffirm shared commitment to facilitate industry partnerships to build resilient defence supply chainsShri Sanjeev Kumar highlights policy frameworks for defence procurements, FDI norms & India’s defence corridors at India-Italy Defence Industry Seminar</p><p>Secretary (Defence Production) Shri Sanjeev Kumar called on Italy’s Under Secretary of State for Defence Mr Matteo Perego di Cremnago and held meetings with National Armaments Director Admiral Giacinto Ottaviani and Chief of Italian Defence Forces General Luciano Portolano during his visit to Rome on February 26 & 27, 2026. During the meeting with Italy’s Under Secretary of State for Defence, both nations reaffirmed their shared commitment to facilitate industry partnerships to build respective resilient defence supply chains.</p><p>During the meetings with the National Armaments Director and the Chief of Italian Defence Forces, the two sides identified defence cooperation as a key pillar of the bilateral strategic partnership and concurred on the importance of augmenting industrial cooperation by building synergies and linkages between the defence industrial ecosystems.</p><p>The Secretary (Defence Production) and the National Armaments Director also delivered keynote addresses at the India-Italy Defence Industry Seminar, which provided a forward-looking agenda for partnership. Shri Sanjeev Kumar highlighted the policy frameworks for defence procurements, FDI norms and the defence industrial corridors in India.</p><p>Both sides noted that the India-EU Security and Defence Partnership signed in January 2026 provides new avenues for participation of Indian defence companies in the defence supply chains of the EU.</p><p>Indian and Italian defence industries had focused B2B meetings to explore joint ventures, technology partnerships and co-manufacturing initiatives. The industry seminar also strengthened institutional cooperation between SIDM and AIAD, building on their MoU signed in April 2025 in Rome.</p><p>A networking reception, hosted by the Embassy provided an opportunity for continuing the dialogue among government officials, industry leaders and stakeholders. The Secretary (Defence Production) was accompanied by an industry delegation under the aegis of the Society of Indian Defence Manufacturers, which included key stakeholders from the Indian Defence Public Sector Undertakings, private sector, SMEs, and start-ups.</p><p>The delegation also visited leading Italian defence companies as part of the visit. The discussions focused on opportunities for joint ventures, co-development and co-production leveraging the synergies between the respective defence ecosystems.</p><p>The visit reflects the deepening of India and Italy defence cooperation and India’s commitment to build trusted partnerships in defence manufacturing, in line with the vision of Aatmanirbhar Bharat.</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001TJ82.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002YLBU.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003TLAR.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004H75M.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005RTGE.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image006IYPJ.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233581&reg=3&lang=1"
  },
  {
    "headline": "Monthly review of accounts of Government of India upto January 2026 (FY 2025-26)",
    "summaryText": "<p>Monthly review of accounts of Government of India upto January 2026 (FY 2025-26)</p><p>The Monthly accounts of the Government of India upto January, 2026 has been consolidated and reports published. The highlights are given below: -</p><p>The Government of India has received ₹27,08,654 crore (79.5% of corresponding RE 2025-26 of Total Receipts) upto January, 2026 comprising ₹20,94,218 crore of Tax Revenue (Net to Centre), ₹5,57,307 crore of Non-Tax Revenue and ₹57,129 crore of Non-Debt Capital Receipts. ₹11,39,767 crore has been transferred to State Governments as Devolution of Share of Taxes by Government of India during this period which is ₹65,588 crore higher than the previous year.</p><p>Total Expenditure incurred by Government of India is ₹36,90,061 crore (74.3% of corresponding RE 2025-26), out of which ₹28,47,780 crore is on Revenue Account and ₹8,42,281 crore is on Capital Account. Out of the Total Revenue Expenditure, ₹9,88,302 crore is on account of Interest Payments and ₹3,54,861 crore is on account of Major Subsidies.</p>",
    "category": "Economy",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233567&reg=3&lang=1"
  },
  {
    "headline": "Goa Stands United in Massive Youth Rally Against Drug Abuse; Over 3,000 Youth Pledge Support to Nasha Mukt Bharat Abhiyaan in the Presence of Dr. Pramod Sawant, Dr. Virendra Kumar and Shri Subhash Phal Desai",
    "summaryText": "<p>Ministry of Social Justice & Empowerment</p><p>Goa Stands United in Massive Youth Rally Against Drug Abuse; Over 3,000 Youth Pledge Support to Nasha Mukt Bharat Abhiyaan in the Presence of Dr. Pramod Sawant, Dr. Virendra Kumar and Shri Subhash Phal Desai</p><p>In a resounding show of unity and determination, more than 3,000 citizens—primarily youth—gathered at the Dr. Shyama Prasad Mukherjee Stadium, Goa University, Bambolim, today for a landmark event under the Nasha Mukt Bharat Abhiyaan (NMBA). Organized by the Department of Social Justice and Empowerment, Government of India, in collaboration with the Government of Goa, the rally marked a significant milestone in the campaign's sixth year and became one of the largest anti-drug mobilizations in Goa's history.</p><p>Thousands more participated virtually through online platforms, amplifying the call for a drug-free India and reinforcing the movement as a true people's campaign (Jan Andolan).</p><p>The event was graced by prominent dignitaries, including:</p><p>Hon’ble Chief Minister of Goa, Dr. Pramod Sawant</p><p>Hon’ble Union Minister for Social Justice and Empowerment, Dr. Virendra Kumar</p><p>Hon’ble Minister for Social Welfare, Government of Goa, Shri Subhash Phal Desai along with senior officials, VVIPs, and community leaders.</p><p>In his address, Chief Minister Dr. Pramod Sawant emphasized Goa's commitment to realizing the Prime Minister's vision of Viksit Bharat @2047 ahead of schedule—aiming for a fully developed Viksit Goa by 2037. He declared that achieving a Nasha Mukt Goa (drug-free Goa) is a core priority in this roadmap and reaffirmed his resolve to unite all stakeholders—including youth, spiritual organizations, NGOs, and community partners—in this collective effort.</p><p>Union Minister Dr. Virendra Kumar praised the transformation of NMBA into a nationwide movement driven by citizens, youth, women, educational institutions, and spiritual organizations. He reiterated the Government's firm dedication to eradicating substance abuse and fostering a healthier, more empowered India.</p><p>Key Highlights of the Event:</p><p>A vibrant youth rally symbolizing collective resolve against drug abuse.</p><p>Mass pledge-taking ceremony (both in-person and online), with participants committing to reject substance use and spread awareness.</p><p>Inspiring cultural performances by students, artists, and youth groups showcasing the vitality of a drug-free society.</p><p>Felicitation of dedicated volunteers, NGOs, partners, and active contributors to the campaign.</p><p>Sharing of NMBA success stories and achievements to motivate continued action.</p><p>Informative stalls by Spiritual organizations, the National Institute of Social Defence, AYUSH, Alcoholic Anonymous (AA), Social Welfare Department, Dept of Health etc. offering resources and guidance.</p><p>The rally saw enthusiastic involvement from school and college students, NCC cadets, NSS volunteers, My Bharat participants, youth club members, spiritual organization representatives, line departments, NGOs, police personnel, civil society groups, and the general public.</p><p>About Nasha Mukt Bharat Abhiyaan Launched on August 15, 2020, by the Department of Social Justice and Empowerment, NMBA initially targeted 272 highly vulnerable districts and has since expanded to cover every district nationwide. The campaign emphasizes mass awareness, with focused outreach in higher educational institutions, university campuses, schools, and communities.</p><p>Major National Achievements (as reported):</p><p>Over 25.94 crore people sensitized on substance abuse issues.</p><p>More than 9.36 crore youth engaged through targeted programs.</p><p>Over 6.38 crore women reached with awareness initiatives.</p><p>Involvement of more than 16.16 lakh educational institutions for widespread impact on children and youth.</p><p>Strategic partnerships with eight leading spiritual organizations—including The Art of Living, Brahma Kumaris, Sant Nirankari Mission, ISKCON, Shri Ram Chandra Mission, All World Gayatri Pariwar, Sivananda Yoga Vedanta Dhanwantari Ashram, and University of Patanjali—have strengthened grassroots efforts. Digital engagement continues via official social media channels (X, Facebook, Instagram) and the dedicated NMBA website, featuring dashboards, e-pledge options, forums, and resources.</p><p>Recent national highlights include the 5th Anniversary celebration in Delhi (August 2025) and a grand event at Guru Nanak Dev University, Amritsar (November 2025), which drew massive participation.</p><p>Today's Goa event underscored NMBA's growing momentum, mobilized community action, inspired youth leadership, and strengthened the national resolve for a Nasha Mukt Bharat.</p><p>The Department of Social Justice and Empowerment and the Government of Goa extend sincere gratitude to all participants, partners, and supporters. They invite every citizen—especially the youth—to join the movement by taking the online pledge at the NMBA website, raising awareness, and actively contributing to a healthier, addiction-free society.</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001W47K.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0025HFF.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003F2AH.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004JKHX.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005IK5H.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image006WKSX.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image007NCBW.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image008YYLO.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image009PJR8.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233560&reg=3&lang=1"
  },
  {
    "headline": "6th India–UK Home Affairs Dialogue Held In New Delhi",
    "summaryText": "<p>6th India–UK Home Affairs Dialogue Held In New Delhi Both sides assessed the ongoing cooperation and identified further areas of mutual interests and synergies for proactive cooperation in counter terrorism and organised crimes</p><p>The 6th India-UK Home Affairs Dialogue (HAD) was held in New Delhi today. The Indian delegation was led by Secretary (Border Management), Dr. Rajendra Kumar and the UK delegation was led by Second Permanent Secretary, Home Office, Mr. Simon Ridley. The meeting was also attended by other senior officials of both countries.</p><p>During the meeting both sides assessed the ongoing cooperation and identified further areas of mutual interests and synergies for proactive cooperation in counter terrorism and organised crimes including Pro-Khalistani Extremists and the activities of anti-India groups in UK, drug trafficking, migration, criminal justice and law enforcement cooperation, cyber security, among other issues. India’s concerns over the breach of security of Indian dignitaries and Diplomatic missions in UK were also emphasized.</p><p>The meeting concluded with mutual satisfaction of both sides on the existing level of cooperation and agreement to strengthen the bilateral engagement by maintaining the momentum for enhanced security cooperation between the two countries.</p><p>Read this release in: हिन्दी</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001AHQA.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002JO1F.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0039R26.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0040ZHJ.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005HMAP.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233556&reg=3&lang=1"
  },
  {
    "headline": "PM to visit Tamil Nadu and Puducherry on 1st March",
    "summaryText": "<p>PM to visit Tamil Nadu and Puducherry on 1st March PM to inaugurate, dedicate to the Nation and lay the foundation stone of various development projects worth over Rs. 2,700 crore in PuducherryProjects aimed at strengthening infrastructure, urban services, industrial development, education, healthcare and sustainable growth in PuducherryPM to inaugurate, dedicate to nation and lay the foundation stone and inaugurate infrastructure projects worth over Rs. 4,400 crore in MaduraiPM to lay the foundation stone for four-laning of Marakkanam–Puducherry Section of NH-332A and the Paramakudi–Ramanathapuram Section of NH-87PM to inaugurate 8 redeveloped railway stations in Tamil Nadu and dedicate to the nation Chennai Beach–Chennai Egmore 4th Line PM to perform darshan and pooja at Arulmigu Subramaniyaswamy Temple at Tirupparankundram</p><p>Prime Minister Shri Narendra Modi will visit Tamil Nadu and Puducherry on 1st March 2026. After his visit to Rajasthan and Gujarat, Prime Minister will reach Chennai on 28th February night at around 9 PM.</p><p>On 1st March, at around 11:45 AM, Prime Minister will inaugurate, dedicate to the Nation and lay the foundation stone of various development projects worth over Rs. 2,700 crore in Puducherry. He will also address the gathering on the occasion.</p><p>Thereafter, he will travel to Madurai where, at around 3 PM, he will inaugurate, dedicate to the nation and lay the foundation stone of infrastructure projects worth over Rs. 4,400 crore. He will also address the gathering on the occasion. At around 4 PM, Prime Minister will perform darshan and pooja at Arulmigu Subramaniyaswamy Temple, Tirupparankundram in Madurai.</p><p>Prime Minister will inaugurate, dedicate to the Nation and lay the foundation stone of multiple projects aimed at strengthening infrastructure, urban services, industrial development, education, healthcare and sustainable growth in Puducherry.</p><p>Prime Minister will inaugurate several key initiatives including the launch of e-Buses under the PM e-Bus Seva Initiative, the Integrated Command and Control Centre under the Smart City Mission, tenements for Economically Weaker Sections under City Investments to Innovate, Integrate and Sustain (CITIIS) initiative, and important sewerage and water supply sector projects of the Government of Puducherry. He will also inaugurate the Composite Engineering Block- Dr. APJ Abdul Kalam Block and Ganga Hostel of National Institute of Technology, Karaikal; the modernization of the Regional Cancer Centre at JIPMER; and new annexe buildings, lecture halls and hostels of Pondicherry University, further strengthening higher education and healthcare infrastructure in the region.</p><p>Prime Minister will dedicate to the nation the 750-acre Karasur-Sedarapet Industrial Estate, which will house a Pharma Park, Textile Park, IT Park, state-of-the-art research and development centre of IIT Madras and advanced healthcare facilities of JIPMER, thereby providing a major boost to industrial growth and employment generation in the region.</p><p>Prime Minister will lay the foundation stone of water supply projects to improve drinking water systems and ensure clean and safe water for residents of Puducherry region. He will also lay the foundation stone for construction of 41 rural roads under the Pradhan Mantri Gram Sadak Yojana (PMGSY), development of Heritage Town in Puducherry, mangrove restoration under the MISHTI (Mangrove Initiative for Shoreline Habitats & Tangible Incomes) scheme, projects in water supply and sanitation sectors, and power sector projects under the Revamped Distribution Sector Scheme (RDSS), among others.</p><p>Prime Minister will also lay the foundation stone of various projects covering major sectors like urban roads, drainage networks, public buildings, student hostels and sport facilities under the Special Assistance to States for Capital Investment (SASCI) scheme. The Government of India has approved inclusion of the Puducherry under SASCI scheme which was originally limited to States alone, allowing for capital asset creation works to be taken up for improving infrastructure and common utilities meant for people’s use.</p><p>Prime Minister will inaugurate, dedicate to the nation and lay the foundation stone and inaugurate infrastructure projects worth over Rs. 4,400 crore in Madurai, aimed at enhancing connectivity, improving mobility and accelerating regional economic development. He will also address the gathering on the occasion.</p><p>Prime Minister will lay the foundation stone for four-laning of Marakkanam–Puducherry Section of NH-332A and the Paramakudi–Ramanathapuram Section of NH-87. The four-laning of the Marakkanam–Puducherry section will help reduce traffic congestion in urban areas of Puducherry, reduce travel time by nearly 50%, from one hour to about 30 minutes. The project will provide seamless connectivity among key National Highways and State Highways, enhance access to prominent destinations such as Mamallapuram (Mahabalipuram), Kalpakkam Atomic Power Station and Auroville, strengthen connectivity between coastal villages and Viluppuram district headquarters, and boost tourism and economic activity in the region.</p><p>The four-laning of the Paramakudi–Ramanathapuram Section of NH-87 will provide faster access to major religious destinations including Madurai, Rameswaram and Dhanushkodi. The project will reduce travel time by around 40%, from one hour to approximately 35 minutes. It will strengthen multi-modal connectivity by linking major railway stations at Madurai and Rameswaram, airports at Madurai and INS Parundu, and non-major ports at Pamban and Rameswaram. Aligned with the principles of PM Gati Shakti, the corridor will integrate key economic nodes including fishing clusters, a Special Economic Zone, a Mega Food Park and a textile cluster, thereby catalysing trade, industry and socio-economic development across the region.</p><p>Prime Minister will inaugurate and dedicate to the Nation rail infrastructure projects aimed at enhancing passenger convenience, improving operational efficiency and strengthening rail-based connectivity in the State.</p><p>Prime Minister will inaugurate 8 redeveloped railway stations under the Amrit Bharat Station Scheme. These redeveloped railway stations are Morappur, Bommidi, Srivilliputtur, Sholavandan, Manaparai, Pollachi Junction, Karaikkudi Junction, Thiruvarur Junction in Tamil Nadu. These stations have been upgraded with modern passenger-centric amenities while incorporating local architectural elements and cultural aesthetics, including improved accessibility, enhanced station buildings, modern waiting halls, lifts and escalators, upgraded platforms and Divyangjan-friendly facilities.</p><p>Prime Minister will also dedicate to the Nation the Chennai Beach-Chennai Egmore 4th Line, a rail line that will significantly enhance operational efficiency in the Chennai suburban rail network by facilitating additional passenger and freight train services and benefiting lakhs of daily commuters including office-goers, IT professionals, students and traders.</p><p>To further strengthen broadcasting services in Tamil Nadu, Prime Minister will inaugurate three new Akashvani FM relay transmitters at Kumbakonam, Yercaud and Vellore. These transmitters will expand regional coverage, ensure uninterrupted FM broadcasting and enhance access to public broadcasting services across multiple districts of the State.</p><p>Read this release in: Gujarati</p>",
    "category": "Infrastructure",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233548&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister Meets His Holiness Moran Mor Ignatius Aphrem II, Patriarch of Antioch and All The East",
    "summaryText": "<p>Prime Minister Meets His Holiness Moran Mor Ignatius Aphrem II, Patriarch of Antioch and All The East</p><p>The Prime Minister today expressed that he was honored to meet His Holiness Moran Mor Ignatius Aphrem II, The Patriarch of Antioch and All The East, and The Supreme Head of the Universal Syriac Orthodox Church.</p><p>​During the meeting, the Prime Minister and His Holiness engaged in a great discussion covering a wide range of issues.</p><p>The Prime Minister shared on x;</p><p>Was honored to meet His Holiness Moran Mor Ignatius Aphrem II, The Patriarch of Antioch and All The East, and The Supreme Head of the Universal Syriac Orthodox Church.</p><p>We had a great discussion on a wide range of issues.</p><p>Was honored to meet His Holiness Moran Mor Ignatius Aphrem II, The Patriarch of Antioch and All The East, and The Supreme Head of the Universal Syriac Orthodox Church. We had a great discussion on a wide range of issues.@MorAphremII pic.twitter.com/6b4CHA4W6q</p><p>Read this release in: हिन्दी , Gujarati , Kannada , Malayalam</p>",
    "category": "General",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233545&reg=3&lang=1"
  },
  {
    "headline": "Under the leadership of Hon’ble PM Shri Narendra Modi, India and Israel ink historic MoU in the Fisheries and Aquaculture Sector",
    "summaryText": "<p>Ministry of Fisheries, Animal Husbandry & Dairying</p><p>Under the leadership of Hon’ble PM Shri Narendra Modi, India and Israel ink historic MoU in the Fisheries and Aquaculture Sector MoU to significantly boost India’s Blue Economy and coastal livelihoodsMoU paves the way for Indo‑Israel Centres of Excellence for Fisheries and Aquaculture, high-end RAS collaboration, and a Joint Working Group</p><p>During the historic visit of Hon'ble Prime Minister Shri Narendra Modi to Israel, a Memorandum of Understanding (MoU) was signed on Cooperation in the Field of Fisheries and Aquaculture between the Hon'ble Minister, Department of Aquaculture, Ministry of Agriculture and Food Security of Israel, Mr. Avi Dichter, and the Hon'ble External Affairs Minister, Government of India, Dr. S. Jaishankar today on 26th February 2026.</p><p>The MoU aims to strengthen India’s fisheries and aquaculture sector through technology-driven and sustainable practices, while enhancing the Blue Economy and improving the livelihoods of coastal and fishing communities. It also seeks to promote professional collaboration in establishing new Indo–Israel Centres of Excellence (CoEs) for Fisheries and Aquaculture, along with technical cooperation for setting up an oceanarium in India.</p><p>The agreement provides a comprehensive framework for cooperation across mutually identified priority areas. These include collaboration in advanced Recirculating Aquaculture Systems (RAS), water reuse technologies, automation-based farming, and data-driven aquaculture management. The two sides will also work towards developing biosecure and climate-resilient farming models suitable for water-scarce and climate-stressed regions. Cooperation will further focus on strengthening aquatic disease management through novel therapeutics, non-invasive alternatives, and scientific approaches for improving disease resistance.</p><p>The MoU further enhances cooperation in mariculture, including seaweed-based systems, and supports joint efforts in Integrated Multi‑Trophic Aquaculture (IMTA), particularly the use of seaweed as a biofilter and as an alternative feed resource. Both the Countries agreed to promote research and development in fisheries and aquaculture, encourage environmentally friendly fishing practices, and advance technology‑led marine resource conservation, with a focus on long‑term sustainability.</p><p>Capacity building and knowledge exchange will be key pillars of this partnership. The two sides will explore structured exchange programmes, training initiatives, exposure visits, and expert-level interactions for officials, entrepreneurs, and stakeholders. The collaboration will also strengthen linkages between startups, research institutions, and industry, particularly in areas such as water recycling, innovative aquaculture technologies, and product development through incubators and innovation ecosystems.</p><p>A Joint Working Group (JWG) will be constituted to facilitate implementation, review progress, evaluate annual work plans, and consider new areas of cooperation. The JWG will meet annually, either in person or through virtual mode, alternating between India and Israel. Both sides will designate nodal officers to coordinate and monitor activities under the MoU.</p><p>This landmark MoU reflects the shared commitment of India and Israel to deepen cooperation in fisheries and aquaculture, promote innovation, and strengthen sustainable and climate-resilient development in the sector. Both sides also welcomed the earlier Declaration of Intent signed in January 2026 and reaffirmed their resolve to expand collaboration, including through the establishment of Joint Centres of Excellence.</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001T5GL.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233546&reg=3&lang=1"
  },
  {
    "headline": "Military doctors restore eyesight of 374 patients during Mega Surgical Eye Camp at Gorakhpur",
    "summaryText": "<p>Military doctors restore eyesight of 374 patients during Mega Surgical Eye Camp at Gorakhpur</p><p>The first Mega Advanced Surgical Eye Camp in Eastern Uttar Pradesh at 12 Air Force Hospital, Gorakhpur concluded on February 27, 2026, with the highly specialised ophthalmic team of the Indian Army and the Indian Air Force doctors carrying out 374 life-changing surgeries during the four-day camp. The closing ceremony was attended by Air Officer Commanding-in-Chief, Central Air Command Air Marshal B Manikantan. It also comprised high-level inspections by Director General Armed Forces Medical Services Surgeon Vice Admiral Arti Sarin and Director General Medical Services (Air) Air Marshal Sandeep Thareja.</p><p>The camp became a beacon of hope for the entire region, and it also drew patients from Nepal, apart from the interiors of Siddharthnagar, Azamgarh, Deoria, Maharajganj, and the rural heartlands of Gorakhpur. The impact of the mission was witnessed through the eyes of 69-year-old Shri Amarnath Gupta, a resident of Gorakhpur. For years, the joy of seeing his grandchildren’s faces had been stolen by failing sight. Overcome with emotion following his successful surgery, Shri Gupta stands among the hundreds who have been granted a new lease of light.</p><p>This team was led by Head of Ophthalmology at Army Hospital (Research & Referral) Brigadier (Dr) Sanjay Kumar Mishra supported by a surgical vanguard, including Lt Col Ravi Chauhan and Maj Amrita Joshi, whose tireless efforts ensured the camp’s historic success. The team utilised world-class medical equipment, airlifted to the region via the Indian Air Force aircraft, to carry out the surgeries.</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/PIC2(4)H5LI.jpeg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/PIC1(5)MY6M.jpeg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233543&reg=3&lang=1"
  },
  {
    "headline": "INDIAN ARMY'S TENTH CHIEFS’ CONCLAVE COMMENCES IN NEW DELHI",
    "summaryText": "<p>INDIAN ARMY'S TENTH CHIEFS’ CONCLAVE COMMENCES IN NEW DELHI</p><p>The Tenth Chiefs’ Conclave commenced in New Delhi today. The event is being conducted from 27 to 28 February 2026. The Conclave is being attended by former Chiefs of the Army Staff and Honorary Generals of the Indian Army from the Nepali Army.</p><p>The participation of Honorary Generals from Nepal reflects a globally unique and landmark military tradition, symbolising the exceptional and enduring India-Nepal military relationship based on mutual trust, shared values and a common martial heritage. This distinctive arrangement resonates with India's civilisational ethos of \"Vishwabandhu\" and principle of “Neighbourhood First”, underscoring India's commitment to strong, people-centric ties with its immediate neighbours.</p><p>The Conclave provides an important institutional platform for professional interaction between the present hierarchy and former Chiefs, reinforcing continuity and collective wisdom across generations.</p><p>The programme commenced with a wreath laying ceremony at the National War Memorial, followed by interactions on key issues relating to operational preparedness, capability development and contemporary security challenges. The former Chiefs will also visit select Army establishments and cultural landmarks as part of the scheduled engagements.</p><p>The Chiefs' Conclave reaffirms the Indian Army's commitment to preserving institutional memory, strengthening professional dialogue and reinforcing the enduring spirit.</p><p>Read this release in: Urdu , हिन्दी</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/3A(1)SNC5.jpeg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/6TLD6.jpeg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233533&reg=3&lang=1"
  },
  {
    "headline": "ASIC Will Empower Young Innovators to Translate Classical Knowledge into Contemporary Healthcare Solutions: Shri Prataprao Jadhav",
    "summaryText": "<p>ASIC Will Empower Young Innovators to Translate Classical Knowledge into Contemporary Healthcare Solutions: Shri Prataprao Jadhav ASIC Reflects Our Strategic Priority of Building a Robust Startup Ecosystem within the Ayush Sector: Secretary AyushNational Call for Expression of Interest Invites Ayurveda Startups under CCRAS–CARI, Bengaluru</p><p>The Central Council for Research in Ayurvedic Sciences (CCRAS), Ministry of Ayush, Government of India, has announced a national Call for Expression of Interest (EoI) for startups under the Ayurvedic Sciences Incubation Centre (ASIC) at its Central Ayurveda Research Institute (CARI), Bengaluru. Established under the Ministry’s flagship scheme “Startup Incubation through Ayush Institutions,” ASIC aims to nurture cutting-edge entrepreneurial ventures in Ayurveda through structured mentorship, funding support, and regulatory facilitation.</p><p>ASIC is envisioned as a catalyst for innovation-driven growth in the Ayush sector, offering a vibrant ecosystem that connects entrepreneurs with researchers, investors, industry leaders, and policymakers. The initiative seeks to promote research-based product development, commercialisation of novel Ayurvedic solutions, and industry–academia collaboration to position India as a global leader in evidence-based traditional medicine.</p><p>Shri Prataprao Jadhav, Union Minister of State (Independent Charge), Ministry of Ayush and Union Minister of State, Ministry of Health & Family Welfare, Government of India, Highlighted, “Under the visionary leadership of Hon’ble Prime Minister Shri Narendra Modi, the Ministry of Ayush is committed to fostering innovation and entrepreneurship in traditional medicine. The Ayurvedic Sciences Incubation Centre at CARI, Bengaluru, will empower young innovators to translate classical knowledge into contemporary healthcare solutions, strengthening India’s emergence as a global hub for integrative healthcare.”</p><p>Vaidya Rajesh Kotecha, Secretary, Ministry of Ayush, remarked, “ASIC reflects the focus of the Government of India on building a robust startup ecosystem within the Ayush sector. By providing scientific mentorship, financial guidance, and regulatory support, we aim to accelerate the development of high-quality, research-backed Ayurveda products and services that meet global standards.”</p><p>Prof. Rabinarayan Acharya, Director General, CCRAS, Emphasised, “With CARI, Bengaluru’s strong foundation in clinical research, drug standardisation, and medicinal plant studies, ASIC will serve as a launchpad for transformative ideas in Ayurveda. We invite aspiring entrepreneurs to leverage this opportunity and contribute to building a sustainable and innovation-led Ayurveda industry.”</p><p>Dr. Sulochana Bhat, Head, Central Ayurveda Research Institute (CARI), Bengaluru, noted, “With our strong research foundation and accredited facilities, CARI is committed to mentoring startups in developing scientifically validated and globally competitive Ayurvedic solutions. ASIC will serve as a vital platform to transform innovative ideas into impactful healthcare solutions.”</p><p>CARI, Bengaluru— a peripheral institute of CCRAS— is recognised as a Centre of Excellence in Madhumeha (Diabetes), houses NABH- and NABL-accredited facilities, functions as a Peripheral Pharmacovigilance Centre, and is certified under IS/ISO 9001:2015 standards, reinforcing its credibility as a premier research and incubation hub.</p><p>Through initiatives such as ASIC, the Ministry of Ayush continues to advance its commitment to innovation, research excellence, and entrepreneurship, ensuring that Ayurveda evolves as a dynamic driver of preventive, promotive, and sustainable healthcare for the nation and the world.</p><p>How to Apply: Interested applicants can complete the incubation application through a simple three-step process. First, register on the portal using basic details and an official email ID for faster verification. Next, log in to the dashboard, verify your email, and complete your profile by providing details about your team, product idea, and stage of development. Finally, fill in the incubation application form with information on the problem statement, proposed solution, and required documents. Applicants may save and submit a draft before final submission.</p><p>The last date for submission of applications is 25 March 2026, and interested innovators can apply online at: https://ASIC.ccras.org.in</p><p>Read this release in: Urdu</p>",
    "category": "Environment",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001J1ST.gif",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002XUMR.gif"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233531&reg=3&lang=1"
  },
  {
    "headline": "Union Minister Dr. Mansukh Mandaviya Inaugurates Fifth Regional Conference on Labour Codes in New Delhi",
    "summaryText": "<p>Ministry of Labour & Employment</p><p>Union Minister Dr. Mansukh Mandaviya Inaugurates Fifth Regional Conference on Labour Codes in New Delhi Centre and States Must Work as Equal Partners for Effective Implementation of Labour Codes: Dr. MandaviyaIndia’s Labour Reforms Received Global Recognition from ILO, ISSA and Leading International Publications, says Dr. Mandaviya</p><p>The Ministry of Labour & Employment commenced the fifth Two-day Regional Conference with States/UTs on Labour Codes and other aspects at the Employees’ Provident Fund Organisation (EPFO) Headquarters in New Delhi today. Dr. Mansukh Mandaviya, Union Minister for Labour & Employment and Youth Affairs & Sports, inaugurated the conference and delivered the keynote address at the event.</p><p>Ms. Vandana Gurnani, Secretary, Ministry of Labour & Employment, Senior Officers of the Ministry, representatives of the participating States/UTs including Assam, Arunachal Pradesh, Meghalaya, Manipur, Mizoram, Tripura, Sikkim, Nagaland, Uttarakhand and Delhi, along with senior officials of EPFO, Employees’ State Insurance Corporation (ESIC), VV Giri National Labour Institute (VVGNLI) were also present on the occasion.</p><p>Union Minister, Dr. Mansukh Mandaviya in his inaugural address, emphasised that in India’s federal framework, the Centre and States are equal partners and must work together in advancing labour reforms. He stated that a need had long been felt for comprehensive reforms in the country’s labour landscape to align it with the aspirations of a rapidly transforming economy. The four Labour Codes were enacted in 2019 and 2020 with the objective of aligning India’s labour ecosystem with international best practices, global benchmarks and the guidelines of organisations such as the International Labour Organisation (ILO), he said. The Minister noted that following the Codes being brought into effect on 21st November 2025, they have been welcomed by both workers and industry alike. He further added that India’s reform efforts have received recognition from key international organisations such as the ILO and International Social Security Association (ISSA), and have also been lauded by leading global publications including The Economist and The Financial Times, which acknowledged the Codes’ provisions for strengthening security for workers and building a modern workforce with safer, more permanent employment.</p><p>Highlighting the significance of the Regional Conference as a platform for synergy between the Centre and States/UTs, the Minister said it enables convergence of views and sharing of best practices for effective implementation of the Codes. He urged States to seek handholding support from the Centre wherever required, particularly in building robust IT infrastructure, and called upon them to provide inputs for strengthening the e-Shram portal to optimise delivery of benefits to unorganised workers across the country. He further underlined the importance of Pradhan Mantri Viksit Bharat Yojana (PMVBY) as an initiative to empower both small enterprises as well as employees, and encouraged the Central Labour Commissioners structure and state labour department to work closely for coordinated implementation.</p><p>Dr. Mandaviya also highlighted the tremendous potential of the North-Eastern States in driving industrial growth, expanding manufacturing and encouraging employment generation, in line with Prime Minister Narendra Modi's vision of \"Act East\". Expressing confidence that the two-day deliberations would further strengthen Centre–State collaboration, he conveyed his best wishes for the success of the Conference and reiterated the Government’s commitment to inclusive growth, enhanced worker welfare and ease of doing business.</p><p>In her remarks, Ms. Vandana Gurnani, Secretary, Ministry of Labour & Employment, welcomed the ten participating States and Union Territories, and gave a comprehensive overview of the framework and key objectives of the two-day Conference. Describing 21st November as a historic milestone in the journey of labour reforms, she noted that deliberations in the five previous Regional Conferences had been extremely productive. Emphasising that the Labour Codes aim to strike a balanced approach between strengthening workers’ welfare and reducing the cost of compliance for businesses, she highlighted key provisions of the Codes such as universalisation of minimum wages and of social security, mandatory issuance of appointment letters, and annual health check-ups for workers. In alignment with the changing world of work and contemporary realities, the Codes bring about greater flexibility and predictability for industries, she added.</p><p>The Secretary urged the participating States to actively evaluate and finalise the Rules under the four Labour Codes. She informed that a comprehensive Compliance Handbook has been compiled and released to provide clarity on compliance requirements and related provisions in simple language for better understanding by industries, alongside an exhaustive list of FAQs for the reference of all stakeholders. Stressing the importance of technology for effective implementation of the Codes, she highlighted that a robust IT system is being put in place at the Central level and will be offered to the States to facilitate seamless and transparent governance for workers and industries.</p><p>Ms. Gurnani called upon the States and UTs to participate in the discussions in a spirit of mutual learning, concluding her address with an emphasis that the Government emerge as a model employer, particularly with regard to contract workers under its domain.</p><p>The inaugural session was followed by detailed presentations by senior officers of the Ministry and the States/UTs outlining the progress made in finalizing Rules under the Labour Codes as well as the status of IT preparedness. The conference served as an important platform for deliberating on Rules and Regulations, identifying gaps and areas of divergence, expediting statutory notifications, and discussing the establishment of Boards, Funds, and other institutional mechanisms envisaged under the Codes. It also provided an opportunity for consultations on schemes proposed under the four Labour Codes, alongside focused discussions on digital platforms necessary to ensure their effective execution. Further, the conference emphasized the need for capacity building of field-level functionaries and enhancing awareness among States/UTs and other stakeholders regarding the objectives, structure, and implementation roadmap of the Labour Codes.</p><p>Chaired the 5th Regional Conference of Labour & Employment and Industry Secretaries of States/UTs today.By viewing industry and workers as equal stakeholders and enhancing Centre–State synergy, we are advancing reforms that make Bharat more competitive, worker-centric, and… pic.twitter.com/t1n3MaiELT</p><p>Rini Choudhury/Anjelina Alexander</p><p>Read this release in: Gujarati</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001QOWG.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image00243QR.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003NC5R.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004T02N.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233532&reg=3&lang=1"
  },
  {
    "headline": "TRAI releases Consultation Paper on \"Review of the Rating of Properties for Digital Connectivity Regulations, 2024 (7 of 2024)”",
    "summaryText": "<p>Ministry of Communications</p><p>TRAI releases Consultation Paper on \"Review of the Rating of Properties for Digital Connectivity Regulations, 2024 (7 of 2024)”</p><p>The Telecom Regulatory Authority of India (TRAI) has released a Consultation Paper on ‘Review of Rating of Properties for Digital Connectivity Regulations, 2024 (7 of 2024)’ today.</p><p>Digital connectivity has become a critical enabler of modern living and economic activity. Over the last decade, rapid digitalisation has transformed governance, education, healthcare, commerce, innovation, and social interaction. Studies and industry reports indicate that a significant proportion of data consumption occurs inside buildings. This trend is particularly pronounced with the deployment of advanced mobile technologies such as 4G and 5G, which operate on higher frequency bands to deliver high data rates but are more susceptible to signal attenuation due to walls, building materials, and construction design. As a result, in-building digital connectivity has become a critical determinant of User Experience and Quality of Service (QoS).</p><p>Telecom Regulatory Authority of India lay down the standards of Quality of Service to be provided by the service providers and ensure the quality of service and conduct the periodical survey of such service provided by the service providers so as to protect the interest of the consumers of telecommunication services.</p><p>To address these challenges of quality of service inside buildings or properties in a structured manner, TRAI had notified the 'Rating of Properties for Digital Connectivity Regulations, 2024 (07 of 2024)’ on 25th October 2024, for rating of properties based on their digital connectivity readiness. The framework aims to promote collaboration among Property Managers, Digital Connectivity Rating Agencies (DCRAs), Service providers, and other stakeholders, while ensuring transparency, accountability, and self-sustainability.</p><p>To operationalize the Regulations, TRAI further issued the Rating Manual on 13th August 2025. The rating manual provides the operational backbone of the Digital Connectivity Rating framework, laying down the roles and responsibilities of stakeholders, rating methodology and assessment stages, criteria and sub-criteria for rating including their scoring approach, and detailed procedures for application, evaluation, certification, renewal, and appeals.</p><p>TRAI has also conducted multiple awareness and presentation sessions for various stakeholders. Based on stakeholder inputs received during awareness and presentation sessions for early implementation of the Digital Connectivity Rating framework, it has been observed that while the Regulations provide a sound and comprehensive framework, however, few areas required review to provide additional clarity and refinement. These refinements are aimed at improving transparency for consumers, addressing practical issues faced by Property Managers and DCRAs during implementation, and ensuring that the framework remains aligned with on-ground realities, without altering its core intent, principles, or assessment methodology.</p><p>It is observed that the existing Five-Star rating needs improvements to sufficiently differentiate between properties with materially different levels of digital connectivity performance, particularly where scores lie close to the threshold values. Accordingly, in the consultation paper it has been proposed to refine the rating scale by introducing additional half-star levels, expanding the scale from five to nine rating levels.</p><p>In respect of properties under construction, it is observed that a large proportion of properties are marketed and sold during the construction phase, while the existing framework provides for award of ratings only after completion of Digital Connectivity Infrastructure (DCI) and on-ground assessment under Due Diligence Stage–II. To address this gap, it has been proposed in the consultation paper to supplement the existing rating process by introducing a design-stage assessment and certification mechanism for under-construction properties. The final Digital Connectivity Rating shall continue to be awarded only after completion of construction and Due Diligence Stage–II, thereby preserving assessment integrity.</p><p>In relation to the categorisation of property types, it has been observed that certain property categories under the Regulation may not fully align with actual usage patterns and digital connectivity requirements. Since categorisation under the Regulations is intended solely to determine the applicability of relevant rating criteria, it has been proposed to realign certain property types between Category ‘A’ and Category ‘B’ to ensure consistency, relevance, and effectiveness of the assessment framework.</p><p>Further, stakeholders indicated that some Property Managers may prefer to assess the present level of Digital Connectivity Infrastructure (DCI) in their properties and undertake improvements before applying for a formal rating, particularly since awarded ratings become publicly visible. In view of this, it has been proposed to enable Optional Digital Connectivity Audit mechanism, whereby Property Managers may engage a registered DCRA to undertake a digital connectivity audit against the prescribed criteria and sub-criteria for evaluation and improvement purposes.</p><p>The Consultation Paper on ‘Review of the Rating of Properties for Digital Connectivity Regulations, 2024 (7 of 2024)’, has been placed on TRAI’s website www.trai.gov.in, seeking inputs from the stakeholders and telecom consumers. The written comments on the issues raised in the Consultation Paper, or any additional suggestions, may be sent on TRAI website in specific template mentioned in Annexure-I of the Consultation paper, or to adv-qos1@trai.gov.in with a copy to ja.qos1@trai.gov.in by 23rd March 2026.</p><p>For additional queries, please contact:-Shri Tejpal Singh, Advisor (QoS-1) E-mail: adv-qos1@trai.gov.in | Tel: +91-11-20907759</p><p>Read this release in: Urdu , हिन्दी</p>",
    "category": "Infrastructure",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233529&reg=3&lang=1"
  },
  {
    "headline": "NEW SERIES OF GROSS DOMESTIC PRODUCT (GDP) ESTIMATES WITH BASE YEAR 2022-23",
    "summaryText": "<p>Ministry of Statistics & Programme Implementation</p><p>NEW SERIES OF GROSS DOMESTIC PRODUCT (GDP) ESTIMATES WITH BASE YEAR 2022-23 The Ministry of Statistics and Programme Implementation (MoSPI) is releasing the New Series of Annual and Quarterly National Accounts Estimates with base year 2022–23, which replaces the previous series with base year of 2011–12</p><p>The Ministry of Statistics and Programme Implementation (MoSPI) is releasing the New Series of Annual and Quarterly National Accounts Estimates with base year 2022–23, which replaces the previous series with base year of 2011–12. As per the International best practices, base year revision is undertaken periodically and differs from regular revisions in National Accounts primarily because of nature of changes. In Annual revisions, changes are made only on the basis of updated data becoming available without making any changes in the conceptual framework or using any new data source, to ensure strict comparison over years. In case of base year revisions, changes are made to:</p><p>Capture structural changes in the economy</p><p>Incorporate latest data sources</p><p>Improve estimation methodologies</p><p>Enhance coverage and accuracy</p><p>The Financial Year (FY) 2022–23 has been selected as base year, as it represents a recent normal year (after COVID), with availability of robust and comprehensive data across sectors of the economy, making it an appropriate benchmark for the new series of Annual and Quarterly National Accounts Estimates. For the new Gross Domestic Product (GDP) series, this press release is structured into three parts.</p><p>Second Advance Estimates of Annual GDP for FY 2025–26.</p><p>Quarterly Estimates of GDP from Q1 (April-June) of FY 2022-23 to Q3 (October-December) of FY 2025-26.</p><p>Annual estimates of GDP and related aggregates for FY 2022–23, 2023–24 and 2024–25.</p><p>Links to access various documents related to New Series including Discussion Papers, Reports of the Sub-committees and FAQs.</p><p>Information related to release dates of Back Series and Sources and Methods Publication.</p><p>Comparative tables between Old and New series for FY 2022-23, FY 2023-24 and FY 2024-25.</p><p>* In order to access various linked documents, press note may be accessed from the website of the Ministry (www.mospi.gov.in)</p><p>KEY IMPROVEMENTS IN NEW GDP SERIES (BASE YEAR 2022-23)</p><p>KEY HIGHLIGHTS OF NEW GDP SERIES (BASE YEAR 2022-23)</p><p>SECOND ADVANCE ESTIMATES OF ANNUAL GROSS DOMESTIC PRODUCT FOR 2025-26</p><p>QUARTERLY ESTIMATES OF GROSS DOMESTIC PRODUCT FROM Q1 (APRIL-JUNE) OF 2022-23 TO Q3 (OCTOBER-DECEMBER) OF 2025-26</p><p>In the context of the revision of National Accounts’ Base Year to 2022–23, new series of Quarterly GDP estimates and various aggregates are being released. The revised series incorporates following major changes to effectively capture the progress in the economy within respective years.</p><p>Revision in Estimation Methodology</p><p>Incorporation of New High Frequency Indicators</p><p>Improvement in Deflation Strategy</p><p>Improving Granularity of Estimation</p><p>Apart from the rebased Quarterly GDP estimates, this part of the press note majorly includes the Second Advance Estimates (SAE) of Annual GDP for the Financial Year (FY) 2025-26 and Quarterly Estimates of GDP for Q3 (October-December) of FY 2025-26. Detailed structure of Part A of the press note is as follows.</p><p>Annual GDP Estimates and Growth Rates</p><p>Quarterly GDP Estimates and Growth Rates</p><p>Methodology and Major Data Sources</p><p>Second Advance Estimates of GDP along with Expenditure Components and National Income at Constant and Current Prices (Table 1A and 2A)</p><p>Second Advance Estimates of GVA at Constant and Current Prices (Table 3A, 4A)</p><p>Quarterly GDP Estimates along with Expenditure Components at Constant and Current Prices (Table 5A, 6A, 7A, 8A)</p><p>April-December period GDP Estimates along with Expenditure Components at Constant and Current Prices (Table 9A, 10A)</p><p>Year-on-Year (Y-o-Y) Growth Rates in Indicators-Annexure A1</p><p>Methodology, Data Sources and Deflation Strategy in the New series of Quarterly GDP Estimates (Production Side) - Annexure A2</p><p>Methodology, Data Sources and Deflation Strategy in the Quarterly Expenditure-side components of New GDP series- Annexure A3 https://www.mospi.gov.in/themes/product/6-gross-domestic-product#latest-release</p><p>I Annual GDP Estimates and Growth Rates</p><p>Real GDP or GDP at Constant Prices is estimated to attain a level of ₹322.58 lakh crore in the FY 2025-26, against the First Revised Estimate (FRE) of GDP for the year 2024-25 of ₹299.89 lakh crore. The growth rate in Real GDP during 2025-26 is estimated at 7.6% as compared to 7.1 % in 2024-25. Nominal GDP or GDP at Current Prices is estimated to attain a level of ₹345.47 lakh crore in the year 2025-26, against ₹318.07 lakh crore in 2024-25, showing a growth rate of 8.6%.</p><p>Real GVA is estimated at ₹294.40 lakh crore in the year 2025-26, against ₹273.36 lakh crore in FY 2024-25, registering a growth rate of 7.7% as compared to 7.3% growth rate in 2024-25. Nominal GVA is estimated to attain a level of ₹313.61 lakh crore during FY 2025-26, against ₹288.54 lakh crore in 2024-25, showing a growth rate of 8.7%.</p><p>Fig. 2: Sectoral Composition and Growth Rates of Annual GVA</p><p>Sectoral Composition of Nominal GVA in FY 2025-26</p><p>Fig. 3: Composition and Growth Rates of Annual GVA in Broad Sectors</p><p>II Quarterly Estimates and Growth Rates</p><p>Real GDP or GDP at Constant Prices in Q3 of FY 2025-26 is estimated at ₹84.54 lakh crore, against ₹78.41 lakh crore in Q3 of FY 2024-25, showing a growth rate of 7.8%. Nominal GDP or GDP at Current Prices in Q3 of FY 2025-26 is estimated at ₹90.91 lakh crore, against ₹83.46 lakh crore in Q3 of FY 2024-25, showing a growth rate of 8.9%.</p><p>Real GVA in Q3 of FY 2025-26 is estimated at ₹77.38 lakh crore, against ₹71.77 lakh crore in Q3 of FY 2024-25, showing a growth rate of 7.8%. Nominal GVA in Q3 of FY 2025-26 is estimated at ₹82.58 lakh crore, against ₹76.35 lakh crore in Q3 of FY 2024-25, showing a growth rate of 8.2%.</p><p>Fig. 4: Quarterly GDP and GVA Estimates along with Y-o-Y Growth Rates at Constant Prices</p><p>Fig. 5: Sectoral Composition and Growth Rates of Quarterly GVA</p><p>Sectoral Composition of Nominal GVA in Q3 of FY 2025-26</p><p>*Public Administration, Defence & Other Services category includes the Other Services sector i.e. Education, Health, Recreation, and other personal services</p><p>Fig. 6: Composition and Growth Rates of Quarterly GVA in Broad Sectors</p><p>[Primary Sector: Agriculture, Livestock, Forestry & Fishing and Mining & Quarrying</p><p>Secondary Sector: Manufacturing; Electricity, Gas, Water supply & Other Utility Services and Construction</p><p>Tertiary Sector: Trade, Hotels, Transport, Communication and Services related to Broadcasting, Storage; Financial, Real Estate, IT, & Professional Services, Ownership of Dwelling and Public Administration, Defence & Other Services]</p><p>III Methodology and Major Data Sources:</p><p>The compilation of Second Advance Estimates of Annual GDP and Quarterly Estimates GDP is based on Benchmark-Indicator methodology in which the estimates computed for the previous financial year are extrapolated using the relevant indicators reflecting the performance of various economic and institutional sectors. The estimates of Quarterly GDP majorly follow the guidelines, standards as mentioned in Quarterly National Accounts Manual of International Monetary Fund (IMF), 2017. These estimates based on New base Year (2022-23) incorporates various methodological changes, new data sources etc. Accordingly, the quarterly estimates series from Q1 of FY 2022-23 has seen a change as compared to the earlier published values, consequential changes in the growth rates are reflected from Q1 of FY 2023-24 onwards. Brief of Revised Methodology, Data Sources and Deflation Strategy in the new series of GDP estimates from Production side is mentioned in the Annexure A2. The Expenditure components of GDP at Quarterly level, has also undergone a change in Methodology of estimation, Data Sources and Deflation Strategy in the new series of GDP estimates, which are presented in Annexure A3.</p><p>As per the Advance Release calendar of the Ministry, the Provisional Estimates of Annual GDP for FY 2025-26 along with Quarterly GDP estimates for the quarter January-March of FY 2025-26 (Q4, 2025-26) will be released on 29.05.2026.</p><p>Year-on-Year Growth Rate (%) in Indicators</p><p>Finished Steel Consumption</p><p>IIP Infrastructure/ Construction Goods</p><p>Sales of Commercial Vehicles</p><p>Cargo Handled at Major Ports</p><p>Cargo Handled at Minor Ports</p><p>Air Passenger Traffic and Cargo handled (Scheduled Domestic Service)</p><p>Air Passenger Traffic and Cargo handled (Scheduled International Service)</p><p>Central Goods and Services Tax (CGST)</p><p>Household Vehicle Registration</p><p>Passenger Transport Vehicle Registration</p><p>Goods Transport Vehicles Registration</p><p>IIP (Manufacture of Other Transport Equipment</p><p>IIP Manufacture of computer, electronic and optical products</p><p>IIP Manufacture of Electrical Equipment</p><p>IIP Manufacture of machinery and equipment n.e.c.</p><p>Import of Machinery Equipment</p><p>Methodology, Data Sources and Deflation Strategy in the New series of Quarterly GDP estimates (Production Side)</p><p>Agriculture & Allied sector</p><p>Quarter-wise estimates of various crops including additional crops in the new series</p><p>Season-wise estimates of Major Livestock Products</p><p>Quarterly estimates of Inland and Marine Fish</p><p>Volume Extrapolation at granular level for each sub-sector</p><p>Change in the Benchmarking method:</p><p>Proportional Denton methodology in the new series against the Pro-Rata method in old series.</p><p>Revision in Quarterization pattern based on sector or sub-sector specific indicators for the year 2022-23</p><p>Revision in quarterly Estimation methodology in various sectors, such as Manufacturing, Financial services, Public Administration & Defence etc.</p><p>Revision in the Deflation strategy: Switched to Single/Volume Extrapolation for all sectors (except manufacturing). For manufacturing, Double Deflation method is applied. Use of Item-level relevant WPI and CPI for Single Extrapolation and Double Deflation purpose.</p><p>Improving Granularity of Estimation and Coverage.</p><p>Quarterly Financial Results of Listed Manufacturing Companies</p><p>GST data by Constitution of Business</p><p>Electricity, Gas, Water supply, Remediation & Other utility services</p><p>SAC-wise GST data along with Constitution of Business</p><p>Volume Extrapolation for Electricity, Gas.</p><p>Single Extrapolation for Water supply, Remediation & Other utility services</p><p>IIP Infrastructure and Construction Goods</p><p>Volume Extrapolation in various input items</p><p>Trade, Repair, Hotels, Transport Communication & Services related to broadcasting, Storage</p><p>Quarterly Financial Results of Listed Companies</p><p>SAC and Constitution of Business-wise GST data</p><p>Stock and Sales of Commercial Vehicles and Three Wheelers</p><p>Cargo Handled at Major and Minor Ports</p><p>Domestic and International Air Traffic statistics</p><p>Railway Net Tonne and Passenger Km. information</p><p>Railway Goods and Passenger earning information</p><p>Data Usage, Telephone Subscribers, Minutes of Usage and other related parameters for Telecommunication</p><p>Single Extrapolation at institutional and economic sub-sectors for Trade, Hotels, Storage, Services Related to Broadcasting</p><p>Volume Extrapolation at respective economic sub- sectors for Transport and Communication</p><p>Financial, Real Estate, IT Professional services and Ownership of Dwelling</p><p>Information on Loans, Deposit, Interests for Public, Foreign, Private and Small Finance Banks</p><p>Compensation of Employees for RBI</p><p>Information on Loans, Deposit, Interests for Non-Banking Financial Corporations</p><p>Quarterly Financial Results of Listed Financial Auxiliaries</p><p>Quarterly Financial Results Insurance Companies.</p><p>Volume Extrapolation for Financial services sub-sectors</p><p>Single Extrapolation at institutional sector and economic sub-sectoral level for Real Estate, IT Professional services and Ownership of Dwelling</p><p>Public Administration and Other Services</p><p>Information on Salary and Wages from State Governments</p><p>Information on Compensation of Employees for Central Government from PFMS</p><p>Single Extrapolation at institutional sector and economic sub-sectoral level</p><p>GST collection and other Tax components for Central and State Governments</p><p>Product Subsidy data for Centre and States</p><p>Volume Extrapolation and Single Deflation for various subsidy components</p><p>Methodology, Data Sources and Deflation Strategy in the Quarterly Expenditure-side Components of New GDP Series</p><p>Private Final Consumption Expenditure (PFCE)</p><p>Household Consumption Expenditure Survey for quarterization</p><p>GVO of various sectors relevant to items of PFCE</p><p>Import and Export data for various services items</p><p>Vehicle Category and Class wise Registered vehicles and Sales (in amount) value from e-VAHAN portal and Ministry of Road Transport and High Ways</p><p>Offtake information for Rice and Wheat for Public Distribution System</p><p>Extrapolation or Deflation at granular level for each item. Item-wise relevant CPIs used for deflation.</p><p>Change in the Benchmarking methodology:</p><p>Proportional Denton methodology in the new series against the Pro-Rata method.</p><p>Revision in Quarterization pattern based on various new data sources for various components. Majorly quarterization strategy of PFCE has seen a change as per HCES data.</p><p>Revision in the Deflation strategy: Use of Item level WPI and CPI, Principal Commodity-wise Unit Value Index (UVI), CPI (IW) etc.</p><p>Government Final Consumption Expenditure (GFCE)</p><p>Information on Salary Wages for State and Central Governments</p><p>Information on Food Subsidy</p><p>Procurement information of Food Corporation of India</p><p>Deflation and Volume Extrapolation for Compensation of Employees, Food Subsidy respectively</p><p>Gross Fixed Capital Formation (GFCF)</p><p>Item level IIPs and IIP at NIC 2-digit level</p><p>Import and export of various assets</p><p>Deflation at asset category level using relevant WPIs or CPIs</p><p>Growth majorly observed in (Output-IC-PFCE) for various industries</p><p>Import and Export of Gold, Silver and other valuables</p><p>Deflation by computing CPI for Valuables using relevant items</p><p>Principal Commodity-wise Export and Unit Value Index</p><p>Goods: Deflation using UVI across the Principal Commodities</p><p>Services: Using IPD of relevant services sectors</p><p>Principal Commodity-wise Import and Unit Value Index</p><p>PPI of major Importing countries for India and exchange rate of countries</p><p>Goods: Deflation using UVI at Principal Commodities level</p><p>Services: Based on PPI of major Importing countries</p><p>REVISED ESTIMATES OF GROSS DOMESTIC PRODUCT, NATIONAL INCOME, CONSUMPTION EXPENDITURE, SAVING AND CAPITAL FORMATION FOR 2022-23. 2023-24 & 2024-25</p><p>In this part of the press note, First Revised Estimates of National Income, Consumption Expenditure, Saving and Capital Formation for the financial year 2024-25 and estimates for the financial year 2023-24 and 2022-23, as per the New Base Year (2022-23) are given.</p><p>The First Revised Estimates for the year 2024-25 have been compiled using industry-wise/institution-wise detailed information instead of using the benchmark-indicator method employed at the time of release of Provisional Estimates on 30th May, 2025. The estimates of Gross Domestic Product (GDP) and other aggregates for the year 2022-23 and 2023-24 have also undergone revisions on account of base year revision as well as use of latest available datasets on agricultural production; industrial production (final results of Annual Survey of Industries: 2023-24); government data as available through PFMS and in budget documents (replacing Revised Estimates with actuals for the year 2023-24); comprehensive data available from various source agencies like Ministry of Corporate Affairs (MCA), Reserve Bank of India (RBI), National Bank for Agriculture and Rural Development (NABARD), e-Vahan data, etc. and additional data from State/UT Directorates of Economics and Statistics (DES).</p><p>The salient features of the key macro-economic aggregates in the new series estimates are given in the succeeding paragraphs.</p><p>GDP for the base year 2022-23 is estimated as ₹261.18 lakh crore. Real GDP or GDP at constant prices for the years 2023-24 and 2024-25 stands at ₹280.01 lakh crore and ₹299.89 lakh crore, respectively, showing a growth of 7.2% during 2023-24, and 7.1% during 2024-25.</p><p>Nominal GDP or GDP at current prices for the years 2023-24 and 2024-25 stands at ₹289.84 lakh crore and ₹318.07 lakh crore, respectively, exhibiting a growth of 11.0% during 2023-24, and 9.7% during 2024-25.</p><p>GVA and its Industry-wise Analysis</p><p>At the aggregate level, Nominal Gross Value Added (GVA) at basic prices has increased by 9.6% during 2024-25 compared to growth of 10.7% during 2023-24. Real GVA or GVA at constant prices, has increased by 7.3% in 2024-25, compared to 7.2% growth in 2023-24.</p><p>The shares of broad sectors of the economy in overall GVA during 2022-23 to 2024-25 and the annual growth rates during these periods are mentioned below:</p><p>Sector-wise share in GVA at current prices for the years 2022-23, 2023-24 and 2024-25</p><p>* The sector-wise figures may not add up to 100 due to rounding off.</p><p>@: First Revised Estimates</p><p>[i] Primary indicates agriculture, livestock, forestry, fishing and mining & quarrying industries</p><p>[ii] Secondary indicates manufacturing, electricity, gas, water supply & other utility services and construction</p><p>[iii] Tertiary indicates all services</p><p>The growth rates of Primary sector (comprising Agriculture, Livestock, Forestry, Fishing and Mining & Quarrying), Secondary sector (comprising Manufacturing, Electricity, Gas, Water Supply & Other Utility Services, and Construction) and Tertiary sector (Services) have been estimated as 4.9%, 8.0% and 7.9% respectively in 2024-25 as against growth rates of 2.6%, 11.6% and 7.3% respectively in 2023-24. The growth in real GVA during 2024-25 is primarily on account of growth in ‘Manufacturing’, ‘Mining & Quarrying’, ‘Construction’, ‘Financial Services’ and ‘Real Estate, Ownership of Dwelling & Professional Services’ as may be seen from Statement 4.2B. However, ‘Agriculture, Livestock, Forestry and Fishing’, ‘Electricity, Gas, Water Supply & Other utility services’ and ‘Other services’ have witnessed modest growth during 2024-25.</p><p>Net National Income (NNI) at current prices for the year 2024-25 stands at ₹271.44 lakh crore as against ₹246.25 lakh crore in 2023-24, showing a growth of 10.2 % during 2024-25 as compared to growth of 11.6 % in 2023-24.</p><p>Gross National Disposable Income</p><p>Gross National Disposable Income (GNDI) at current prices is estimated at ₹324.52 lakh crore for the year 2024-25, while the estimate for the year 2023-24 stands at ₹294.55 lakh crore, showing a growth of 10.2 % for year 2024-25 as compared to growth of 10.9 % in the year 2023-24.</p><p>Gross Saving during 2024-25 is estimated at ₹111.13 lakh crore against ₹95.17 lakh crore during 2023-24. The major share in Gross Saving during 2024-25 is 62.1% in Household sector and 28.9% in Non-financial corporations. Savings of household sector have increased, thereby strengthening the domestic resource base for investment and capital formation. This indicates improved financial resilience of household sector and greater availability of funds for sustainable economic growth in long run. Savings in physical assets as well as valuables have increased during 2022-23 to 2024-25.</p><p>Gross Capital Formation (GCF) at current prices is estimated at ₹109.25 lakh crore for the year 2024-25 as compared to ₹100.00 lakh crore during 2023-24. The rate of GCF to GDP is 34.3 % during 2024-25 as against 34.5 % in the 2023-24.</p><p>The rate of GCF to GDP at constant prices was 34.9 % in 2023-24 and 34.6 % in 2024-25.</p><p>Private Final Consumption Expenditure (PFCE) at current prices is estimated at ₹179.71 lakh crore for the year 2024-25 as against ₹163.77 lakh crore in 2023-24. In relation to GDP, the PFCE to GDP ratio at current prices is 56.5% for both 2023-24 and 2024-25. At constant prices, the PFCE is estimated at ₹157.85 lakh crore and ₹167.00 lakh crore, respectively for the years 2023-24 and 2024-25. The corresponding PFCE to GDP ratio for the years 2023-24 and 2024-25 are 56.4% and 55.7% respectively.</p><p>Government Final Consumption Expenditure (GFCE) at current prices is estimated at ₹33.95 lakh crore for the year 2024-25 as against ₹30.74 lakh crore during 2023-24. At constant prices the estimates of GFCE for the years 2023-24 and 2024-25 stand at ₹29.08 lakh crore and ₹30.96 lakh crore respectively.</p><p>Per Capita Income i.e. Per Capita Net National Income at current prices for the years 2022-23, 2023-24 and 2024-25 is estimated at ₹1,59,557, ₹1,76,465 and ₹1,92,774, respectively. Per Capita PFCE at current prices, for the years 2022-23, 2023-24 and 2024-25 is estimated at ₹1,07,910, ₹1,17,356 and ₹1,27,627 respectively.</p><p>More details of the New Series Estimates for FY 2022-23, 2023-24 and 2024-25 are available in Statements 1.1B to 9B provided in the pdf format of the Press Note (link given at the end) and also can be accessed from the website of the Ministry of Statistics and PI (https://www.mospi.gov.in/themes/product/6-gross-domestic-product#latest-release).</p><p>Statement 1.1B: Key Aggregates of National Accounts at Current Prices</p><p>Statement 1.2B: Key Aggregates of National Accounts at Constant (2022-23) Prices</p><p>Statement 2B: Per Capita Income, Product and Final Consumption</p><p>Statement 3.1B: Output by Economic Activity and Capital Formation by Industry of Use at Current Prices</p><p>Statement 3.2B: Output by Economic Activity and Capital Formation by Industry of Use at Constant (2022-23) Prices</p><p>Statement 4.1B: Gross Value Added by Economic Activity at Current Basic Prices</p><p>Statement 4.2B: Gross Value Added by Economic Activity at Constant (2022-23) Basic Prices</p><p>Statement 5B: Finances for Gross Capital Formation</p><p>Statement 6.1B: Gross Capital Formation by Industry of Use at Current Prices</p><p>Statement 6.2B: Gross Capital Formation by Industry of Use at Constant (2022-23) Prices</p><p>Statement 7.1B: Gross Fixed Capital Formation by Asset & Institutional Sector at Current Prices</p><p>Statement 7.2B: Gross Fixed Capital Formation by Asset & Institutional Sector at Constant (2022-23) Prices</p><p>Statement 8.1B: Private Final Consumption Expenditure at Current Prices</p><p>Statement 8.2B: Private Final Consumption Expenditure at Constant Prices</p><p>Statement 9B: Institutional Sectors – Key Economic Indicators at Current Prices</p><p>GVA at basic prices (Production Approach) = Output at basic price – Intermediate Consumption</p><p>GVA at basic prices (Income Approach) = CE + OS/MI + CFC + Production taxes less Production subsidies(i)</p><p>GDP = ∑ GVA at basic prices + Product taxes less Product subsidies(ii)</p><p>GNI = GDP + Net primary income from ROW (Receipts less payments)</p><p>Primary Incomes = CE + Property and Entrepreneurial Income</p><p>NNDI =NNI + other current transfers(iii) from ROW, net (Receipts less payments)</p><p>GNDI = NNDI + CFC = GNI + other current transfers(iii) from ROW, net (Receipts less payments)</p><p>Gross Capital Formation (GCF)(iv) (Financing Side) = Gross Savings + Net Capital Inflow from ROW</p><p>GCF (Expenditure Side) = GFCF + CIS + Valuables</p><p>Gross Disposable Income of Govt. = GFCE + Gross Saving of General Government</p><p>Gross Disposable Income (GDI) of Households = GNDI – GDI of Govt. – Gross Savings of All Corporations</p><p>Production taxes or subsidies are paid or received with relation to production and are independent of the volume of actual production. Some examples are:</p><p>Production Taxes - Land Revenues, Stamps & Registration fees and Tax on profession</p><p>Production Subsidies - Subsidies to Railways, Subsidies to village and small industries.</p><p>Product taxes or subsidies are paid or received on per unit of product. Some examples are:</p><p>Product Taxes- Goods & Service Tax, Excise duties, Sales tax, Service Tax and Import, Export duties</p><p>Product Subsidies- Electricity, Petroleum and Fertilizer subsidies.</p><p>Other Current Transfers refers to current transfers other than the primary incomes.</p><p>Gross Capital Formation (GCF) at the current as well as the constant prices is estimated by two approaches: – (a) through flow of funds, derived as Gross Saving plus net capital flow from Rest of the World (RoW); and (b) by the commodity flow approach, derived by the type of assets.</p><p>BASE YEAR REVISION OF NATIONAL ACCOUNTS</p><p>MoSPI associates technical experts and representatives of central ministries and State/Union Territory Directorates of Economic and Statistics (DES) with the compilation of National Accounts Statistics (NAS). This is in the form of Advisory Committee on National Accounts Statistics (ACNAS), which is a permanent standing committee and is reconstituted from time to time.</p><p>At present, the ACNAS is headed by Prof. Biswanath Goldar. The role of the committee is to advises MoSPI, among other things, on inclusion of new data sources and on the methodology for compilation and presentation of National Accounts Statistics for purposes of economic analysis and policy. On the recommendation of the Committee, base year of national accounts is being revised from 2011-12 to 2022-23.</p><p>Sub-committees for Base Revision:</p><p>Under ACNAS, five Sub-committees, with a term of two years, have been constituted to simultaneously deliberate upon specific subjects. Reports of first three sub-committees dealing with all-India estimates are available on the website of the Ministry, which have been hyperlinked to the names of respective sub-committees as given below. Reports of other two sub-committees will be released later.</p><p>I. Sub-committee for Incorporation of New Data Sources, Rates and Ratios</p><p>II. Sub-committee for Methodological Improvement</p><p>III. Sub-committee for Constant Price Estimates</p><p>IV. Sub-committee on Regional Accounts</p><p>V. Sub-committee for SNA 2025 Update</p><p>Discussion Papers and Key Improvements:</p><p>The methodological improvements in new series of National Accounts has been a crucial step in aligning with structural changes for achieving the long-term vision towards Viksit Bharat. Details of improvements in the new series are documented in discussion papers, one each on ‘Production Approach’, ‘Expenditure Approach’ and ‘Quarterly GDP & Sub-national Accounts’ released by the Ministry. These discussion papers are available on the website of the Ministry. Some of the major improvements in the new series are summarized below:</p><p>Increased dynamism in measuring household sector: In the old series, household sector was estimated either through inter-survey growths or through some proxy indicators. In the new series, level estimates of the household sector will be compiled through regular surveys – Annual Survey of Unincorporated Sector Enterprise (ASUSE) and Periodic Labour Force Survey (PLFS) - being conducted each year.</p><p>Use of Double Deflation or Single Extrapolation: In the new series, double deflation will be used in manufacturing and agriculture industries and single extrapolation elsewhere. As such single deflation has been completely done away with. Besides, deflators will be used at a more granular level.</p><p>Lower Discrepancy: Supply Use Table Framework will be integrated with National Accounts Framework to minimize the discrepancy between GDP from production and expenditure approaches. SUT shows what industries produce (Supply) and how products are used by industries or final consumers (Use). Balanced SUT ensures that total supply matches total demand in the economy. So, integration of SUT framework with National Accounts Framework will help minimize discrepancy in new series.</p><p>Use of updated rates/ratios from various studies and surveys: Rates and ratios used in compilation will be revised in new series either from surveys which have come up in the intervening period or through studies conducted by MoSPI in collaboration with other expert organizations.</p><p>Segregation of activities in case of multi activity private corporations: In the old series, total value added of multi activity enterprises was allocated to the major activity. However, as administrative data has become available in the intervening period, where corporations are mandated to report activity-wise share in turnover, the same will be used to segregate the total value added (and other aggregates) in different activities.</p><p>Private Final Consumption Expenditure (PFCE): In the new series, estimation of PFCE is more nuanced through use of mixed approach (a) enhanced use of Household Consumer Expenditure Survey (b) Direct estimation based on production and other data sources (c) Commodity flow approach. Besides, latest relevant standard i.e. COICOP 2018 has also been adopted in compilation of PFCE.</p><p>Use of new data sources: Digitization of records has led to accessibility of new and more granular database in a digitized form. New data sources like Goods and Services Tax (GST) data, Public Finance Management System (PFMS), E-vahan etc., which are more comprehensive and available at a shorter time lag, have been explored for augmenting the existing data sources for compilation and corroboration of estimates.</p><p>Methodology and data sources used in compilation of estimates are presented comprehensively in MoSPI’s publication ‘Source and Methods’. The publication is scheduled to be released by August 2026.</p><p>In order to facilitate users of national accounts data to have easy access of new series and to provide users immediate answers to some of the most common questions, FAQs have been uploaded on the website.</p><p>Since the base year of indices (Wholesale Price Index/ Producer Price Index and Index of Industrial Production) are being revised, the constant price estimates of the new series would be revised thereafter.</p><p>As per the past practice for calculation of Back Series in India, estimates are recalculated using revised methodology of the new series till the immediate preceding base and spliced at disaggregated level, thereafter, till 1950-51. A judicious approach combining splicing and recalculation, aligned with the international best practice, will be used. However, the methodology for back series will be finalized in consultation with the advisory committee which has been constituted to advise the Ministry on methodological improvements and incorporation of new data sources in compilation of GDP estimates. Back series is expected to be released by December 2026.</p><p>Industry-wise estimates for FY 2022-23, FY 2023-24 and FY 2024-25 for both old and new series and reasons for revision in estimates are given at Annexures.</p><p>Industry-wise GVA estimates: Old vs New Series (at Current Prices)</p><p>Growth Rate in Industry-wise GVA estimates: Old vs New Series (at Constant Prices)</p><p>Aggregates from Expenditure Approach: Old vs New Series (at Current Prices)</p><p>* Share is given in case of discrepancy.</p><p>Aggregates from Expenditure Approach: Old vs New Series (at Constant Prices)</p><p>Brief Reasons for data revisions in the new series of GDP estimates (Base Year: 2022-23)</p><p>Level Estimate (FY 2022-23)</p><p>Crop: (i)Inclusion of new fruits and vegetables (ii) Updation of rate and ratio for production of grass and fodder (iii)drop in input value (electricity, diesel)</p><p>Livestock, fisheries: Increased input rate</p><p>Forestry: Updated state-wise input rate</p><p>Revised prices received from states.</p><p>Prices provided by States have been used in place of use of WPI adjusted price in provisional estimates.</p><p>Revision of data of Minor Minerals by States.</p><p>Change in Methodology for constant price estimation based on volume extrapolation in place of single deflation.</p><p>Use of detailed data from MCA and States against indicator (Index of Industrial Production (IIP)) based provisional estimates.</p><p>Segregation of multi-activity of Private Corporate data of MCA.</p><p>No significant change in growth rate.</p><p>Use of detailed MCA, NDE and ASUSE & PLFS data in lieu of provisional estimates based on limited data.</p><p>use of double deflation and single extrapolation in the new series in place of single deflation (old series) for constant price estimate</p><p>Electricity, Gas, Water supply & Other utility services</p><p>Use of direct estimate from ASUSE and PLFS data for the quasi-corporate and household sector in new series in place of indicators-based estimates in old series.</p><p>Same as for 2022-23 for current price estimates.</p><p>Volume extrapolation (Electricity, Gas) and Single Extrapolation (for Others) in the new series in place of single deflation used in old series.</p><p>Use of detailed data from MCA, Non-Department Enterprises (NDE), Government Budget documents and ASUSE as against Indicator based provisional estimates.</p><p>Updated/ revised Rates and ratios based on latest survey undertaken by National Sample Survey (NSS) on Construction are used in new series.</p><p>Use of latest ASI data for deriving total production and availability of input items for construction.</p><p>Use of single extrapolation in place of single deflation for constant price estimates.</p><p>Trade, Repair, Hotel & Restaurants</p><p>Transport, Storage, Communication & broadcasting</p><p>Expansion of coverage of private Non-Banking Financial Corporations (NBFCs) using MCA data.</p><p>No significant change in the growth rate.</p><p>Real estate, Professional services and Ownership of dwelling</p><p>In the new series, estimate of the total dwelling has been updated based on the projected population (source: MoH&FW) and the latest household size from survey data.</p><p>Use of ASUSE & PLFS data in place of indicator growth derived from Corporate sector for unincorporated sector.</p><p>Single extrapolation based on CPI of relevant items in place of single deflation using mix of CPI, WPI.</p><p>Public administration and Defence</p><p>Due to adjustment in pension payments.</p><p>Estimates of States and Defence are based on actual Expenditure instead of Revised Estimates.</p><p>Use of detailed data from Government Budget documents and sates as against Indicator based provisional estimates.</p><p>For quasi-corporate and household sector, instead of extrapolation using inter-survey growth of NSS, annual results of ASUSE & PLFS have been used.</p><p>Use of ASUSE & PLFS data in place of indicators from Inter-survey growth for unincorporated sector.</p><p>Single extrapolation based on CPI of relevant items against single deflation using CPI of the same items for constant price estimates.</p><p>Click here to download in PDF Format</p>",
    "category": "Economy",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/300TZND.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/400WEOQ.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003LAMA.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004QW8D.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0050GRT.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image006ZZI0.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image007M71Z.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image008KWV5.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image009M5NE.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image010IIVF.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image011W8MU.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image012ZBBL.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image013URSB.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image014C3KT.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/0014UDY.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/002QTLZ.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/003LN8H.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/004JFHQ.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/0059I51.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/006VTIO.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/007OA5J.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/008WG32.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/009GO4C.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/0010M7WZ.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0241DZJ.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image0258U2Y.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image026E8EU.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image027KXQF.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image029RI3X.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image030VAOU.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image031CDT5.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image032FWFB.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/153XN8.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/16443K.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/17HTYJ.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/18EG88.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233518&reg=3&lang=1"
  },
  {
    "headline": "Ahmedabad–Dholera Expressway Is Bringing Cities, Families & Dreams Closer",
    "summaryText": "<p>Ministry of Road Transport & Highways</p><p>Ahmedabad–Dholera Expressway Is Bringing Cities, Families & Dreams Closer</p><p>The Ahmedabad–Dholera Greenfield Expressway (NE-8), stretching 109.019 km, is no longer just a road under the Bharatmala Pariyojana. It has become a lifeline, which is connecting villages to cities, families to time, and aspirations to opportunities.</p><p>Passing through Ahmedabad and Bhavnagar districts, the expressway provides seamless connectivity to the Dholera Special Investment Region (DSIR) and the existing coastal highway, redefining how people live, travel, and dream in this region. Built at a total project cost of ₹5,800 crore, the expressway represents one of the most significant infrastructure investments in the region.</p><p>At present, the expressway has been opened to the public for testing purposes, allowing commuters to experience faster and smoother travel while final operational readiness is assessed.</p><p>For frequent travellers like Narendra Singh Chudasma, who regularly journeys between Gandhinagar and Bhavnagar, the expressway has brought a priceless change.</p><p>“Earlier, the journey used to take 3.5 to 4 hours. Now I reach within 2.30 to 2.45 hours. Because of long hours on the road earlier, I couldn’t give enough time to my family. Now, the 2 to 2.5 hours I save are spent with them.”</p><p>The expressway is also unlocking Dholera’s economic potential. Yaduraj Singh Chudasma believes connectivity has removed the biggest hesitation investors once had.</p><p>“With the opening of this expressway, investors can travel easily and save time. Reaching Dholera from Ahmedabad now takes just 45 minutes, which is extremely important. Investors are happy and increasingly eager to invest in Dholera. This highway has removed the connectivity gap that once existed.”</p><p>For Harshdeep Singh Chudasma, a resident of Pipli village, the expressway has transformed how his family relates to the city.</p><p>“Two years ago, we felt that we lived very far from Ahmedabad as Ahmedabad was almost 120 to 130 kilometres away. But ever since this expressway was built, it feels like we live in Ahmedabad itself. Today, reaching Ahmedabad takes just 45 minutes, compared to two and a half hours earlier.”</p><p>Building Infrastructure, Protecting the Environment</p><p>A defining aspect of the Ahmedabad–Dholera Expressway is its environment-first construction approach, proving that large infrastructure can grow responsibly.</p><p>• 60 lakh metric tonnes of Ahmedabad Municipal Corporation waste reused in embankment construction • 22 lakh metric tonnes of fly ash utilised, reducing industrial waste and carbon impact • Massive green initiative with over: o 2,70,675 plants in the median o 1,56,097 avenue plantations</p><p>Key Features of the Expressway</p><p>• 30-metre wide median designed for future expansion to 8 lanes • Direct connectivity to Dholera International Airport via interchange at Ch. 67 • Planned Semi High-Speed Rail corridor running parallel (30 m ROW already acquired) • Closed tolling system for seamless travel • 2 modern Way-Side Amenities • Extensive structures including: 3 ROBs, 11 interchanges, 14 flyovers, 86 underpasses, 224 culverts, and more</p><p>Transforming Travel, Economy and Everyday Life</p><p>The expressway has drastically reduced travel distances and times:</p><p>• Ahmedabad to Dholera: from 100 km & 2 hr 15 min → 83 km & 45 min • Ahmedabad to Bhavnagar: from 169 km & 3 hr 15 min → 141 km & 1 hr 45 min</p><p>It brings families closer, saves time, attracts opportunity, and builds a greener future—one journey at a time.</p><p>Read this release in: Urdu , हिन्दी , Gujarati</p>",
    "category": "Infrastructure",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001JUWL.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002CTN2.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003MMCL.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004D38D.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005Z30P.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233516&reg=3&lang=1"
  },
  {
    "headline": "PM to visit Gujarat on 28th February",
    "summaryText": "<p>PM to visit Gujarat on 28th February PM to inaugurate Micron Technology’s Semiconductor Assembly, Test and Packaging (ATMP) facility in SanandInauguration marks a historic milestone in India’s semiconductor manufacturing journeyCommercial production and shipment of first Made-in-India semiconductor memory modules to commenceFacility to feature one of the world’s largest raised-floor cleanrooms</p><p>Prime Minister Shri Narendra Modi will visit Gujarat on 28 February 2026. At around 3:45 PM, Prime Minister will inaugurate the Semiconductor Assembly, Test and Packaging (ATMP) facility of Micron Semiconductor Technology India Private Limited in Sanand. He will also address the gathering on the occasion.</p><p>The inauguration marks a significant milestone in India’s semiconductor manufacturing journey, with the commencement of commercial production and shipment of the first made-in-India semiconductor memory modules from the Sanand ATMP facility. This development represents a major step forward in strengthening India’s position in the global semiconductor value chain.</p><p>The project, which had its ground-breaking ceremony in September 2023, was the first proposal approved under the India Semiconductor Mission (ISM). With a total outlay of more than ₹22,500 crore, construction commenced soon after approval, reflecting the Government’s commitment to fast-tracking strategic semiconductor investments in the country.</p><p>The Sanand facility, once fully ramped up, will feature approximately 500,000 square feet of cleanroom space, making it one of the world’s largest raised-floor cleanrooms. The facility is designed to serve customers worldwide and address the growing global demand for memory and storage solutions, driven by rapid advancements in Artificial Intelligence and high-performance computing.</p><p>The Sanand ATMP facility will convert advanced Dynamic Random Access Memory (DRAM) and NAND semiconductor wafers from Micron’s global manufacturing network into finished memory and storage products, catering to customers across global markets.</p><p>The establishment and operationalisation of this facility underscores India’s emergence as a trusted and competitive destination for semiconductor manufacturing and aligns with Prime Minister’s vision of building a resilient and self-reliant technology ecosystem in the country.</p><p>Read this release in: Urdu , हिन्दी , Manipuri , Gujarati , Kannada , Malayalam</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233506&reg=3&lang=1"
  },
  {
    "headline": "PM to visit Rajasthan on 28th February",
    "summaryText": "<p>PM to visit Rajasthan on 28th February PM to Launch Nationwide HPV Vaccination Drive for Girls Aged 14 to Prevent Cervical CancerPM to lay foundation stone and inaugurate multiple development projects worth over Rs 16,680 crore in AjmerProjects span key sectors including urban development, drinking water supply, roads, irrigation, energy, industrial infrastructure PM to distribute over 21,800 appointment letters to newly recruited youth in Government departments and organizations in Rajasthan</p><p>Prime Minister Shri Narendra Modi will visit Ajmer, Rajasthan on 28 February 2026. At around 11:30 AM, the Prime Minister will launch, inaugurate and lay the foundation stone of multiple development projects worth over ₹16,680 crore. He will also address a public gathering on the occasion. The projects span key sectors including urban development, drinking water supply, roads, irrigation, energy, industrial infrastructure.</p><p>In a major step towards strengthening preventive healthcare and advancing women’s well-being, the Prime Minister will launch a nationwide campaign for Human Papillomavirus (HPV) vaccination for girls aged 14 years. This initiative aims to prevent cervical cancer, which is one of the leading causes of cancer related morbidity in women and marks a significant milestone in safeguarding the long-term health of girls and women across the country.</p><p>Providing a major boost to road connectivity, Prime Minister will inaugurate several National Highways projects, including the 4-lane greenfield expressway from Bandikui to Jaipur, 6-lane access controlled green highway in package 7 section of Amritsar-Jamnagar Economic Corridor and the 8-lane carriageway in package 14 section of the Delhi-Vadodara Access Controlled Greenfield Expressway, among others. He will also lay the foundation stone of 4-lane Elevated Road in Jodhpur City, Malabmori-Mangrol-Baran State Highway in Baran district among others.</p><p>In line with the Government’s commitment to ensuring safe and clean drinking water for all, the Prime Minister will lay the foundation stone for four packages of the Nonera Major Drinking Water Project and five packages of the Parwan Akawad Major Drinking Water Project.</p><p>To strengthen renewable energy infrastructure and ensure seamless transmission from generation hubs in Rajasthan, Prime Minister will inaugurate transmission systems for evacuation of power from Renewable Energy Zones (REZ) in Rajasthan. He will also lay the foundation stone for five 220 KV Grid Substations and two 400 KV Grid Substations along with associated transmission lines.</p><p>Furthering his commitment to employment generation and youth empowerment, Prime Minister will distribute more than 21,800 appointment letters to newly recruited youth in various Government departments and organisations in Rajasthan.</p><p>Read this release in: Urdu , हिन्दी , Gujarati , Kannada , Malayalam</p>",
    "category": "Infrastructure",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233504&reg=3&lang=1"
  },
  {
    "headline": "RAV Achievers Felicitated with Jeevan Gaurav and Ayurveda Gaurav Samman at National Arogya Fair 2026",
    "summaryText": "<p>RAV Achievers Felicitated with Jeevan Gaurav and Ayurveda Gaurav Samman at National Arogya Fair 2026</p><p>On the auspicious occasion of the National Arogya Fair 2026, held from 25–28 February 2026 at Shegaon, Buldhana (Maharashtra), and organized by the Ministry of Ayush, Government of India, in association with Akhil Bhartiya Ayurved Mahasammelan, the President of India, Droupadi Murmu, in the august presence of Sh. Acharya Devvrat, Governor of Maharashtra and Sh. Prataprao Jadhav, Minister of State (I/c), Ministry of Ayush and Minister of State for Health and Family Welfare, Govt. of India & Padma Shri Vaidya Sh. Rajesh Kotecha, Secretary, Ministry of Ayush, Govt. of India conferred prestigious honours upon eminent Vaidyas associated with Rashtriya Ayurveda Vidyapeeth (RAV) in recognition of their exemplary contributions to the field of Ayurveda.</p><p>Awardees and Honours Conferred</p><p>Jeevan Gaurav Samman Conferred upon Vaidya Shri Devendra Triguna Ji – recipient of Padma Shri and Padma Bhushan, President of RAV, Ministry of Ayush and President of the All India Ayurved Mahasammelan Trust.</p><p>Ayurveda Gaurav Samman Conferred upon: Prof. Vaidya Shri Rakesh Amarnath Sharma Ji – Governing Body Member, RAV and President, All India Ayurved Mahasammelan. Vaidya Shri P. M. Warrier Ji – Managing Trustee & Chief Physician, Arya Vaidya Sala; CRAV Guru, RAV. Vaidya Shri Ramdas Avhad Ji – Recipient of the National Dhanvantari Ayurveda Award 2023; CRAV Guru, RAV. Vaidya Smt. Maneesha Upendra Kothekar Ji – Chairperson, National Commission for Indian System of Medicine. Vaidya Shri Ashutosh Satish Gupta Ji – Fellow of Rashtriya Ayurveda Vidyapeeth (FRAV). Former President of Maharashtra Council of Indian Medicine, Mumbai.</p><p>Prof. Vaidya Shri Rakesh Amarnath Sharma Ji – Governing Body Member, RAV and President, All India Ayurved Mahasammelan.</p><p>Vaidya Shri P. M. Warrier Ji – Managing Trustee & Chief Physician, Arya Vaidya Sala; CRAV Guru, RAV.</p><p>Vaidya Shri Ramdas Avhad Ji – Recipient of the National Dhanvantari Ayurveda Award 2023; CRAV Guru, RAV.</p><p>Vaidya Smt. Maneesha Upendra Kothekar Ji – Chairperson, National Commission for Indian System of Medicine.</p><p>Vaidya Shri Ashutosh Satish Gupta Ji – Fellow of Rashtriya Ayurveda Vidyapeeth (FRAV). Former President of Maharashtra Council of Indian Medicine, Mumbai.</p><p>The ceremony was a distinguished acknowledgment of dedication, scholarship, clinical excellence, and lifelong service rendered toward the preservation, advancement, and global propagation of Ayurveda.</p><p>On behalf of Rashtriya Ayurveda Vidyapeeth (RAV), the Director, Vaidya Vandana Siroha, extended her heartfelt congratulations and best wishes to all the awardees for receiving this prestigious recognition from the President of India in the august presence of Sh. Acharya Devvrat, Governor of Maharashtra and Sh. Prataprao Jadhav, Minister of State (I/c), Ministry of Ayush and Minister of State for Health and Family Welfare Govt. of India & Padma Shri Vaidya Sh. Rajesh Kotecha, Secretary, Ministry of Ayush, Govt. of India.</p><p>Read this release in: Urdu , हिन्दी , Tamil</p>",
    "category": "General",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image001TUDH.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image002NGCR.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003GF38.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004FCKL.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image005LEOD.jpg",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image006PUX1.jpg"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233497&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister Shri Narendra Modi addresses Post-Budget Webinar on “Technology Reforms and Finance for Viksit Bharat”",
    "summaryText": "<p>Prime Minister Shri Narendra Modi addresses Post-Budget Webinar on “Technology Reforms and Finance for Viksit Bharat” This year’s Union Budget lays the roadmap for Viksit Bharat, driven by technology, reforms and finance: PMWe have simplified processes, improved the Ease of Doing Business, expanded technology-led governance, and strengthened institutions; and even today, the country is riding the 'Reform Express': PMIn the past decade, we have had a very strong focus on infrastructure: PMIn the past decade, we have continued to maintain a very strong focus on infrastructure: PMWe have made a conscious decision that India's development will only be achieved by creating solid assets such as Highways, Railways, Ports, Digital Networks, and Power Systems: PMThese assets will continue to generate productivity for many decades to come. For this reason, Public Capital Expenditure is being continuously increased: PMWhen Government, Industry, and Knowledge Partners move forward together, then Reforms change into Results, only then do announcements become achievements, on the ground: PM</p><p>Prime Minister Shri Narendra Modi addressed the first post-budget webinar of the 2026-27 series today, focusing on the theme \"Technology Reforms and Finance for Viksit Bharat.\" Emphasizing that the national budget is a policy roadmap rather than a short-term trading document, Shri Modi called for a collective effort to realize the goal of a developed India by 2047.</p><p>The Prime Minister emphasized that the budget's effectiveness should be assessed through concrete parameters, such as expanding infrastructure, simplifying the flow of credit, improving the ease of doing business, and increasing transparency in governance, while also making the lives of citizens easier and generating new opportunities for them. ” Budget decisions related to these aspects provide permanent strength to the economy”, the Prime Minister highlighted. The Prime Minister noted that, most importantly, no budget should be viewed as a standalone event because nation-building is a continuous process. “Every budget is a stage toward moving to a larger goal,and that big goal is the construction of a Developed India (Viksit Bharat) by the year 2047. Therefore, every reform, every allocation, and every change should be seen as an integral part of this long journey”, Shri Modi emphasised. The Prime Minister remarked that these annual post-budget webinars are of great importance. He expressed his expectation that these sessions should not be limited merely to the exchange of ideas but should instead become an effective brainstorming exercise. “ Suggestions based on the experience and practical challenges of stakeholders will certainly help in further refining economic strategies and finding solutions”, Shri Modi noted. Furthermore, he emphasized that when industry, academia, analysts, and policymakers think together, the implementation of schemes improves and results become more accurate, which is the core spirit behind this series of webinars. The Prime Minister observed that a quarter of the 21st century has passed, marking a significant period in the lives of those in service. He stated that the country is now in a crucial phase of its development journey, with the economy moving forward at a rapid pace. Highlighting India's extraordinary resilience over the last decades, shri. Modi noted that this progress has not happened by chance but is the result of conviction-driven reforms. “ The government has simplified processes, improved the Ease of Doing Business, expanded technology-led governance, and strengthened institutions, asserting that even today, the country continues to ride the Reform Express”, Shri Modi underscored. The Prime Minister noted that while policy intent is crucial, the current phase of India’s development requires a relentless focus on delivery excellence. “The evaluation of reforms should not be based on their announcement, but on their impact at the ground level, and he urged the integration of AI, Blockchain, and Data Analytics to drive accountability and speed and transparency in public service delivery”, Shri Modi added. Also, he emphasised that impact must be monitored through grievance redressal systems.</p><p>Highlighting the government's commitment to building long-term productive assets, the Prime Minister pointed out the significant rise in Public Capital Expenditure. “Over the last 11 years, the provision has grown from approximately ₹2 lakh crore to over ₹12 lakh crore in the current budget. This investment serves as a clear signal for the private sector to increase participation in infrastructure and innovation”, Shri Modi emphasised. The Prime Minister called upon the industry and financial institutions to come forward with new energy, emphasizing the need for greater participation in infrastructure, more innovation in financing models, and stronger collaboration in emerging sectors. He further suggested that the project sanction methodology and appraisal quality must be strengthened, keeping cost-benefit analysis and life-cycle costing paramount to eliminate waste and delays.</p><p>Addressing the financial framework, the Prime Minister stated that the government is further simplifying the foreign investment framework to make the system more predictable and investor-friendly. He highlighted steps being taken to make bond markets more active and simplify the buying and selling of bonds, viewing these reforms as essential enablers of long-term growth.”There is need to ensure predictability, deepen liquidity, and introduce new instruments to manage risk effectively and attract sustained foreign capital”, Shri Modi remarked. Shri Modi also urged stakeholders to learn from global best practices to help strengthen the bond market and foreign investment framework.</p><p>To attract sustained foreign capital and improve long-term financing, the Prime Minister announced further simplifications to the foreign investment framework. The strategy includes developing more active bond markets, simplifying bond trading processes, and strengthening project sanction methodologies through rigorous cost-benefit analysis and life-cycle costing. “ These steps aim to make the system more predictable and investor-friendly while managing risk effectively”, Shri Modi remarked. The Prime Minister emphasized that while any policy can create a framework, its ultimate success depends on the active participation of all stakeholders. He called upon the industry to step forward with fresh investment and innovation, while urging financial institutions and analysts to assist in preparing practical solutions and strengthening market confidence. “When the government, industry, and knowledge partners move forward in unison, reforms are successfully converted into results. Budget announcements are converted into tangible results on the ground only through this collective synergy”, Shri Modi asserted.</p><p>The Prime Minister suggested the development of a \"Reform Partnership Charter”, a shared resolve between the government, industry, financial institutions, and academia. He clarified that the purpose of the post-budget webinars is no longer to discuss the budget’s contents, but to ensure its rapid and simple implementation on the ground. The Prime Minister urged all stakeholders, including financial institutions, markets, industry, professionals, and innovators, to take advantage of the new opportunities provided by this budget. He encouraged them to engage deeply with these prospects, noting that their active participation would improve the implementation of schemes, while their feedback and cooperation would yield better results. He called upon everyone to reform and grow together to create a future where the dream of a Developed India is realized as soon as possible.</p><p>Expressing full confidence in the day's deliberations, the Prime Minister emphasized that the focus must remain on simplifying processes. He clarified that while consultations are held before the budget to refine it, the post-budget webinars are specifically designed to land the budget on the ground as quickly as possible through the simplest routes. Prime Minister Shri Narendra Modi, concluded by stating that if stakeholders deliberate with the collective benefit in mind, these webinars will truly open the doors to a vibrant economy.</p><p>This year’s Union Budget lays the roadmap for Viksit Bharat, driven by technology, reforms and finance. Addressing a post-budget webinar. https://t.co/U1NJX7Byr0</p><p>हमने Processes को सरल किया है, Ease Of Doing Business को बेहतर बनाया है, Technology-Led Governance का विस्तार किया है, Institutions को मजबूत किया है और आज भी देश Reform Express पर सवार है: PM @narendramodi</p><p>पिछले एक दशक में infrastructure पर हमारा बहुत focus रहा है।हमने सोच-समझकर ये फैसला किया कि भारत का विकास... Highways, Railways, Ports, Digital Network, Power Systems जैसे ठोस Assets को तैयार करके ही होगा।ये आने वाले कई दशकों तक Productivity पैदा करेंगे।इसी वजह से Public…</p><p>जब Government, Industry और Knowledge Partners एक साथ आगे बढ़ते हैं, तब Reforms Results में बदलते हैं।तभी Announcements जमीन पर Achievements बन जाते हैं: PM @narendramodi</p><p>Read this release in: Kannada , Malayalam , Urdu , Marathi , हिन्दी , Assamese , Gujarati , Tamil</p>",
    "category": "Economy",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233449&reg=3&lang=1"
  }
]