[
  {
    "headline": "Vice President Confers Degrees on Over 1.2 Lakh Students at DU’s 102nd Convocation",
    "summaryText": "<p>Vice President's Secretariat</p><p>Vice President Confers Degrees on Over 1.2 Lakh Students at DU’s 102nd Convocation Over 50% Graduates and Over 70% Gold Medallists are Women: Vice-President Applauds Rise of Women’s EducationYouth Key to Realising Viksit Bharat @ 2047: Vice-PresidentNation First 'Rashtra Pratham' Must Guide Young Minds: Vice PresidentDegree Is Not Just a Certificate but a Commitment: Vice-PresidentSay No to Drugs, Use Social Media Responsibly: Vice President to Graduates</p><p>The Vice-President of India and Chancellor of the University of Delhi, Shri C. P. Radhakrishnan, graced as the Chief Guest at the 102nd Convocation of the University of Delhi today and conferred degrees upon over 1.2 lakh graduates.</p><p>The Vice-President of India and Chancellor of the University of Delhi, Shri C. P. Radhakrishnan, graced the 102nd Convocation of the University today as the Chief Guest and conferred degrees upon over 1.2 lakh graduates. He lauded the University’s remarkable 104-year journey and… pic.twitter.com/J6NKWsSDye</p><p>Addressing the gathering, The Vice-President lauded the University’s remarkable 104-year journey and its unwavering commitment to academic excellence and continuity.</p><p>Tracing its historic evolution, he observed that the University began with just three colleges, two faculties, eight departments, a modest library of gifted books, and 750 students. Today, it comprises 16 faculties, 86 departments, 90 colleges, 20 halls and hostels, more than 30 centres and institutes, 34 libraries, and over six lakh students. “Delhi University has indeed come a long way in its historic journey,” he remarked.</p><p>Appreciating the scale of the ceremony, the Vice-President remarked that the total number of graduating students is more than the population of many countries, reflecting the vast academic footprint of the University.</p><p>Describing the University as one of India’s most distinguished institutions of higher learning, the Vice-President said that for over a century it has nurtured minds that have gone on to lead India’s intellectual, political, scientific, and cultural life. He told the graduating students that they now join a remarkable lineage of alumni who have shaped not only India but the world.</p><p>Highlighting the University’s growing academic stature, he expressed satisfaction over its consistently improving national and international rankings. He noted that the University has retained the number one position among Indian universities in the QS World University Rankings for four consecutive years.</p><p>The Vice-President said that Convocation is not merely a ceremonial event; it marks both an ending and a beginning. It celebrates years of study, discipline, friendships, examinations, and self-discovery, while also signalling the graduates’ formal induction into a larger arena, the arena of responsibility.</p><p>He observed that the graduates are stepping into a world undergoing profound transformation. Technology is reshaping industries, artificial intelligence is redefining the nature of work, climate change is challenging models of growth, and democracies across the globe are being tested. In such a world, he said, a degree is not just a certificate but a commitment, a commitment to serve society, to use one’s skills for the greater good, to live not only for oneself but also for the betterment of the nation, and above all, to uphold the principle of “Nation First -Rashtra Pratham.”</p><p>Referring to India’s journey towards Viksit Bharat @ 2047, the Vice-President said that at this crucial juncture, the role of the youth assumes even greater significance. Under the leadership and vision of the Prime Minister, Shri Narendra Modi, he said, India has articulated the aspiration of becoming an Aatmanirbhar Bharat and building a Viksit Bharat ,a developed India by 2047, when the nation will celebrate 100 years of Independence.</p><p>He emphasized that Aatmanirbharta is the capacity to innovate, manufacture, research, and create solutions rooted in Indian realities yet globally competitive. It calls upon universities to become engines of research, entrepreneurship, and indigenous knowledge systems. Viksit Bharat, he added, stands for inclusive growth, technological leadership, social harmony, environmental sustainability, and transparent and accountable institutions. It aims to ensure that development reaches the last citizen and that opportunity becomes a promise to all.</p><p>Addressing the graduates as architects of this vision, the Vice-President said that whether they become scientists, civil servants, entrepreneurs, artists, lawyers, teachers, or innovators, they will shape the India of 2047. The realization of Aatmanirbhar Bharat and Viksit Bharat, he said, will depend on their integrity, competence, compassion, and innovative spirit.</p><p>The Vice-President expressed happiness that over 50 percent of graduates and more than 70 percent of the gold medallists are women. He also noted that the number of women receiving degrees this year exceeds that of men. He described this as a reflection of the phenomenal growth of women’s education in India. He extended his blessings and best wishes to all graduating students for their well-deserved success earned through sustained hard work.</p><p>In his concluding remarks, the Vice-President urged the graduates to carry forward the spirit of inquiry and to remember that learning is a lifelong process. He called upon them to remain grateful for the opportunities they have received and mindful of the responsibilities that accompany them. He also urged them to say “No to Drugs” and to use social media constructively rather than becoming enslaved by it.</p><p>The convocation was attended by the Vice-Chancellor of the University of Delhi, Prof. Yogesh Singh, faculty members, other dignitaries, and students.</p>",
    "category": "Environment",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233839&reg=3&lang=1"
  },
  {
    "headline": "The Evolving Spectrum of Energy Sources",
    "summaryText": "<p>The Evolving Spectrum of Energy Sources</p><p>Every day, as lights turn on across homes, schools, farms, factories, and hospitals, we rarely think about where that energy comes from. The fan that cools a classroom, the pump that waters a field, and the train that carries passengers all depend on a vast and carefully managed energy system working silently in the background.</p><p>Today, that system in India is changing. As the country advances, the focus is on ensuring reliable, affordable, cleaner, and more secure energy for every household and enterprise.</p><p>Improved power availability has been a key outcome of ongoing reforms. The average electricity availability in rural areas has increased from 12.5 hours in 2014 to 22.6 hours, while urban areas now enjoy up to 23.4 hours of power supply, up from 22.1 hours in 2014. These improvements reflect significant progress in the reliability and reach of electricity services across the country.</p><p>Today, India is among the world’s top three energy consumers, and electricity demand continues to grow every year. The total electricity generation increased from 1,739.09 Billion Units (BU) in 2023–24 to 1,829.69 BU in 2024–25, a growth of 5.21%. For 2025–26, the generation target has been set at 2,000.4 BU.</p><p>This shift is being shaped by clear government initiatives, from scaling renewable energy and launching the National Green Hydrogen Mission, to modernising nuclear laws through the Sustainable Harnessing and Advancement of Nuclear Energy for Transforming India (SHANTI) Act, strengthening energy efficiency, reforming power distribution, and building digital energy infrastructure.</p><p>India’s evolving energy spectrum is not about abandoning the old overnight. It is about carefully building the new, step by step, so that the country can power growth, improve livelihoods, and move toward its long-term commitment of achieving Net Zero emissions by 2070.</p><p>Scaling Renewable Energy: From Expansion To Global Leader</p><p>India’s renewable energy expansion reflects a policy-driven transformation that combines scale, speed, manufacturing depth, and global engagement. Meanwhile, according to the International Renewable Energy Agency (IRENA)’s Renewable Energy Statistics 2025, India ranks fourth globally in total installed renewable energy capacity.</p><p>Solar energy, in particular, has seen rapid growth; installed solar capacity rose from 3 GW in 2014 to 140 GW in January 2026. This increase has helped push non-fossil fuel capacity beyond 50 percent of total installed electricity capacity.</p><p>Wind energy also plays a substantial role: India’s cumulative installed wind capacity reached about 54.65 GW by January 2026, contributing significantly to the renewable mix and strengthening grid diversification alongside solar. Together, solar and wind account for a dominant share of India’s clean energy capacity.</p><p>Government programmes have supported this scale-up across households, agriculture, infrastructure, and manufacturing:</p><p>PM Surya Ghar has enabled 23.9 lakh households to install rooftop solar systems, adding 7 GW of distributed clean energy capacity.</p><p>Pradhan Mantri Kisan Urja Suraksha evam Utthaan Mahabhiyaan (PM-KUSUM) promotes solarisation in agriculture, reducing diesel dependence and stabilising farm energy supply. The scheme aims to install 14 lakh standalone pumps (by 31.03.2026), promoting clean rural energy use.</p><p>55 solar parks across 13 states, have been approved, with a sanctioned capacity of nearly 40 GW, accelerating large-scale deployment.</p><p>The Production Linked Incentive (PLI) Scheme, with an outlay of ₹24,000 crore, is strengthening domestic solar manufacturing and reducing import dependence.</p><p>Renewable expansion now spans generation, infrastructure, manufacturing, and global engagement. The focus has shifted from simply adding capacity to building a competitive and self-reliant clean energy ecosystem.</p><p>Green Hydrogen: Building the Next Energy Frontier</p><p>Green hydrogen has emerged as a key pillar of India’s clean energy transition, particularly for sectors where reducing emissions is difficult, such as steel, fertilisers, refining, shipping, and heavy transport.</p><p>Green Hydrogen is Hydrogen produced using renewable energy, such as solar or wind power, instead of fossil fuels. In this process, water is split into hydrogen and oxygen through electrolysis, using electricity from solar panels or wind turbines. According to standards notified by Govt of India, Hydrogen made this way is considered “green” if the total emissions from the process are very low, not more than 2 kg of CO₂ equivalent for every 1 kg of Hydrogen produced, taken as an average over last 12-month period. Green Hydrogen can also be produced by converting biomass (like agricultural waste) into hydrogen, as long as emissions remain below the same limit.</p><p>India has set a target of producing 5 million metric tonnes (MMT) of green hydrogen annually by 2030 under the National Green Hydrogen Mission (NGHM), launched in 2023. The Mission is expected to:</p><p>Attract over ₹8 lakh crore in investments</p><p>Reduce fossil fuel imports by more than ₹1 lakh crore</p><p>Avoid nearly 50 MMT of greenhouse gas emissions annually by 2030</p><p>To support this scale-up, the government has approved an outlay of ₹19,744 crore till FY 2029–30, including ₹17,490 crore under the SIGHT programme, which provides incentives for domestic electrolyser manufacturing and hydrogen production.</p><p>Implementation is already underway:</p><p>India’s first port-based green hydrogen pilot has been commissioned.</p><p>Hydrogen mobility pilots are operational across 10 routes, involving buses and trucks.</p><p>The Green Hydrogen Certification Scheme (2025) ensures that hydrogen produced in India meets defined emission standards, strengthening credibility for domestic and export markets.</p><p>Green hydrogen connects renewable energy expansion with industrial decarbonisation. It is positioned not only as an environmental solution but also as a strategic tool for energy security, manufacturing growth, and global competitiveness. Nuclear, solar, and wind energy, green hydrogen, battery storage, and critical minerals to address both energy security and transition imperatives. Together, these measures position green hydrogen as the next frontier in India’s evolving energy spectrum.</p><p>Nuclear Energy: Legislative Modernisation and Baseload Expansion</p><p>Nuclear energy provides steady, round-the-clock electricity with very low greenhouse gas emissions. As renewable energy expands, nuclear power plays an important role in ensuring grid stability and a reliable baseload supply.</p><p>India’s present nuclear capacity stands at 8.78 GW. With new reactors under development, capacity is projected to rise to 22.38 GW by 2031–32. The Government has further announced a long-term Nuclear Energy Mission with a vision of achieving 100 GW by 2047, aligning nuclear expansion with India’s clean energy and energy security goals.</p><p>A major institutional reform supporting this expansion is the Sustainable Harnessing and Advancement of Nuclear Energy for Transforming India (SHANTI) Act, 2025. The Act consolidates and modernises India’s nuclear legal framework. It:</p><p>Enables limited private sector participation under regulatory oversight</p><p>Grants statutory recognition to the Atomic Energy Regulatory Board (AERB)</p><p>Introduces a graded liability framework</p><p>Strengthens safety, security, and safeguards</p><p>Retains sovereign control over sensitive nuclear fuel-cycle activities</p><p>Complementing large reactors, the Nuclear Energy Mission allocates ₹20,000 crore for the development of Small Modular Reactors (SMRs), targeting at least five indigenously designed SMRs by 2033. These advanced reactors are designed to be more flexible, scalable, and suitable for diverse energy needs.</p><p>Strengthening Energy Efficiency & Carbon Markets</p><p>Energy efficiency is not only about producing clean energy, but it is also about using energy wisely. It means accomplishing the same tasks while consuming less electricity, fuel, or heat. This lowers costs and improves system reliability, while conservation focuses on avoiding waste.</p><p>India has strengthened its efficiency framework through policy reform and market-based mechanisms over the years.</p><p>A major shift has been the transition from the Perform, Achieve and Trade (PAT) scheme to the Carbon Credit Trading Scheme (CCTS). Under CCTS:</p><p>Emission-intensive industries are assigned greenhouse gas intensity targets.</p><p>Entities that perform better than their targets earn tradable carbon credits.</p><p>Credits can be bought and sold, creating a market incentive for efficiency improvements.</p><p>At the household level, energy efficiency programmes are being implemented to promote the adoption of efficient appliances and lighting. The UJALA programme has distributed 36.87 crore LED bulbs, resulting in:</p><p>47,883 million kWh of annual energy savings</p><p>3.88 million tonnes of CO₂ reduction per year</p><p>Do You Know? UJALA’s LED-bulb distribution model is being exported beyond India. The state of Melaka in Malaysia adopted a UJALA-type scheme under an agreement with Energy Efficiency Services Limited (EESL). Earlier, the government had launched UJALA-UK to promote efficient lighting.</p><p>Digital platforms such as the Urja Dakshata Information Tool (UDIT) further improve transparency, monitoring, and compliance across sectors.</p><p>Energy efficiency reduces demand pressure on the grid while complementing renewable expansion. It ensures that growth in electricity access does not automatically lead to proportionate growth in emissions.</p><p>Power Sector Reforms and Distribution Strengthening</p><p>Reliable electricity depends not only on how power is generated, but also on how efficiently it is transmitted, distributed, billed, and managed. Strengthening the distribution system has therefore been a central focus of reform.</p><p>Under Deen Dayal Upadhyaya Gram Jyoti Yojana (DDUGJY), Integrated Power Development Scheme (IPDS), and Pradhan Mantri Sahaj Bijli Har Ghar Yojana (SAUBHAGYA), about ₹1.85 lakh crore was invested to upgrade distribution infrastructure. As a result, 18,374 villages were electrified, and 2.86 crore households gained electricity connections, significantly expanding access across the country.</p><p>The next phase of reform has focused on improving the financial and operational health of DISCOMs. The Revamped Distribution Sector Scheme (RDSS), launched in 2021 with an outlay of ₹3.03 lakh crore, has approved projects worth ₹2.8 lakh crore to modernise infrastructure and implement smart metering.</p><p>As part of this digital transformation, 5.62 crore smart electricity meters have been installed across the country under various schemes. These meters improve billing accuracy, reduce technical and commercial losses, and enable better demand management through near real-time data.</p><p>Legislative reform complements these structural improvements. The proposed draft Electricity (Amendment) Bill, 2026, seeks to strengthen the financial viability of the sector, enhance the competitiveness of the Indian industry, promote optimal utilization of the distribution network, and improve regulatory accountability.</p><p>Draft National Electricity Policy, 2026, lays out strategies for achieving the vision of providing reliable 24x7 quality power through a financially viable and environmentally sustainable power sector, furthering energy security at an affordable price.</p><p>India Energy Stack (IES): From Energy Access to Energy Agency</p><p>IES is a Digital Public Infrastructure (DPI) designed to enable trusted digital interactions across consumers, utilities, regulators, and distributed energy assets. Conceived to address fragmented data systems and costly integrations, IES will provide common digital rails based on open standards and consent-based data sharing, while ensuring that data remains with rightful owners.</p><p>The initiative standardises data exchange to help create an ecosystem that is , interoperable, competitive, and capable of converting participation into economic value .</p><p>IES aims to transform consumers into active energy participants by enabling:</p><p>Portable and simplified onboarding across utilities</p><p>Meaningful consumer choice through consent-based data sharing</p><p>Monetisation of rooftop solar, batteries, EV chargers, and flexible loads at scale</p><p>By embedding “policy as code” and enabling near real-time settlement, IES strengthens transparency, reduces disputes, and enhances grid coordination. By aligning open innovation with system efficiency and livelihood creation, IES strengthens the energy agency, giving consumers the ability to choose and earn from the energy transition at scale.</p><p>Global Leadership and Strategic Partnerships</p><p>As India strengthens its domestic energy transition, it is also shaping global conversations on clean energy, affordability, and sustainability. International partnerships complement national reforms and position India as an active contributor to global energy solutions.</p><p>India plays a leading role in multilateral platforms such as the G20 Energy Transitions Working Group, where it has advanced cooperation on clean fuels and energy security. During its G20 Presidency, India launched the Global Biofuels Alliance (GBA), which now includes 25 countries and 12 international organisations, promoting affordable and low-carbon biofuels worldwide.</p><p>The country has further strengthened cooperation in energy efficiency by joining the International Energy Efficiency Hub (2024), aligning domestic initiatives with global best practices.</p><p>Under the UNFCCC framework, India has committed to achieving Net Zero by 2070, reducing the emissions intensity of GDP by 45% by 2030, reflecting its balanced approach to growth and climate responsibility.</p><p>Together, these engagements position India as a constructive voice of the Global South on affordable clean energy, equitable climate finance, and access to technology.</p><p>India’s global clean energy outreach is anchored in two major initiatives, the International Solar Alliance (ISA) and India Energy Week (IEW), both together advance solar cooperation and broader energy dialogue at the international level.</p><p>International Solar Alliance (ISA): Co-founded by India, ISA brings together over 125 member and signatory countries to mobilise solar finance, promote technology transfer, and expand affordable solar deployment, particularly across developing nations.</p><p>India Energy Week (IEW): Hosted by India, IEW serves as a global platform for governments, industry leaders, investors, and technology providers to engage on energy security, clean fuels, renewables, and transition pathways, strengthening India’s role as a convenor in the global energy landscape.</p><p>India’s energy journey is no longer defined by a single source; it’s now drawing strength from solar parks, rooftop panels, hydrogen pilots, modernised nuclear frameworks, smart meters, and digital platforms.</p><p>Milestones such as expanding renewable capacity, advancing the National Green Hydrogen Mission, strengthening DISCOMs, and building the India Energy Stack reflect a transition that is both structured and forward-looking. This transformation is not sudden. It is planned. It is layered. And it is supported by policy reform, infrastructure investment, technological innovation, and global cooperation.</p><p>As India moves toward its Net Zero 2070 commitment, the evolving spectrum of energy sources shows that growth and sustainability can move together. The power that supports homes, farms, factories, and data centres will come from a system designed to be resilient, inclusive, and prepared for future needs.</p><p>India is not just generating power. It is redesigning how power is produced, delivered, and shared for a future that is secure, sustainable, and self-reliant.</p><p>Ministry of Petroleum & Natural Gas (MoPNG)</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2036867&reg=3&lang=2 https://mopng.gov.in/en/page/68 https://www.pib.gov.in/PressReleasePage.aspx?PRID=1809204</p><p>Ministry of New and Renewable Energy (MNRE)</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2071486 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2183434 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2208694 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2144627 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2117501 https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2200441 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2156173 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2110283 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2042069 https://www.pib.gov.in/PressReleasePage.aspx?PRID=1763712 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2183866 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2176518 https://www.pib.gov.in/PressReleasePage.aspx?PRID=1943779 https://www.pib.gov.in/PressReleasePage.aspx?PRID=2041641 https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2111106 https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2004187 https://www.pib.gov.in/PressReleasePage.aspx?PRID=1795071 https://www.pib.gov.in/PressReleasePage.aspx?PRID=1961797</p><p>https://mnre.gov.in/en/physical-progress/ https://mnre.gov.in/en/year-wise-achievement https://mnre.gov.in/en/policies-and-regulations/schemes-and-guidelines/schemes/ https://mnre.gov.in/en/wind-policy-and-guidelines/ https://mnre.gov.in/en/national-green-hydrogen-mission https://pmkusum.mnre.gov.in/#/landing https://pmsuryaghar.gov.in/ https://cdnbbsr.s3waas.gov.in/s3716e1b8c6cd17b771da77391355749f3/uploads/2025/11/202511061627678782.pdf</p><p>https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2166110&reg=3&lang=2</p><p>https://mnre.gov.in/en/national-green-hydrogen-mission/</p><p>https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2165811&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2039091&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2138051&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2023625&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2075049&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2030686&reg=3&lang=2</p><p>https://www.indiaenergyweek.com/</p><p>https://www.pib.gov.in/PressNoteDetails.aspx?id=155063 https://www.pib.gov.in/PressNoteDetails.aspx?id=154717</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2215187&reg=3&lang=2</p><p>Ministry of Home Affairs (MHA)</p><p>https://ndmindia.mha.gov.in/ndmi/leadership-initiatives</p><p>Ministry of Environment, Forest & Climate Change (MoEFCC)</p><p>https://missionlife-moefcc.nic.in/</p><p>https://www.niti.gov.in/sites/default/files/2022-11/Mission_LiFE_Brochure.pdf https://niti.gov.in/key-initiatives/life</p><p>Parliament of India / Sansad</p><p>https://sansad.in/ls/legislation/bills https://sansad.in/getFile/annex/269/AU1111_Djrfhp.pdf?source=pqars https://sansad.in/getFile/loksabhaquestions/annex/185/AU491_lHmqAc.pdf?source=pqars https://sansad.in/getFile/loksabhaquestions/annex/186/AU1638_Yolfxg.pdf?source=pqals https://sansad.in/getFile/loksabhaquestions/annex/186/AU490_gwc1C9.pdf?source=pqals</p><p>https://www.indiabudget.gov.in/economicsurvey/</p><p>https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=1847812&reg=3&lang=2 https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=1837898&reg=3&lang=2</p><p>PIB Archived / Static Document</p><p>https://static.pib.gov.in/WriteReadData/specificdocs/documents/2022/nov/doc2022119122601.pdf</p><p>https://www.pib.gov.in/PressNoteDetails.aspx?id=156593&NoteId=156593&ModuleId=3&reg=3&lang=2</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2199729&reg=3&lang=1</p><p>https://www.pib.gov.in/PressNoteDetails.aspx?NoteId=156480&ModuleId=3&reg=3&lang=2#:~:text=Recognising%20their%20importance%2C%20India%20observes,contributions%20towards%20efficient%20energy%20use.</p><p>https://www.pib.gov.in/PressReleasePage.aspx?PRID=2219208&reg=3&lang=1</p>",
    "category": "Environment",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image003M3DI.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image004JL3V.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image006U0AG.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image007AMMP.png",
      "https://static.pib.gov.in/WriteReadData/userfiles/image/image009R7J7.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233832&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister Reaffirms Resolve to Harness Science and Technology for National Development and Global Good on National Science Day",
    "summaryText": "<p>Prime Minister Reaffirms Resolve to Harness Science and Technology for National Development and Global Good on National Science Day</p><p>The Prime Minister highlighted that, on National Science Day, we celebrate the spirit of research, innovation, and scientific curiosity that drives our nation forward.</p><p>PM Modi stated that, “This day commemorates the groundbreaking discovery of the Raman Effect by Sir CV Raman”. The Prime Minister noted that this discovery placed Indian research firmly on the global map.</p><p>The Prime Minister reaffirmed that our resolve to empower our youth, strengthen research ecosystems, and harness science and technology for national development and global good.</p><p>The Prime Minister wrote on X;</p><p>Today, on National Science Day, we celebrate the spirit of research, innovation and scientific curiosity that drives our nation forward.</p><p>This day commemorates the groundbreaking discovery of the Raman Effect by Sir CV Raman. This discovery placed Indian research firmly on the global map.</p><p>We reaffirm our resolve to empower our youth, strengthen research ecosystems and harness science and technology for national development and global good.</p><p>Today, on National Science Day, we celebrate the spirit of research, innovation and scientific curiosity that drives our nation forward.This day commemorates the groundbreaking discovery of the Raman Effect by Sir CV Raman. This discovery placed Indian research firmly on the… pic.twitter.com/YcjOAdPosr</p><p>Read this release in: Urdu , हिन्दी , Assamese , Gujarati , Malayalam</p>",
    "category": "General",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2233830&reg=3&lang=1"
  }
]