[
  {
    "headline": "TRAI Assesses Quality of Mobile across Bikaner City, Nokha & Shri Dungargarh towns , Deshnok to Norangdesar Highway (Part of Amritsar to Jamnagar Bharatmala National Highway(NH 754A)) & Pugal to Ranjeetpura National Highway (NH-911) in Bikaner District",
    "summaryText": "<p>Ministry of Communications</p><p>TRAI Assesses Quality of Mobile across Bikaner City, Nokha & Shri Dungargarh towns , Deshnok to Norangdesar Highway (Part of Amritsar to Jamnagar Bharatmala National Highway(NH 754A)) & Pugal to Ranjeetpura National Highway (NH-911) in Bikaner District</p><p>The Telecom Regulatory Authority of India (TRAI) released findings of Independent Drive Test (IDT) conducted across Bikaner City, Nokha & Shri Dungargarh towns, Deshnok to Norangdesar Highway (Part of Amritsar to Jamnagar Bharatmala National Highway (NH 754A)) & Pugal to Ranjeetpura National Highway (NH-911) in Bikaner District in Rajasthan LSA, during the month of January 2026, for information of general telecom consumers. The purpose of this drive test is to assess and verify real world quality of mobile network services (both voice & data) provided by Telecom Service Providers (TSPs).</p><p>During the IDT, TRAI Captures live performance data of mobile network of all service providers on key performance indicators (KPIs) like Call setup success rate, data download and upload speeds, speech quality, etc. Multiple advanced test handsets are used and the sessions are monitored in real-time and analysed using advanced Software Systems. The results of the IDT are published on TRAI website and in newspapers to inform consumers and to encourage TSPs to improve their services.</p><p>TRAI Regional Office, Jaipur, through its appointed agency, conducted detailed drive tests in Bikaner district of Rajasthan covering distance of 293.8 KMs in Bikaner City, Nokha & Shri Dungargarh towns, 41.1 Km of Deshnok to Norangdesar Highway and 104.2 Kms of Pugal to Ranjeetpura National Highway (NH-911) during 13.01.2026 to 16.01.2026. A summary of IDT findings of mobile services is given as below:</p><p>Bikaner City ,Nokha & Shri Dungargarh towns in Bikaner District.</p><p>KPIs (Auto-selection mode (5G/4G/3G/2G)</p><p>Call Setup Time Average (Second)</p><p>Call Silence rate (Mute Call)</p><p>Average Download Throughput 5G</p><p>Average Upload Throughput 5G</p><p>Average Download Throughput 4G</p><p>Average Upload Throughput 4G</p><p>Latency ( 50th percetile )</p><p>b. Deshnok to Norangdesar Highway (Part of Amritsar to Jamnagar Bharatmala National Highway (NH 754A)) in Bikaner District:</p><p>Average Download Throughput</p><p>c. Pugal to Ranjeetpura National Highway (NH-911) in Bikaner District:</p><p>The drive test covered all important areas of Bikaner City, Nokha & Shri Dungargarh towns, Deshnok to Norangdesar Highway (Part of Amritsar to Jamnagar Bharatmala National Highway (NH 754A)) & Pugal to Ranjeetpura NH-911 Highway city including Nokha, Bikasar, Budhro ki dhani, Rasisar, Palana, Udairamsagar, Gangashar, Sarah Kajani, Mukta Prasad Nagar, Norangdesar, Seruna, Jodhasar, Shri Dungargarh, Pugal to Ranjeetpura passing through Gangajali, Dantour,Miranwala, Karnisar, Miyawala, Kandharli and Gour etc.</p><p>The findings of this IDT report have been shared with respective TSPs for taking further necessary action at their end, if required. Detailed report of IDT is made available on the TRAI website at www.trai.gov.in. For any clarification or additional information, an email can be sent to Regional office of TRAI at Jaipur on Email id adv.jaipur@trai.gov.in.</p>",
    "category": "Infrastructure",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234409&reg=3&lang=1"
  },
  {
    "headline": "India AI Impact Summit 2026: Landmark Global Declaration and Major AI Investment Commitments",
    "summaryText": "<p>Ministry of Electronics & IT</p><p>India AI Impact Summit 2026: Landmark Global Declaration and Major AI Investment Commitments</p><p>The India AI Impact Summit 2026, held from 16–21 February 2026, marked a significant milestone in the global artificial intelligence landscape. The Summit witnessed extensive participation, with approximately 6 lakh attendees in person and over 9 lakh cumulative views through live virtual streaming. Delegations from more than 100 countries and 20 international organisations participated in the proceedings.</p><p>During the Summit, India achieved a Guinness World Record for the “Most pledges received for an AI responsibility campaign in 24 hours,” with over 2.5 lakh validated pledges reaffirming public commitment towards responsible AI adoption.</p><p>A key announcement at the Summit was the expansion of India’s sovereign compute capacity. In addition to the 38,000+ GPUs already provisioned under the IndiaAI Mission, an additional 20,000 GPUs will be added in the coming weeks, further strengthening national AI infrastructure.</p><p>Global Declarations and Strategic AI Partnerships</p><p>The Summit focused on advancing frameworks for responsible, resilient and inclusive AI adoption at the global level.</p><p>The India AI Impact Summit Declaration was endorsed by 92 countries and international organisations. The Declaration acknowledges the work undertaken by seven thematic working groups during the Summit.</p><p>The New Delhi Frontier AI Impact Commitments were announced by 13 leading global and Indian frontier model developers to promote trustworthy and inclusive AI deployment.</p><p>Launch of the Global AI Impact Commons (http://aiimpactcommons.global), a voluntary initiative featuring 80+ impact stories across 30+ countries, enabling nations to share, replicate, and scale successful AI use cases for economic growth and social good.</p><p>Release of the Equitable AI Transition Playbook in partnership with the International Labour Organization, aimed at preparing workers for emerging AI-driven opportunities.</p><p>Signing of the Voluntary Guiding Principles for Resilient, Innovative and Efficient AI, endorsed by over 20+ countries.</p><p>Signing of the Voluntary Guiding Principles for Reskilling in the Age of AI, endorsed by 23 countries.</p><p>Adoption of the Charter for the Democratic Diffusion of AI, supported by 22 countries and international institutions.</p><p>Launch of the Resilient AI Challenge in partnership with UNESCO and France.</p><p>Release of the Playbook for Advancing Resilient AI Infrastructure.</p><p>Announcement of the Trusted AI Commons, with 22 partner countries prior to formal launch.</p><p>Release of Guidance Notes on AI Governance, endorsed by 22 countries.</p><p>Announcement of the Alliance for Advancing Inclusion Through AI, endorsed by 20 countries and UNICEF.</p><p>Launch of the Network of AI for Science Institutions, with 19 partner countries at inception.</p><p>AI Impact Expo, Knowledge Outputs and Grassroots Adoption</p><p>The AI Impact Expo emerged as one of the largest AI exhibitions globally, with over 850 exhibitors across 10 thematic pavilions.</p><p>At Bharat Mandapam, New Delhi, a live demonstration was conducted of an open-sourced handheld assistive device capable of visually recognising objects and environments based on voice queries and responding in multiple languages. The prototype, developed by BHASHINI and Current AI, was opened to the startup ecosystem for further technical enhancement and use-case development.</p><p>Six global casebooks documenting high-impact AI deployments were released, covering:</p><p>AI in Gender Empowerment (with UN Women)</p><p>AI in Agriculture (with the Government of Maharashtra, supported by the World Bank)</p><p>AI in Education (with CSF and EkStep Foundation)</p><p>AI in Accessibility (with ALIMCO, IIIT-Bangalore and ChangeInkk Foundation)</p><p>The AI Impact Startup Book was also launched by MeitY, presenting insights into India’s AI and deep-tech startup ecosystem.</p><p>Demonstrating grassroots digital adoption, approximately 80% of food court transactions during the Summit were conducted through UPI.</p><p>Major Investment Announcements</p><p>The Summit catalysed significant investment commitments across the AI value chain.</p><p>Over USD 200 billion in AI-related investments are expected across infrastructure, foundation models, hardware and applications.</p><p>Reliance Industries pledged USD 110 billion over seven years towards AI-focused infrastructure.</p><p>Tata Group announced a partnership with OpenAI to scale AI-ready data centres.</p><p>Adani Enterprises announced plans to invest USD 100 billion by 2035.</p><p>General Catalyst announced a USD 5 billion investment commitment over five years, while Lightspeed Venture Partners announced USD 10 billion in investments.</p><p>Sundar Pichai, CEO of Google, announced investments including new India–US subsea cable routes and a USD 15 billion AI hub in Visakhapatnam. Google will train 20 million civil servants, support 11 million students, and expand AI research collaborations.</p><p>The India AI Impact Summit 2026 concluded with the adoption of forward-looking commitments and strategic partnerships that advance a shared global vision for responsible, inclusive and development-oriented Artificial Intelligence. The outcomes of the Summit reflect a broad international consensus to harness AI for economic growth, social empowerment and sustainable development, while ensuring resilience, equity and democratic access to emerging technologies.</p><p>Read this release in: Urdu , हिन्दी</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234343&reg=3&lang=1"
  },
  {
    "headline": "The Prime Minister shares a Sanskrit Subhashitam; highlighting the importance of self confidence and will power",
    "summaryText": "<p>The Prime Minister shares a Sanskrit Subhashitam; highlighting the importance of self confidence and will power</p><p>In a message highlighting the strength of the nation's youth, the Prime Minister shared a Sanskrit Subhashitam to underscore the importance of self-confidence and will power.</p><p>The Prime Minister emphasised that the determination of Bharat’s youth power is incomparable. He noted that our young friends accomplish whatever they resolve to do, which is why the country is realizing its dreams today. ​ The Prime Minister shared on x;</p><p>\"भारतवर्ष की युवाशक्ति का दृढ़ संकल्प अतुलनीय है। हमारे युवा साथी जो ठान लेते हैं, वो करके दिखाते हैं। यही वजह है कि आज हमारा देश अपने सपनों को साकार कर रहा है।</p><p>न वा उ मां वृजने वारयन्ते न पर्वतासो यदहं मनस्ये।</p><p>मम स्वनात् कृधुकर्णो भयात एवेदनु द्यून्किरणः समेजात्।।\" ​ ​Profound is the power of your self-confidence. Nobody can crush your self-determination. Even big obstacles of the size of a big mountain cannot obstruct your path. You are more powerful than the sun, provided you have the strength of will power.</p><p>भारतवर्ष की युवाशक्ति का दृढ़ संकल्प अतुलनीय है। हमारे युवा साथी जो ठान लेते हैं, वो करके दिखाते हैं। यही वजह है कि आज हमारा देश अपने सपनों को साकार कर रहा है। न वा उ मां वृजने वारयन्ते न पर्वतासो यदहं मनस्ये।मम स्वनात् कृधुकर्णो भयात एवेदनु द्यून्किरणः समेजात्।। pic.twitter.com/vh6QABNncx</p><p>Read this release in: Urdu , हिन्दी , Assamese , Manipuri , Gujarati , Malayalam</p>",
    "category": "General",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234327&reg=3&lang=1"
  },
  {
    "headline": "The Prime Minister speaks with the Prime Minister of Israel",
    "summaryText": "<p>The Prime Minister speaks with the Prime Minister of Israel</p><p>Prime Minister Shri Narendra Modi held a telephone conversation with the Prime Minister of Israel, Benjamin Netanyahu, to discuss the current regional situation.</p><p>​During the call, the Prime Minister conveyed India's concerns regarding recent developments and emphasised the safety of civilians as a priority.</p><p>​The Prime Minister Modi further reiterated India's position on the need for an early cessation of hostilities.</p><p>Had a telephone call with PM Benjamin Netanyahu to discuss the current regional situation. Conveyed India's concerns over recent developments and emphasised the safety of civilians as a priority. India reiterates the need for an early cessation of hostilities.@netanyahu</p><p>שוחחתי בטלפון עם ראש הממשלה בנימין נתניהו כדי לדון במצב האזורי הנוכחי. הבעתי את דאגתה של הודו לנוכח ההתפתחויות האחרונות, והדגשתי כי ביטחון האזרחים נמצא בעדיפות עליונה. הודו שבה ומדגישה את הצורך בהפסקת פעולות האיבה בהקדם.@netanyahu</p><p>Read this release in: Urdu , हिन्दी , Assamese , Manipuri , Gujarati , Kannada , Malayalam</p>",
    "category": "International Relations",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234324&reg=3&lang=1"
  },
  {
    "headline": "Prime Minister Shri Narendra Modi speaks with the President of the UAE Sheikh Mohamed bin Zayed Al Nahyan",
    "summaryText": "<p>Prime Minister Shri Narendra Modi speaks with the President of the UAE Sheikh Mohamed bin Zayed Al Nahyan Prime Minister strongly condemns the attacks on the UAE and expressed his condolences for the loss of lives in these attacks</p><p>The Prime Minister, Shri Narendra Modi, spoke with the President of the United Arab Emirates, Sheikh Mohamed bin Zayed Al Nahyan.</p><p>The Prime Minister strongly condemned the attacks on the UAE and condoled the loss of lives in these attacks. He expressed that India stands in solidarity with the UAE in these difficult times.</p><p>The Prime Minister thanked the UAE President for taking care of the Indian community living in the UAE. He further emphasized that India supports de-escalation, regional peace, security and stability in the region.</p><p>The Prime Minister Shared on X:</p><p>\"Spoke with President of the UAE, my brother Sheikh Mohamed bin Zayed Al Nahyan. Strongly condemned the attacks on the UAE and condoled the loss of lives in these attacks. India stands in solidarity with the UAE in these difficult times.</p><p>Thanked him for taking care of the Indian community living in the UAE. We support de-escalation, regional peace, security and stability.\"</p><p>Spoke with President of the UAE, my brother Sheikh Mohamed bin Zayed Al Nahyan. Strongly condemned the attacks on the UAE and condoled the loss of lives in these attacks. India stands in solidarity with the UAE in these difficult times. Thanked him for taking care of the Indian…</p><p>Read this release in: Urdu , हिन्दी , Gujarati , Malayalam</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234323&reg=3&lang=1"
  },
  {
    "headline": "Press Release",
    "summaryText": "<p>The Cabinet Committee on Security (CCS) met this evening under the chairmanship of the Prime Minister to review the evolving situation in West Asia.</p><p>The Committee was briefed on the air strikes in Iran on 28 February and the subsequent escalation, including attacks in several Gulf countries. It expressed serious concern over the safety and security of the large Indian expatriate community in the region.</p><p>The CCS also reviewed the difficulties faced by Indian travellers transiting the region and students appearing for scheduled examinations, as well as the broader implications for regional security and economic and commercial activities.</p><p>The CCS directed all concerned departments to take necessary and feasible measures to assist Indian nationals affected by the developments. It underscored the importance of an early cessation of hostilities and a return to dialogue and diplomacy.</p><p>Read this release in: Urdu , हिन्दी , Manipuri , Assamese , Gujarati , Kannada</p>",
    "category": "Defence",
    "imageUrl": "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png",
    "imageUrls": [
      "https://static.pib.gov.in/WriteReadData/specificdocs/photo/2021/aug/ph202183101.png"
    ],
    "articleUrl": "https://www.pib.gov.in/PressReleaseIframePage.aspx?PRID=2234325&reg=3&lang=1"
  }
]